{
  "id": 107982,
  "info": {
    "name": "Remove Donation Message on Archive.org",
    "description": "Remove the donation message on archive.org and keep your screen space maximized!\r\n\r\nStill works in 2019.",
    "additionalInfo": "Fundraising text 2018:\r\nDear Wayback Supporter,\r\nI ask only once a year: please help the Internet Archive today. The average donation is $45. If everyone chips in $5, we can end this fundraiser today. Right now, your donation will be matched 2-to-1, tripling your impact! All we need is the price of a paperback book to sustain a library the whole world trusts. We’re dedicated to reader privacy. We never accept ads. But we still need to pay for servers and staff. This year, we’ve fixed 1.5 million broken Wikipedia links using the Wayback Machine. I know we could charge money, but then we couldn’t achieve our mission: a free library for the whole internet. The Internet Archive is a bargain, but we need your help. If you find our site useful, chip in what you can today. Thank you.\r\n—Brewster Kahle, Founder, Internet Archive\r\n\r\nFundraising text 2015:\r\n\r\nDear Internet Archivists: It shouldn't cost you to give something away. On the Web, people share things for free, but corporations charge a lot to store and serve that data. The Internet Archive believes in an open internet. Here you can preserve your cultural treasures forever. For free. The good news is people care. They download 20 million books here each month. We get more visitors in a year than most libraries do in a lifetime. The key is to keep it free. That's where you can help us. Internet Archive is a non-profit. We don't run ads, but still need to pay for servers and staff. If everyone reading this gave $75, we could end our fundraiser right now. It's is a small amount to inform millions. Help us do more. Thank you.**\r\n**Thanks to our friends at Wikimedia for making their fundraising data open source.\r\n\r\nScript updated in 2018.",
    "format": "uso",
    "category": "archive",
    "createdAt": "2014-12-06T09:52:34Z",
    "updatedAt": "2018-12-17T21:51:06Z",
    "license": "CC0-1.0",
    "author": {
      "id": 166121,
      "name": "Smile4ever",
      "homepage": "http://www.hugsmile.eu",
      "paypalEmail": null
    }
  },
  "stats": {
    "installs": {
      "total": 400,
      "weekly": 2
    },
    "rating": null
  },
  "screenshots": {
    "main": {
      "name": "107982-0.webp",
      "archived": true
    },
    "additional": [
      {
        "name": "107982-1.webp",
        "archived": true
      },
      {
        "name": "107982-2.webp",
        "archived": true
      }
    ]
  },
  "obsolete": null,
  "style": {
    "css": "@namespace url(http://www.w3.org/1999/xhtml);\r\n@-moz-document domain(\"archive.org\"){\r\n   #donation-banner,#donate,#donate-banner,#donate_banner{display: none !important;}\r\n}\r\n\r\n",
    "settings": []
  },
  "deleteReason": null
}