{
  "id": 1119,
  "info": {
    "name": "Icons-Only Menubar",
    "description": "Supplement style to style 1123 or style 1484 that completely replaces the menubar text with icons. Apply it along with either one of those styles (not both) and it will switch it to Icons Only.\r\nThis will do absolutely nothing without either of those styles applied as well.\r\n\r\nThe Before screenshot is of style 1123 with Icons Only.\r\nThe After screenshot is of style 1484 with Icons Only.",
    "additionalInfo": ">2006-11-20:\r\n-Realized and decided that I could save on tons of repeat code by turning this style into a supplement of the other one and removing everything except the very few additional lines that were in this one and not the other. This also makes updates much easier (for me), since this one should never need another update (in theory), leaving me with only the need to do updates for one style rather than two. This was also a necessary step for a project I'm working on at the moment with Static_Rage (the main dev of CuteMenus - Crystal SVG).\r\n-Now still shows the menu text on unsupported menus (those with no icon) rather than a red X.\r\n>2006-11-26:\r\n-Fixed incompatibility with recent versions of CuteMenus - Crystal SVG with FlatStyle menus enabled.\r\n-Made compatible with a padding fix in sister style.\r\n>2006-11-27:\r\n-Fix for the previous fix: Use correct padding for menus with no icons.\r\n>2006-11-28:\r\n-Fixed items having zero vertical padding in some themes on menubars with nothing else on them to affect their height.\r\n-Some minor changes to keep it working right with the main style's changes.\r\n>2006-12-03:\r\n-Fixed no padding appearing in Thunderbird.\r\n>2006-12-16:\r\n-Made compatible with both related styles simultaneously.",
    "format": "uso-firefox",
    "category": "browser",
    "createdAt": "2006-10-08T23:45:51Z",
    "updatedAt": "2006-10-08T23:45:51Z",
    "license": "NONE",
    "author": {
      "id": 9,
      "name": "XerBlade",
      "homepage": "https://www.xerblade.com",
      "paypalEmail": "xerblade+micropayments@gmail.com"
    }
  },
  "stats": {
    "installs": {
      "total": 2357,
      "weekly": 0
    },
    "rating": null
  },
  "screenshots": {
    "main": {
      "name": "1119-0.webp",
      "archived": true
    },
    "additional": null
  },
  "obsolete": {
    "obsoletedBy": null,
    "message": "obsolete"
  },
  "style": {
    "css": "@namespace url(http://www.mozilla.org/keymaster/gatekeeper/there.is.only.xul);\r\n\r\nmenubar > menu > .menu-iconic-text {\r\n   display: none !important;\r\n}",
    "settings": []
  },
  "deleteReason": null
}