{
  "id": 115809,
  "info": {
    "name": "Floating Full Screen Toolbox",
    "description": "This style changes how Firefox behaves in full screen mode (F11).  It makes the toolbox (tabs and navigation toolbars) be displayed covering the page content instead of it being inserted in the screen when Firefox is in full screen.  This is like Internet Explorer 10.  This way the web page content stays in place and does not scroll down when the top of the screen is reached to show the toolbox, and scrolls back up when the toolbox hides.  This style also fixes the problem of Firefox not using/displaying on the top row of pixels when in full screen.  Additionally, this style prevents the toolbox from hiding when customizing Firefox in full screen.  Please read the notes for details on this and the style options.",
    "additionalInfo": "<b>Recognition and Disclaimer</b>\r\nAfter I published this style, I found there is an earlier style, <a href=\"https://userstyles.org/styles/85350/firefox-fullscreen-floating-hidden-toolbars\">Firefox fullscreen - Floating hidden toolbars</a> by <a href=\"https://userstyles.org/users/18532\">frog</a>, which has the same basic effect on the toolbox.  Although that style was done before, I developed <i>Floating Full Screen Toolbox</i> independently and unaware of that earlier style.  Indeed, I found enough differences for not removing this style. \r\n\r\n<b>Important Note</b>\r\nThis style works better when combined with a complete theme with a narrow toolbox.  This is because Firefox sets to hide the toolbox once the pointer reaches 50 pixels or more below the top of the screen.   I cannot change this with css alone.  For this reason it is best to access any controls in the navigation bar from above without lowering the pointer below that invisible 50 pixel limit.  However the style will prevent  the toolbox form hiding while the pointer hovers on it.  Activating of some toolbox controls may prevent hiding the toolbox, but only if activated before reaching below the 50 pixel limit.  Keep this in mind before thinking there is an inconsistent or erratic behavior of the toolbox with this style.\r\n\r\n<b>Border and Shadow Options</b>\r\nBy default the style adds a lower border to the toolbox colored ThreeDShadow (gray?).  When this style is combined with a dark theme for Firefox, it is best to exclude this border.  The style may position this border incorrectly when combined with some complete themes for Firefox.  An alternative position is provided for correcting this problem.  The style also adds a shadow to the toolbox by default.  The shadow may be omitted.  If both the border and shadow are displayed, their position should match (normal or alternative position).\r\n\r\n<b>Warning</b>\r\n<strike>There is a problem with this style and html5 full screen video:  If you are browsing in fullscreen mode and expand (native) html5 video into fullscreen, when you reach the top of the screen the toolbox panel will cover the top of the video but it will not hide when you move the pointer away from it.  The solution: Exit fullscreen browsing mode before switching html5 video into fullscreen mode; Firefox would leave fullscreen browsing when you exit fullscreen video anyway!  My other solution would be letting the toolbox hide when the pointer farther than 50 pixels from the top of the screen, even while hovering on the toolbox.  I do not like that alternative but I could make it into an option if I find no other possibility. Certainly there is no such problem if you are using a Flash video player.</strike>  This problem is in Firefox 39 but not present in Firefox 40.0.3 nor the versions being developed.\r\n\r\n<b>Other notes</b>\r\nIn full screen mode Firefox uses the top row of pixels in the screen to recall/show the toolbox.  But this style makes these pixels available to display web page content, thus any web page functionality associated with the top row of pixels in the page may be impaired.  I know of web pages where this is a problem.  However, if a web page has buttons or other controls by the top of the page, the top row of pixels in the screen has to be avoided when reaching the controls while using this style.  If the top of row of pixels is reached, that triggers showing the toolbox possibly covering any controls that were visible on the top of a web page.\r\n\r\nWhen using this style, if you try to customize Firefox while in full screen, it will show the toolbar inserted at (not covering) the top of the screen.  Then the style will prevent hiding the toolbox.  However, the only visible toolbars in full screen are the tabs and the navigation bar.\r\n\r\nI have only tested this to work Firefox on Windows 8 with a limited selection of Firefox themes.  High contrast Windows themes are a problem for this style.\r\n\r\nThe update on the 24th day of July 2015 corrects showing the border of a sidebar (e.g., of the history sidebar) through the tabs.",
    "format": "uso",
    "category": "browser",
    "createdAt": "2015-06-30T18:54:14.000Z",
    "updatedAt": "2015-07-24T10:36:43.000Z",
    "license": "CC-BY-NC-SA-4.0",
    "author": {
      "id": 285815,
      "name": "graciliano"
    }
  },
  "stats": {
    "installs": {
      "total": 197,
      "weekly": 0
    }
  },
  "screenshots": {
    "main": {
      "name": "115809_after.png",
      "archived": true
    },
    "additional": [
      {
        "name": "115809_additional_15686.png",
        "archived": true
      },
      {
        "name": "115809_additional_15687.png",
        "archived": true
      }
    ]
  },
  "discussions": {
    "stats": {
      "discussionsCount": 1,
      "commentsCount": 0
    },
    "data": [
      {
        "id": 50394,
        "title": "Additions for compatibility with Classic Theme Restorer",
        "createdAt": "2016-07-01T22:21:45.000Z",
        "author": {
          "id": 131773,
          "name": "strel"
        }
      }
    ]
  },
  "style": {
    "css": "@namespace url(http://www.mozilla.org/keymaster/gatekeeper/there.is.only.xul);\r\n\r\n\r\n#fullscr-toggler {\r\n margin-bottom: -1px;\r\n opacity: 0;\r\n}\r\n\r\n#main-window[inFullscreen]:not([customizing]) #navigator-toolbox{\r\n  position: fixed;\r\n  width:100%;\r\n  z-index: 1;\r\n}\r\n\r\n#main-window[inFullscreen]:not([customizing]) #navigator-toolbox:hover{\r\n  margin-top:0 !important;\r\n}\r\n\r\n/*[[BORDER]]*/\r\n/*[[SHADOW]]*/\r\n/****************************************************************/\r\n\r\n#main-window#main-window[inFullscreen]:not([customizing]) #navigator-toolbox #TabsToolbar,\r\n#main-window#main-window[inFullscreen]:not([customizing]) #navigator-toolbox #nav-bar{\r\n  background-color: ActiveBorder;\r\n  width: 100%;\r\n}\r\n\r\n#main-window[inFullscreen]:not([customizing]) #navigator-toolbox toolbar:not([id=\"TabsToolbar\"]):not([id=\"nav-bar\"]){\r\n  display: none;\r\n}\r\n\r\n\r\n#main-window[inFullscreen][customizing] #navigator-toolbox{\r\n  margin-top: 0 !important;\r\n}\r\n\r\n#main-window[inFullscreen][customizing] #fullscr-toggler{\r\n  height: 0px !important;\r\n  max-height: 0px !important;\r\n  min-height: 0px !important;\r\n  display: none;\r\n}\r\n\r\n",
    "settings": [
      {
        "key": "BORDER",
        "label": "Border:",
        "type": "dropdown",
        "options": [
          {
            "key": "BORDER_NIL",
            "label": "no",
            "value": "",
            "default": false
          },
          {
            "key": "BORDER_BOX",
            "label": "yes (normal)",
            "value": "/*** BORDER_BOX *************************************************/\r\n#main-window[inFullscreen]:not([customizing]) #navigator-toolbox{\r\n  border-bottom: 1px solid ThreeDShadow;\r\n}",
            "default": true
          },
          {
            "key": "BORDER_ALT",
            "label": "yes (alt. position)",
            "value": "/*** BORDER_ALT *************************************************/\r\n#main-window[inFullscreen]:not([customizing]) #navigator-toolbox #nav-bar{\r\n  border-bottom: 1px solid ThreeDShadow;\r\n}",
            "default": false
          }
        ]
      },
      {
        "key": "SHADOW",
        "label": "Shadow:",
        "type": "dropdown",
        "options": [
          {
            "key": "SHADOW_NIL",
            "label": "no",
            "value": "/*** SHADOW_NIL **************************************************/",
            "default": false
          },
          {
            "key": "SHADOW_BOX",
            "label": "yes (normal)",
            "value": "/*** SHADOW_BOX *************************************************/\r\n#main-window[inFullscreen]:not([customizing]) #navigator-toolbox:hover,\r\n#main-window[inFullscreen]:not([customizing]) #navigator-toolbox:not([style*=\"margin-top: -\"]){\r\n  box-shadow: 0px 0px 12px rgba(0,0,0,.45);\r\n}",
            "default": true
          },
          {
            "key": "SHADOW_ALT",
            "label": "yes (alt. position)",
            "value": "/*** SHADOW_ALT *************************************************/\r\n#main-window[inFullscreen]:not([customizing]) #navigator-toolbox:hover #nav-bar,\r\n#main-window[inFullscreen]:not([customizing]) #navigator-toolbox:not([style*=\"margin-top: -\"]) #nav-bar{\r\n  box-shadow: 0px 6px 12px -6px rgba(0,0,0,.45);\r\n}",
            "default": false
          }
        ]
      }
    ]
  }
}