{
  "id": 129382,
  "info": {
    "name": "Flight Rising: Show Awakened Familiars",
    "description": "*#* OUTDATED: No longer updating or adding in familiars *#*\r\n\r\nSlightly fades and adds a border around awakened familiars. \r\n\r\nUser must manually add their awakened familiars to the CSS for it to work.\r\n\r\nThere's a google spreadsheet <a href=\"https://docs.google.com/spreadsheets/d/1bRsBZLqAJJ3tdHr41xyis89zemXURbuEynL2taxf7XA/edit?usp=sharing\"> up here </a> to help create the codes.\r\n\r\nMake sure to back up your list of awakened familiars. Just in case this thing clears itself for some reason.",
    "additionalInfo": "*#* OUTDATED: No longer updating or adding in new familiars to the spreadsheet *#*\r\n<b>Last updated 21 May 2017\r\nNewest Familiars on spreadsheet:</b> Gem MP Capricats from the \"Savannah and Safari\" Update 20-May-2017\r\n\r\n___\r\n<b>Change Log:</b> \r\n(21-May-2017) - Sorted the new familiars back into alphabetical order. \r\n\r\nAlso I have decided that I've lost interest in keeping this style up to date. If anybody wants to contribute to updating the spreadsheet, they are more than welcome. Just link your updated spreadsheet in the feedback/discussion section. When doing so, don't forget to comment on the latest familiar you have added or any edits you have made. \r\n\r\n\r\n(1-May-2017) - Added Water Goblin & New Training Fields Mobs. Thinking of removing the border from the style to lessen the burden of adding data to the sheets.\r\n(6-Feb-2017) - Sorted the new familiars back into alphabetical order.\r\n(22-Jan-2017) - Sorted the new familiars back into alphabetical order.\r\n(24-Oct-2016) - Unmerged the columns in the \"Add new familiar\" sheets because it was being annoying when copying things over. Sorted the new familiars back into alphabetical order.\r\n(14-Oct-2016) - Moved the greasemonkey code into the non-baldwin tab and changed to sheet colours to look nicer/ more colour coded. Changed the name of the first sheet from \"Chart\" to \"original code\".\r\n(23-Sep-2016) - GoldThroated Sparrow formerly recorded as ID#3071, now corrected to ID#727 and Yellow-Throated sparrowmouse corrected to ID#3071\r\n(13-Sep-2016) - Added greasemonkey-friendly code sheets\r\n\r\n\r\n\r\nTo avoid the displacement problem in baldwin, remove\r\n\" border: inset 2px orange; border-radius: 12px; \"\r\nfrom the CSS and just set opacity to a decimal between 0.1 and 0.9. I like 0.4\r\n\r\n<b>Safari compatibility issue:</b> remove apostrophes from familiar names. For some reason the stylish add-on for safari doesn't ignore them.\r\n___\r\n\r\n<b>How it works/ how to add familiars to the CSS:</b>\r\n\r\nIf you already have a list of awakened familiars, good on you! Copy-paste it into the yellow section of the spreadsheet and it should spit out the codes you need. Copy these codes.\r\n\r\nIn your browser, go to manage styles > find this one in the list > edit > paste the codes into the area specified > save. The stylish should now work.\r\n\r\n- - - -\r\n\r\nTo add the familiar manually to the CSS, you'll need to find it's item ID, to find it yourself, right-click the familiar icon, copy image location and you should get something like \"http://flightrising.com/images/cms/familiar/341.png\", in this case, 341 is the ID. For mass familiar updates, if you know how to, use your browser's web developer tools to inspect the code and it'll be quicker then  the other method.\r\n\r\nIf you missed it above, <a href=\"https://docs.google.com/spreadsheets/d/1bRsBZLqAJJ3tdHr41xyis89zemXURbuEynL2taxf7XA/edit?usp=sharing\">Here's the google Spreadsheet, you'll need to make a copy.</a>\r\n\r\nNote: Only applies to the official FR images.\r\n\r\nMake sure to back up your list of awakened familiars. Just in case this thing clears itself for some reason.\r\n\r\n\r\n\r\n\r\n\r\nBase coding was copied from Milay's <a href=\"https://userstyles.org/styles/112858/flight-rising-highlight-swipp-bald-items-jun-16\">highlight Baldwin/swipp items stylish </a>\r\n\r\nUse at your own risk/discretion. Not affiliated with or endorsed by FR or its admins.",
    "format": "uso",
    "category": "flightrising",
    "createdAt": "2016-06-24T09:59:59.000Z",
    "updatedAt": "2016-10-14T12:00:23.000Z",
    "license": "CC-BY-NC-SA-4.0",
    "author": {
      "id": 340576,
      "name": "Fin"
    }
  },
  "stats": {
    "installs": {
      "total": 1895,
      "weekly": 7
    }
  },
  "screenshots": {
    "main": {
      "name": "129382_after.png",
      "archived": true
    },
    "additional": [
      {
        "name": "129382_additional_20775.png",
        "archived": true
      },
      {
        "name": "129382_additional_20776.png",
        "archived": true
      },
      {
        "name": "129382_additional_20806.jpeg",
        "archived": true
      }
    ]
  },
  "discussions": {
    "stats": {
      "discussionsCount": 1,
      "commentsCount": 3
    },
    "data": [
      {
        "id": 51409,
        "title": "Suggestion for improvement on data in spreadsheet",
        "createdAt": "2016-09-06T19:54:50.000Z",
        "author": {
          "id": 333734,
          "name": "Sister Raven Dreamer"
        }
      }
    ]
  },
  "style": {
    "css": "@-moz-document url-prefix(\"http://flightrising.com/main.php?p=bestiary\"), url-prefix(\"http://flightrising.com\"), url-prefix(\"http://www1.flightrising.com\"), url-prefix(\"http://flightrising.com/main.php?p=hoard\") \r\n{\r\n\r\n/* AWAKENED FAMILIARS \r\n  \r\n  add code below here... */\r\n  \r\n\r\n\r\n  /* ...and above here */ \r\n  \r\nimg[src='/images/cms/familiar/#.png'], img[src='/images/cms/familiar/art/#.png'], img[src='/static/cms/familiar/art/#.png'] /* Familiar Name. If you remove this line, be sure to delete the last comma of the last line above or you'll get a selector error*/\r\n  \r\n{\r\n  border: inset 2px orange;\r\n  border-radius: 12px;\r\n  opacity: .85;\r\n  }\r\n}"
  }
}