{
  "id": 132384,
  "info": {
    "name": "YouTube Flash Video Player - Remove \"Recommended\"",
    "description": "A small script to remove all the ad boxes for Baris Derin's addon which allows use of Flash in YouTube.",
    "additionalInfo": "Requires <a href=https://addons.mozilla.org/En-us/firefox/addon/youtube-flash-video-player>YouTube Flash Video Player</a>.\r\n\r\nThe sheer size of the box was becoming too large for my comfort, and since I disable ads almost everywhere else, I figured I may as well begin disabling ads in browser extensions, beginning with this.\r\n\r\nThis removes the ad sections for YouTube High Definition (always HD), YouTube Video Download and Convert (which FlashGot also handles quite handedly, with other tools) and YouTube Video Player Preview.\r\n\r\nI am sure these addons are great in their own right, and he's only trying to tell you they exist, but for pete sake why isn't this just a single link to his collection of YouTube enhancements? I am not comfortable with how he is advertising his other addons, but hopefully this style's purpose remains temporary.\r\n\r\n<i>09/13/16</i> Baris removed the toolbar icon completely in version 48. If you want the toolbar icon back, <b>first remove the addon from your setup</b>, then downgrade to 47.2 via AMO. All versions of the addon are listed here; https://addons.mozilla.org/En-us/firefox/addon/youtube-flash-video-player/versions\r\n\r\nOnce that is done, go to <kbd>about:addons#extensions</kbd> and at the list entry for <i>YouTube Flash Video Player</i>, select the link labeled \"More\" to access options for automatic updating; <b>turn it off</b> or the rollback will not remain applied.\r\n\r\n<i>09/15/16</i> 48.2 resolved the above issue, updates can continue as normal.",
    "format": "uso-firefox",
    "category": "browser",
    "createdAt": "2016-09-06T01:29:40Z",
    "updatedAt": "2016-09-06T01:29:40Z",
    "license": "NONE",
    "author": {
      "id": 15989,
      "name": "there.is.only.xul",
      "homepage": null,
      "paypalEmail": null
    }
  },
  "stats": {
    "installs": {
      "total": 104,
      "weekly": 0
    },
    "rating": null
  },
  "screenshots": {
    "main": {
      "name": "132384-0.webp",
      "archived": true
    },
    "additional": [
      {
        "name": "132384-1.webp",
        "archived": true
      }
    ]
  },
  "obsolete": null,
  "style": {
    "css": "@namespace url(http://www.mozilla.org/keymaster/gatekeeper/there.is.only.xul);\r\n\r\n/* I dislike having to do this but the in-browser advertising was becoming a bit much. */\r\n\r\n#youtubeflashvideoplayer-toolbarbutton > panel > vbox > groupbox:nth-child(n+2){\r\n  display: none !Important;\r\n}",
    "settings": []
  },
  "deleteReason": null
}