{
  "id": 139960,
  "info": {
    "name": "Userstyles.org - Remove \"Statistics Table\" Boxes",
    "description": "This user style is for all those who feel the new Userstyles.org page layout for the user styles (which now includes <b>boxes/borders around the \"statistics table\"</b>) is an <b>annoyingly ugly</b> change. The boxes were first introduced in early March 2017. Those boxed borders surround the user style's entries for \"Author\", \"License\", \"Created\" date, \"Updated\" date, \"Installs (this week)\", \"Installs (total)\", \"Average Rating\", and \"Show/Hide CSS\". This user style simply removes those boxes, returning the layout to exactly the way it was pre-March 2017. The screenshot tells the whole story about this style. (Of course, this style can be used in addition, and simultaneously, to any other Userstyles.org style a user wants to employ - this style just adds the one change of removing the boxes - there is only 1 CSS rule in the code).",
    "additionalInfo": "<b>NOTE:</b> This style was updated later the same day it was created, adding \"/styles\" to the \"@-moz-document url-prefix\" - this style still applies to the User Styles description pages, but no longer applies to the \"Userstyles.org/user/xxxxxx\" \"My Account\" pages, where a logged-in Author's styles' statistics are all shown in a table on one page. On THOSE pages - Author's logged-in My Account (Userstyles.org/user/xxxxxx) page - the table boxes DO improve the page appearance. Adding \"/styles\" to the \"@-moz-document url-prefix\" keeps the table box borders on the Authors' My Account pages, while still removing the boxes on the \"/styles/\" pages, as intended.",
    "format": "uso",
    "category": "userstyles.org",
    "createdAt": "2017-03-10T06:38:30Z",
    "updatedAt": "2017-03-10T21:36:30Z",
    "license": "NONE",
    "author": {
      "id": 298434,
      "name": "R. Schneider",
      "homepage": null,
      "paypalEmail": null
    }
  },
  "stats": {
    "installs": {
      "total": 194,
      "weekly": 0
    },
    "rating": null
  },
  "screenshots": {
    "main": {
      "name": "139960-0.webp",
      "archived": true
    },
    "additional": null
  },
  "obsolete": null,
  "style": {
    "css": "@-moz-document url-prefix(\"https://userstyles.org/styles\")\r\n  \r\n  {\r\n\r\n/* Remove UGLY, SUPER ANNOYING, boxes around statistics tables entries\r\n   on \"/styles/\" description pages (first introduced March 2017), while\r\n   not affecting (preserving) the box borders on the logged-in Author's\r\n   My Account page (where all the author's styles' statistics are shown\r\n   in a table on one page), on which pages the table box borders DO\r\n   improve the page appearance.\r\n*/\r\n  \r\n  .statistic table,th,td {\r\n\tborder:none !important;\r\n}\r\n}",
    "settings": []
  },
  "deleteReason": null
}