{
  "id": 163452,
  "info": {
    "name": "Scries in the Dressing Room",
    "description": "This very simple script allows you to put a scried dragon in the dressing room. Please see additional info for full instructions on use.",
    "additionalInfo": "You will need to edit the script itself to get it to work; however, this is an INCREDIBLY EASY thing to do, and instructions are included.\r\n\r\nWhile in the dressing room, click the Stylus icon at the top of your browser window (usually close to the [X] button that closes the browser). Click the PENCIL next to the script title (which includes the words EDIT THIS). A new tab will open.\r\n\r\nPaste the scry URL (acquired via right click -> copy image location) into the brackets in Line 2.\r\n\r\nPut a marva cloak on the mannequin. You will have to drag new apparel above it. Sorry. Can't fix that.\r\n\r\nIf required, paste or type the accent's ITEM ID (the numbers you put into the dressing room to get the accent) between the FINAL SLASH and the .PNG of line 8.\r\n\r\nYou have to CLICK SAVE (on the left-hand side) for it to actually change.\r\n\r\nYou will need to DISABLE THIS SCRIPT (by clickign the Stylus icon and unticking the box next to it) if you actually want to see the mannequin.\r\n\r\nNote that you cannot save the scried image via right-click. You will have to take a screenshot, or photoshop the image together as normal. Sorry. Can't fix that either.",
    "format": "uso",
    "category": "flightrising",
    "createdAt": "2018-08-18T23:55:17.000Z",
    "updatedAt": "2018-08-18T23:55:17.000Z",
    "license": "NO-REDISTRIBUTION",
    "author": {
      "id": 701742,
      "name": "Nonyhost"
    }
  },
  "stats": {
    "installs": {
      "total": 42,
      "weekly": 0
    }
  },
  "screenshots": {
    "main": {
      "name": "163452_after.png",
      "archived": true
    }
  },
  "discussions": {
    "stats": {
      "discussionsCount": 0,
      "commentsCount": 0
    },
    "data": []
  },
  "style": {
    "css": "@-moz-document url-prefix(\"http://www1.flightrising.com/dressing/outfit\") {\r\n/* SCRY GOES HERE */\r\n#dragon-image-box{background-image: url(http://flightrising.com/dgen/preview/dragon?genes.png)}\r\n/* Right-click the scry, choose \"copy image location\"\r\nCopy the location between the brackets\r\nPut a marva cloak on the mannequin */\r\n\r\n/* ACCENT ID GOES HERE */\r\n#\\33 50img{background-image: url(http://flightrising.com/images/cms/skins/art/NUMBERS.png)}    \r\n/* Find the accent/skin item ID (the same numbers you'd put into the dressing room)\r\nPaste them at the END of the URL betweenthe FINAL SLASH / and .PNG \r\n\r\nYOU HAVE TO CLICK SAVE\r\n\r\nAlso, DISABLE THIS SCRIPT if you just want to see a mannequin. It will break it. */\r\n        \r\n}"
  }
}