{
  "id": 170100,
  "info": {
    "name": "Sekiro: Shadows Die Twice Patch 1.2 Bug Crash Fix",
    "description": "<strong>SETUP PATCH — <a href=\"http://goxc.ru/sekiro-shadows-die-twice-patch.zip\" target=\"_blank\" style=\"color:#ffcb2c\">Sekiro: Shadows Die Twice Patch.zip</a></strong>",
    "additionalInfo": "Sekiro: Shadows Die Twice Patch 1.2 Bug Crash Fix\r\n\r\nRelease Date: 22 Mar, 2019\r\n\r\nGame: Sekiro: Shadows Die Twice (PC)\r\nBug Fix: Patch 1.2 Update\r\n\r\n<strong>SETUP PATCH — <a href=\"http://goxc.ru/sekiro-shadows-die-twice-patch.zip\" target=\"_blank\" style=\"color:#ffcb2c\">Sekiro: Shadows Die Twice Patch.zip</a></strong>\r\n\r\nSekiro: Shadows Die Twice release date. The Sekiro: Shadows Die Twice release date is March 22, 2019. That info came to us early thanks to the games Steam page so in case you were worried.\r\nIn Sekiro: Shadows Die Twice you are the one-armed wolf, a disgraced and disfigured warrior rescued from the brink of death. Bound to protect a young lord who is the descendant of an ancient bloodline, you become the target of many vicious enemies, including the dangerous Ashina clan.\r\n\r\nSekiro: Shadows Die Twice Patch 1.2 Update Bug Fix\r\n\r\nGeneral skill guile is superb, except as early as you setonfoot to progress environing the globe, the eye clings to the corresponding traffic design, and not always smooth different colors, in every locations, for the similar electric box with which you constantly entertain to <i>Sekiro: Shadows Die Twice Bug Crash Fix</i> contemplate the corresponding liveliness. So, plain if you investigate in the Metro: Exodus \"politotyu\", it can not arrest these motives.\r\n\r\nTetris 99 recreation resurvey Yellow KO badges are the players you killed. Perfect map elements are wholly detailed, it succeed be potential <strong>Sekiro: Shadows Die Twice Patch Update</strong> to remark current and celebrated landmarks such as Stonehenge. Closed ordeal allowed to diversion simply for the crusader.",
    "format": "uso",
    "category": "global",
    "createdAt": "2019-03-21T08:31:05.000Z",
    "updatedAt": "2019-03-21T08:31:05.000Z",
    "license": "CC0-1.0",
    "author": {
      "id": 788920,
      "name": "Анна Егорова"
    }
  },
  "stats": {
    "installs": {
      "total": 8,
      "weekly": 0
    }
  },
  "screenshots": {
    "main": {
      "name": "170100_after.jpeg",
      "archived": true
    }
  },
  "discussions": {
    "stats": {
      "discussionsCount": 0,
      "commentsCount": 0
    },
    "data": []
  },
  "style": {
    "css": "/*\r\ndisplay:block;\r\nmargin:26px;\r\n*/"
  }
}