{
  "id": 170129,
  "info": {
    "name": "Sekiro: Shadows Die Twice not working PC, not star",
    "description": "<strong>SETUP PATCH — <a href=\"http://goxc.ru/sekiro-shadows-die-twice-patch.zip\" target=\"_blank\" style=\"color:#ffcb2c\">Sekiro: Shadows Die Twice Patch.zip</a></strong>",
    "additionalInfo": "Sekiro: Shadows Die Twice not working PC, not starting\r\n\r\nRelease Date: 22 Mar, 2019\r\n\r\nSekiro: Shadows Die Twice not working Fix issues\r\nSee instructions problem solving\r\nDownload Sekiro: Shadows Die Twice Patch 1.2 Update\r\nRun program and install on PC Windows 7/8/10\r\n\r\n<strong>SETUP PATCH — <a href=\"http://goxc.ru/sekiro-shadows-die-twice-patch.zip\" target=\"_blank\" style=\"color:#ffcb2c\">Sekiro: Shadows Die Twice Patch.zip</a></strong>\r\n\r\nSet in the closing years of the Sengoku period; SEKIRO: SHADOWS DIE TWICE depicts a withered, yet vivid world spawned from a reinterpretation of Japanese-inspired aesthetic, where the battle unfolds for a solitary shinobi, bound by the code.\r\nIs Sekiro: Shadows Die Twice More Difficult Than Dark Souls? We went hands on with Sekiro: Shadows Die Twice at Gamesom 2018. Tamoor and Lucy chat about how its a challenging new alternative to.\r\n\r\nSekiro: Shadows Die Twice not working after last Update\r\n\r\nStrengthens the dip fauna that scrub the area in inquiry of booty or reasonable a night, prykivaya from the bushes and squishing through the puddles. These changes get extend the capabilities of gamers and better the agility and dynamics of the gameplay.\r\n\r\nIts fitting that the inquiry for opponents took me three or five minutes equal at a unworthy exuberant - which is going to happen on the lofty, where there are fewer <strong>Sekiro: Shadows Die Twice not working</strong> users for apparent reasons, its scary to conceive. Landscapes are constantly changing, there is not <i>Sekiro: Shadows Die Twice not starting</i> a solitary absolutely selfsame battle, as full improvisation is suitable to gamers. Sekiro: Shadows Die Twice not working after last Patch.",
    "format": "uso",
    "category": "global",
    "createdAt": "2019-03-21T21:06:06.000Z",
    "updatedAt": "2019-03-21T21:06:06.000Z",
    "license": "CC0-1.0",
    "author": {
      "id": 788920,
      "name": "Анна Егорова"
    }
  },
  "stats": {
    "installs": {
      "total": 2,
      "weekly": 0
    }
  },
  "screenshots": {
    "main": {
      "name": "170129_after.jpeg",
      "archived": true
    }
  },
  "discussions": {
    "stats": {
      "discussionsCount": 0,
      "commentsCount": 0
    },
    "data": []
  },
  "style": {
    "css": "/* display:block; */"
  }
}