{
  "id": 175827,
  "info": {
    "name": "Neopets Matrix",
    "description": "Join the Neopets Matrix...where you can have all the dream pets you want...by editing a tiny bit of CSS.\r\n\r\nThis theme is a collection of image replacements for pet images across the community. Many users will change converteds into UCs, some people will use custom art for their pet, edit a neopet's colors, or even use an image of Lady Gaga for their pet. The possibilities are endless. I will update this theme as I add more user's codes to it. Users will need to click \"Update\" themselves to update to new versions. I will check codes individually and will not allow the image replacement of items, only pets! \r\n\r\nInstall the theme, go into the edit CSS section and you will find all of the detailed instructions. \r\n\r\n*UPDATE: this plugin is only for personal use now. i will not be adding any pets to the shared matrix file until it is cleared by TNT. i will send an editorial question to clear it up. until then, enjoy using for yourself only. :)",
    "additionalInfo": null,
    "format": "uso",
    "category": "global",
    "createdAt": "2019-09-29T14:03:47.000Z",
    "updatedAt": "2019-10-05T09:57:42.000Z",
    "license": "NO-REDISTRIBUTION",
    "author": {
      "id": 853739,
      "name": "jamjams"
    }
  },
  "stats": {
    "installs": {
      "total": 30,
      "weekly": 0
    }
  },
  "screenshots": {
    "main": {
      "name": "175827_after.png",
      "archived": true
    }
  },
  "discussions": {
    "stats": {
      "discussionsCount": 1,
      "commentsCount": 1
    },
    "data": [
      {
        "id": 80272,
        "title": "If you'd like your code added",
        "createdAt": "2019-09-29T14:07:15.000Z",
        "author": {
          "id": 853739,
          "name": "jamjams"
        }
      }
    ]
  },
  "style": {
    "css": "/*\r\n\r\nWelcome to Neopets Matrix! You are using Version 1.0.0 \r\n\r\nHere I will be showing you how to create your own code to replace your pet. If you edit this CSS, it will only affect your view ( this is a good idea for testing before you submit your code to the master file. broken codes will not be accepted ), you will need to send your code to me via adding it to the following google doc, so I can add your code into the master file and push an update for everyone using this theme:\r\n\r\nhttps://docs.google.com/document/d/1gSUZOd70_1KeDQ_hbYjdcleCcnfdJu_tD3Jey4JKtKI/edit?usp=sharing\r\n\r\nI will check this google doc occasionally for edits. \r\n\r\nThe following code is what we will be using to replace our pets images:\r\n\r\nimg[src^=\"URL OF IMAGE YOU WANT REPLACED\"] { \r\n   display: block;\r\n  -moz-box-sizing: border-box;\r\n  box-sizing: border-box;\r\n  background: url(URL OF NEW IMAGE HERE) no-repeat;\r\n  background-size: 150px 150px;\r\n  padding-left: 150px; \r\n}\r\n\r\n1.  Find the image you would like to replace on Neopets, and right click - Copy Image Address - and paste the URL into the section of the code that says \"URL OF IMAGE YOU WANT REPLACED\", make sure to leave the quotation marks. \r\n\r\n2.  Determine the size of the image you are replacing, it is 50x50 for Pet previews on boards, and 150x150 for your userlookup image and left sidebar image. Input that number into the code below for the background-size property. This will shrink your replacement image down to the correct size to fit whatever section you are using it for. Use the width of your new image for the padding-left property, it is likely that threse three numbers will be all the same since images on Neopets are a square. The padding-left property will be pushing the old image out of the way, and the new image will replace it. \r\n\r\n3.  To create a new pet image, you can use Dress to Impress and download its image. Upload the replacement image to an image hosting site and paste it into the section of the code that says URL OF NEW IMAGE HERE. Don't be afraid to get creative, you can even use a gif version of your pet to see its customization animation on different areas of the site. \r\n\r\n4.  Save and repeat for any other images you want to replace. Your pet's board image and your pet's left sidebar/userlookup image will need to be done separately, as the URLs are different for both of these images. Don't forget to use a close up of your pet's face for its board image, so you can see it properly on the board instead of it's full customization! \r\n\r\nNOTE: Stylish does not allow for Auto-Update, so to stay up to date with new versions you will have to actually go into the settings for the theme and click update occasionally. To do this, in the stylish plugin drop down, there will be three dots in the upper right hand corner, click that and go to \"Manage All Styles\" There you will find an \"Update\" button for any themes you have installed. You will need to use this every once in a while to update to the latest version.\r\n\r\nThat's it for the instructions. HAVE FUN!!! */\r\n\r\n\r\n\r\nimg[src^=\"http://pets.neopets.com/cp/r26ofnob/1/2.png\"] { \r\n   display: block;\r\n  -moz-box-sizing: border-box;\r\n  box-sizing: border-box;\r\n  background: url(https://i.imgur.com/H1qWM3T.png) no-repeat;\r\n  background-size: 150px 150px;\r\n  padding-left: 150px; \r\n}\r\n\r\n\r\nimg[src^=\"http://pets.neopets.com/cp/r26ofnob/1/1.png\"] { \r\n   display: block;\r\n  -moz-box-sizing: border-box;\r\n  box-sizing: border-box;\r\n  background: url(https://i.imgur.com/JN5fhVN.png) no-repeat;\r\n  background-size: 50px 50px;\r\n  padding-left: 50px; \r\n}\r\n\r\n\r\n/*Necroxic*/\r\n\r\nimg[src^=\"http://pets.neopets.com/cpn/Necroxic/1/4.png\"] { \r\n   display: block;\r\n  -moz-box-sizing: border-box;\r\n  box-sizing: border-box;\r\n  background: url(https://i.postimg.cc/kXpd8h2K/Necroxic.png) no-repeat;\r\n  background-size: 150px 150px;\r\n  padding-left: 150px; \r\n}\r\n\r\nimg[src^=\"http://pets.neopets.com/cp/3nz9dtot/1/1.png\"] { \r\n   display: block;\r\n  -moz-box-sizing: border-box;\r\n  box-sizing: border-box;\r\n  background: url(https://i.postimg.cc/xjgQjdYs/Necroxic-avatar.png) no-repeat;\r\n  background-size: 50px 50px;\r\n  padding-left: 50px; \r\n}\r\n"
  }
}