{
  "id": 182619,
  "info": {
    "name": "Mastodon Advanced Proportional Columns",
    "description": "Mastodon's \"advanced web interface\" has statically sized columns that don't fill the page when you only have a couple of columns pinned.\r\n\r\nThis style will sets the toot drawer to 20% of the page width, the first pinned column, (whatever it is) to about 50% of the page width, and the last column to 30%. When only those three are on the page you get a nicely balanced three-column layout.\r\n\r\nAdditionally, when you have more columns, the first and last try to retain some proportionality while they shrink to accommodate the new columns, and standard behaviour is retained when the number of columns exceeds the page width.",
    "additionalInfo": "As Mastodon is federated (not centrally hosted) it's important to ensure the style applies to your specific instance. After installation, edit the style by clicking the extension button followed by \"Manage\". In the Management interface, click on the \"Mastodon Advanced Proportional Columns\" style. After it's opened, use the bottom \"Applies to\" section to add your Mastodon instance's URL. Click one of the plus signs on the right to add and ensure the dropdown on the left has \"URLs on the domain\" selected and enter the main url of your instance. Click the Save button at the top left to finish.",
    "format": "uso",
    "category": "mastodon",
    "createdAt": "2020-04-20T14:39:11.000Z",
    "updatedAt": "2020-04-20T14:39:11.000Z",
    "license": "CC0-1.0",
    "author": {
      "id": 925135,
      "name": "screenbeard"
    }
  },
  "stats": {
    "installs": {
      "total": 14,
      "weekly": 0
    }
  },
  "screenshots": {
    "main": {
      "name": "182619_after.png",
      "archived": true
    },
    "additional": [
      {
        "name": "182619_additional_36148.png",
        "archived": true
      }
    ]
  },
  "discussions": {
    "stats": {
      "discussionsCount": 0,
      "commentsCount": 0
    },
    "data": []
  },
  "style": {
    "css": "@-moz-document domain(\"mastodon.social\"), domain(\"aus.social\"), domain(\"fosstodon.org\") {\r\ndiv.drawer {\r\n    width: 20vw;\r\n}\r\ndiv.column:nth-child(2) {\r\n    flex: 1 0 auto;\r\n}\r\ndiv.column:last-child {\r\n    flex: 0.6 0 auto;\r\n}\r\n}"
  }
}