{
  "id": 263521,
  "info": {
    "name": "Business Central Partner",
    "description": "Nevas Technologies is a certified Business Central Partner with more than 15 years of experience dedicated to delivering Microsoft Dynamics 365, Dynamics 365 Business Central and Customer Engagement solutions and services to business.",
    "additionalInfo": "Nevas Technologies is a certified <a href=\"https://www.nevastech.com/\">Microsoft Dynamics 365 Business Central Partner</a> with more than 15 years of experience dedicated to delivering Microsoft Dynamics 365, Dynamics 365 Business Central and Customer Engagement solutions and services to business. Nevas provides professional services that will help your business migrate to, implement, support, or customize Microsoft Cloud software; especially Microsoft Dynamics 365, Business Central, Dynamics NAV and Customer Engagement. At Nevas, we continue to make investments in growing our global presence in order to meet the demands of our worldwide Microsoft Dynamics 365 Finance & Operations, <a href=\"https://www.nevastech.com/solutions/microsoft-dynamics-365/microsoft-dynamics-365-business-central/\">Dynamics 365 Business Central</a>, Dynamics NAV and Dynamics AX customer base. We have proven track record deploying and supporting Microsoft cloud solutions across a global footprint, so you can count on us to do what we need to do, and be where we need to be.",
    "format": "uso",
    "category": "global",
    "createdAt": "2023-04-28T10:16:37Z",
    "updatedAt": "2023-04-28T10:16:37Z",
    "license": "NONE",
    "author": {
      "id": 3584963,
      "name": "Dynamics 365",
      "homepage": null,
      "paypalEmail": null
    }
  },
  "stats": {
    "installs": {
      "total": 2,
      "weekly": 0
    },
    "rating": null
  },
  "screenshots": {
    "main": {
      "name": "263521-0.webp",
      "archived": true
    },
    "additional": null
  },
  "obsolete": null,
  "style": {
    "css": "body\r\n{\r\n  background-color: lightblue;\r\n}\r\n\r\nh1\r\n{\r\n  color: navy;\r\n  margin-left: 20px;\r\n}",
    "settings": []
  },
  "deleteReason": null
}