{
  "id": 269560,
  "info": {
    "name": "Spiderman logo glitched (Roblox)",
    "description": "This is inspired by Spiderman across the spiderverse film hense the glitching in the image so if you haven't already watched this film i highly recommend it because it is amazing!",
    "additionalInfo": "If there are any bugs please let me know and I can update it :)",
    "format": "uso",
    "category": "global",
    "createdAt": "2023-09-11T17:03:15Z",
    "updatedAt": "2023-09-11T17:03:15Z",
    "license": "NONE",
    "author": {
      "id": 1759899,
      "name": "xXNotBunDaSimpxX",
      "homepage": null,
      "paypalEmail": null
    }
  },
  "stats": {
    "installs": {
      "total": 27,
      "weekly": 2
    },
    "rating": 4.0
  },
  "screenshots": {
    "main": {
      "name": "269560-0.webp",
      "archived": true
    },
    "additional": null
  },
  "obsolete": null,
  "style": {
    "css": "{\"result\":\"/*\\r\\nTheme Name: Twenty Twenty\\r\\nTheme URI: https://wordpress.org/themes/twentytwenty/\\r\\nAuthor: the WordPress team\\r\\nAuthor URI: https://wordpress.org/\\r\\nDescription: Our default theme for 2020 is designed to take full advantage of the flexibility of the block editor. Organizations and businesses have the ability to create dynamic landing pages with endless layouts using the group and column blocks. The centered content column and fine-tuned typography also makes it perfect for traditional blogs. Complete editor styles give you a good idea of what your content will look like, even before you publish. You can give your site a personal touch by changing the background colors and the accent color in the Customizer. The colors of all elements on your site are automatically calculated based on the colors you pick, ensuring a high, accessible color contrast for your visitors.\\r\\nTags: blog, one-column, custom-background, custom-colors, custom-logo, custom-menu, editor-style, featured-images, footer-widgets, full-width-template, rtl-language-support, sticky-post, theme-options, threaded-comments, translation-ready, block-styles, wide-blocks, accessibility-ready\\r\\nVersion: 1.3\\r\\nRequires at least: 5.0\\r\\nTested up to: 5.4\\r\\nRequires PHP: 7.0\\r\\nLicense: GNU General Public License v2 or later\\r\\nLicense URI: http://www.gnu.org/licenses/gpl-2.0.html\\r\\nText Domain: twentytwenty\\r\\nThis theme, like WordPress, is licensed under the GPL.\\r\\nUse it to make something cool, have fun, and share what you've learned with others.\\r\\n*/\"}",
    "settings": null
  },
  "deleteReason": null
}