{
  "id": 42848,
  "info": {
    "name": "Google - Highlight harmful site alert",
    "description": "Adds reddish highlighting for  Google search results with \"This site may harm your computer.\".   Firefox itself should prevent you from accessing such sites identified by  stopbadware.org as both Mozilla, Google,  and several others are partners.\r\n\r\nThe highlighting will help you avoid clicking on the site.\r\n\r\nEven though Firefox uses the same data, there will be timing differences between what is available from Google servers and what Mozilla has downloaded to you for your protection.",
    "additionalInfo": "Make sure that your Firefox Tools, Options, Security you have checkmarked both\r\n [x] Block reported attack sites   (default) \r\n [x] Block reported web forgeries  (default)\r\n\r\nIf you have \"Customize Google\" extension and choose to show web favicons, the favicon changes to a white exclamation point on a red sphere as a warning on such sites, but the favicons disappear if you are signed into Google, so this change should show when you are getting a lot of malware search hits. \r\n\r\nI no longer use \"Customize Google\" (obsolete), nor \"Optimize Google, but do use \"GoogleEnhancer\" -- for more information on why, see the large table of extensions at http://dmcritchie.mvps.org/firefox/firefox.htm#ext_table \r\n\r\nFor your protection you should have \"Adblock Plus\" extension with a subscription filter such as \"EasyList\" subscribed to after installing, plus adding filters of your own (your personal filters and each subscription are kept separate so you can update subscription filters any time).  You should also protect yourself with a hosts file such as obtained through http://www.mvps.org/winhelp2002/hosts.htm   \r\n\r\nFirefox provides for reporting bad sites via  Help --> Report Web Forgery...\r\nor you can report directly through   https://badwarebusters.org and their submittal form https://badwarebusters.org/community/submit\r\n\r\nI have this code in style 16842 (16842) but the code should be in its own style.  The code is a segment from style 16887 (16887).\r\n\r\nI have no control over the layout of this page at userstyles.org, each revision has made all of my before and after pictures harder and harder to view in context.\r\n\r\nUpdates: since 2011-01-16:  (none)",
    "format": "uso",
    "category": "google",
    "createdAt": "2011-01-16T11:15:54Z",
    "updatedAt": "2011-01-16T11:21:49Z",
    "license": "NONE",
    "author": {
      "id": 12592,
      "name": "David McRitchie",
      "homepage": "http://kb.mozillazine.org/User:Dmcritchie",
      "paypalEmail": null
    }
  },
  "stats": {
    "installs": {
      "total": 968,
      "weekly": 2
    },
    "rating": null
  },
  "screenshots": {
    "main": {
      "name": "42848-0.webp",
      "archived": true
    },
    "additional": null
  },
  "obsolete": null,
  "style": {
    "css": "/* Google - Highlight harmful site alert  */\r\n/* ===================================================== */\r\n/* David McRitchie,  2011-01-16 installed Style 42848 */\r\n\r\n/* ===Highlight harmful site alert=== Google see style 16887 */\r\n@-moz-document url-prefix(\"http://www.google\"), url-prefix(\"http://google\"),\r\n     domain(\"google.ca\"), domain(\"google.com\")   \r\n{\r\n  div.s a[href^=\"/support/bin/answer\"]{\r\n  color: #FF0000 !important; background: #FFD1D1 !important;\r\n  outline: red 2px solid !important; }\r\n}  /* end of Google domain test/changes */",
    "settings": []
  },
  "deleteReason": null
}