{
  "id": 46274,
  "info": {
    "name": "Firefox 4: Bookmarks Toolbar above tabs, enhanced",
    "description": "This CSS enhances Tynstar's useful \"Bookmarks Toolbar above tabs\" by adding options for background color and opacity, text color to help stand out against different window colors, and padding to keep things looking neither crunched together nor spaced apart wastefully.\r\n\r\nNote, slight issue with padding: Clicking an item in the toolbar seems to bump objects to the right of it around slightly. If this bothers you, you can remark out the padding code. If anyone has a fix, lemme know. :) I'm hardly a CSS wiz.\r\n\r\nApr 29, 2014 - IMPORTANT: This userstyle is no longer compatible as of Firefox v29.0 (it colors the bar, but does not move the bar up, will try and figure out how to fix this later).",
    "additionalInfo": "v1.00 - Tested on Firefox 4.0",
    "format": "uso-firefox",
    "category": "browser",
    "createdAt": "2011-04-07T23:17:59Z",
    "updatedAt": "2011-04-07T23:17:59Z",
    "license": "CC0-1.0",
    "author": {
      "id": 96368,
      "name": "wyrenth",
      "homepage": null,
      "paypalEmail": null
    }
  },
  "stats": {
    "installs": {
      "total": 859,
      "weekly": 0
    },
    "rating": null
  },
  "screenshots": {
    "main": {
      "name": "46274-0.webp",
      "archived": true
    },
    "additional": null
  },
  "obsolete": null,
  "style": {
    "css": "@namespace url(http://www.mozilla.org/keymaster/gatekeeper/there.is.only.xul);\r\n\r\n\r\n/* This sets the toolbar above the tabs (if Tabs are on top) in Firefox 4 and sets the background color and opacity. 0.0 is 0% opacity, so if you want the color to actually show, raise this up. 1.0 is 100% opacity. */\r\n#PersonalToolbar {\r\n\t-moz-box-ordinal-group: 6 !important;\r\n\tbackground-color:rgba(160,160,160,0.0) !important;\r\n}\r\n\r\n\r\n/* This sets the text color for the Personal Toolbar. It is recommended to keep 1.0 opacity.  You may change this to stand out better against your preferred window color.  This also sets a 3 pixel padding for all elements on the toolbar, including buttons. */\r\n#PersonalToolbar toolbarbutton {\r\n\tcolor:rgba(255,255,255,1.0) !important;\r\n\tpadding-right: 3px  !important;\r\n}\r\n\r\n/* This sets an additional 7 pixel padding on the button TEXT only, for a less squished appearance. */\r\n#PersonalToolbar toolbarbutton label {\r\n\tpadding-right: 7px  !important;\r\n}",
    "settings": []
  },
  "deleteReason": null
}