{
  "id": 78276,
  "info": {
    "name": "Google - Simple background image code",
    "description": "<i>I am trying to remain the most current Google style available! I've figured out how to make it more friendly toward the use of dark images, so feel free to use whatever you like. If you still want to check out the other style that came before this, <a href=http://www.userstyles.org/76744>click here</a>.</i>\r\n\r\n\"Simple\" may as well be an overstatement with how complicated the Google pages have become lately.\r\n\r\nThis style was created to address the issue of Google removing background images for all users. claiming incapability with their new software; Well, we know nothing is impossible with a little extra code, and this, like everything else on userstyles.org stands as a testament to that.\r\n\r\nFind any image, then apply the image in the code, replacing the included stock image URL. Have fun with this style, and tweak it to your preferences.\r\n\r\n<b>Problems? E-Mail me at bluufoxx.at.gmail/dot/com.\r\nDo this to ensure I don't take another eon to revise this style!</b>",
    "additionalInfo": "<b><i>I will keep on updating this style, so always back up or re-save as your own style if you don't want to keep up with changes. Otherwise, the ride's still rough and it'll still be some time before the dust settles.</i></b>\r\n\r\nI created a new style for those looking to modify the top bar in search results! Check it out <a href=\"http://userstyles.org/styles/78913\">here</a>.\r\n<i>Fixed! This actually means something now!</i>\r\n\r\nI also made a new style for the Google Grid menu people can have fun customizing. Find it <a href=http://userstyles.org/styles/93638>here.</a>\r\n\r\nWhile not necessarily for those looking to use dark background images, you can use this to make your Google+ name white, and not have it interfere with readability elsewhere.\r\n\r\nThanks for the support people! I made this style free-of-charge for study and reuse. If you want more people to know about this, then feel free to bring this to the attention of your local media! I am sure tech blogs are itching to create an article on how to re-introduce Google background images, and this is it! Be sure to spread the word; Can we get this to 5,000 installations?\r\n\r\n<b>If you know a web admin doesn't want hotlinking or any other bullcrap like that, don't use their image directly; Save it, then use from local filesystem or encode it in base64.</b>\r\n\r\nAdditional features of this style:\r\n\r\n* Styles the footer bar to match the header bar\r\n* <s>Removes the Google logo (because I don't know how to replace it, and it looks cleaner)</s> <i>See update 2</i>\r\n* <s>Adds padding to fill out the bottom</s> <i>See update 8</i>\r\n* <s>Adds color-matched border at the header and footer, for that awesome pinstripe look.</s> This means nothing anymore, but you can kind of get that back with the dark header style linked further up.\r\n\r\nUpdate 1:\r\n* Adds text color property for text below the seatch bar (hopefully for both images and search)\r\n* Colors links below the search bar\r\n* Adds text shadow property to make the Google account username better stand out in dark backgrounds.\r\n\r\nUpdate 2:\r\n* Lifts restriction on Google logo, because of another style I found that addresses this issue. <a href=\"http://userstyles.org/styles/69292/google-logo-changer\">See here.</a>\r\n\r\nUpdate 3:\r\nMaintenance fix, added new ID for Google Search/Images\r\n\r\nUpdate 4:\r\nFixed image displaying in search results by swapping ID #gsr for class .hp\r\n\r\nUpdate 5:\r\nThanks Sonny for the regexp string! I was having a hard time figuring that out. Updating this style because Google Drive / Docs uses class gb on the very top. Wanted to fix that so Google Docs didn't show the background image there. left the old code in for people who want to reverse the change.\r\n\r\nUpdate 6:\r\nAdded Google Images and Google Play to the list, forgot to fix that. Basically, re-introducing some old behaviors for people who want that. And more code comments.\r\n\r\nUpdate 7:\r\nImpulse update to replace the URL -- Luckily I had it on my computer as my desktop wallpaper!\r\n\r\nUpdate 8:\r\nMaintenance fix, I somehow missed that Google changed their site code AGAIN, so I decided to update the code to accommodate these changes. Hopefully I broke nothing. #footer is now .fbar and the padding is removed.\r\nAlso, found the source image on DeviantArt!\r\n\r\nThis style was made on a 1600*900 screen, so if there are issues on smaller (or larger) resolutions, do leave a comment.\r\nI made sure the inline code comments holds the hands of newbies. If you enjoy this and want it everywhere, look into using a portable copy of Firefox with Stylish Sync.\r\n\r\nUpdate 9:\r\nImage location reverted as it was in update 7. Sorry for the fails!\r\n\r\nImage <i>Galactic Fractal</i> created by Nathen Smith. <a href=http://nmsmith.deviantart.com/art/Galactic-Fractal-53048529>Available via DeviantArt!</a>\r\n\r\nUpdate 10:\r\nCaught the new rollout early! Also, any code to become useless in the future has [L] in the comments to express legacy code. Everything should still work for people who did not get the new rollout yet.\r\n\r\nUpdate 11:\r\nModified some comments to be more user-friendly for newbs, and found the white icons in Google's default image set, therefore making the style <span>100%</span> dark background friendly.\r\n<br>\r\nUpdate 12:\r\nThe \"F*** it, ship it\" update. This is the last update log I will place here, see the code for more information. Basically, more comments, code for Google international, and a bigger, badder regexp string that is dedicated to affecting only the Google Images and Google Search front pages.\r\n\r\n<b>Edit:</b> Since update 13, I discovered that the regexp string <i>doesn't</i> apply when clicking on the Google link in the header. Sorry!",
    "format": "uso",
    "category": "google",
    "createdAt": "2012-11-12T12:22:57.000Z",
    "updatedAt": "2014-12-23T18:30:46.000Z",
    "license": "NO-REDISTRIBUTION",
    "author": {
      "id": 15989,
      "name": "there.is.only.xul"
    }
  },
  "stats": {
    "installs": {
      "total": 1329,
      "weekly": 0
    }
  },
  "discussions": {
    "stats": {
      "discussionsCount": 6,
      "commentsCount": 29
    },
    "data": [
      {
        "id": 33309,
        "title": "Works great!",
        "createdAt": "2012-11-16T21:48:22.000Z",
        "author": {
          "id": 166883,
          "name": "Beth K"
        }
      },
      {
        "id": 34792,
        "title": "How to use local image?",
        "createdAt": "2013-03-05T08:46:41.000Z",
        "author": {
          "id": 179610,
          "name": "peter7122"
        }
      },
      {
        "id": 38027,
        "title": "Grid view and notification bell images",
        "createdAt": "2013-10-02T04:12:41.000Z",
        "author": {
          "id": 15989,
          "name": "there.is.only.xul"
        }
      },
      {
        "id": 40648,
        "title": "Jason, what is wrong with your approval process?",
        "createdAt": "2014-02-17T05:34:33.000Z",
        "author": {
          "id": 15989,
          "name": "there.is.only.xul"
        }
      },
      {
        "id": 40949,
        "title": "Stuff about Google and myself.",
        "createdAt": "2014-03-08T04:07:09.000Z",
        "author": {
          "id": 15989,
          "name": "there.is.only.xul"
        }
      },
      {
        "id": 42529,
        "title": "I need regexp help because Google broke it.",
        "createdAt": "2014-06-25T13:14:11.000Z",
        "author": {
          "id": 15989,
          "name": "there.is.only.xul"
        }
      }
    ]
  },
  "style": {
    "css": "/* For people super-frustrated with the constantly-changing\r\n   code from me updating, I am sincerely apologetic. I will\r\n   update this style more often as I discover more things\r\n   in the Googleverse that needs tweaking.\r\n\r\n   I have tried my very best to avoid making any changes to\r\n   search results, and to make this style work to the best\r\n   of my ability on the search and image front pages.\r\n   \r\n   Some things might be missing or broken still, so bear\r\n   with me! The price of keeping current is occasionally\r\n   losing your changes.\r\n\r\n   This message will persist in future updates. Changelog\r\n   is in the bottom so people tweaking the code doesn't get\r\n   their lines mixed up. Enjoy! This is update #24. */\r\n\r\n@namespace url(http://www.w3.org/1999/xhtml);\r\n\r\n/* Thanks, rewt and digitok from #regex @ irc.freenode.net\r\n   for the universally awesome regexp string. */\r\n@-moz-document regexp(\"https?:\\/\\/(www|search|images)\\.google\\.[^\\/]+/\"){\r\n\r\n/* The following code makes the grid view and notification\r\n   icons white. Disable it if it impedes in using an image\r\n   with bright colors or otherwise with lots of white. */\r\n\r\n/* --> Prerequisite; Image settings */\r\n#gbwa > DIV:first-child > A,\r\n#gb > DIV:first-child > DIV:first-child > DIV:last-child > DIV:nth-child(3) > DIV:first-child > A > DIV:first-child,\r\n#gb > DIV:first-child > DIV:first-child > DIV:last-child > DIV:nth-child(4) > DIV:first-child > A{\r\nbackground-image: url(http://i.imgur.com/KtgpKyV.png) !Important;\r\nbackground-size: 356px 144px !Important;\r\n}\r\n/* --> Position settings */\r\n#gbwa > DIV:first-child > A{\r\nbackground-position: -214px 0px !important;\r\n}\r\n\r\n#gb > DIV:first-child > DIV:first-child > DIV:last-child > DIV:nth-child(3) > DIV:first-child > A > DIV:first-child{\r\nbackground-color: rgba(255, 255, 255, 0.55) !important;\r\nbackground-position: -326px -121px !important;\r\n}\r\n\r\n#gb > DIV:first-child > DIV:first-child > DIV:last-child > DIV:nth-child(4) > DIV:first-child > A{\r\nbackground-position: 0px -34px !important;\r\n}\r\n\r\n/* Hover color */\r\n#gb > DIV:first-child > DIV:first-child > DIV:last-child > DIV:nth-child(3) > DIV:first-child > A > DIV:first-child:hover{\r\n   background-color: rgb(255, 255, 255) !important;\r\n}\r\n\r\n/* Background stuff; The \"Meat\" of this code */\r\n#gb,\r\n.ctr-p,\r\n.hp{\r\n/* Image URL. */\r\n/* Change the line below to whatever you like. Can be:\r\n   FROM LOCAL FS; file:///c:/etc... \r\n   FROM THE WEB; http address to image\r\n   IN BASE64; Highlight the default image address, and\r\n   insert a data URI to encode in Base64. Will be a lot\r\n   of text, and may lag your PC! */\r\nbackground-image: url(http://i.imgur.com/wy45DEd.jpg) !important;\r\n\r\n/* Background color, failsafe -- Solid color background */\r\nbackground-color: grey !important;\r\n/* Positioning. Can be by measure units or general positioning */\r\nbackground-position: center center !important;\r\n/* Don't remove the following line. Ever. */\r\nbackground-attachment: fixed !important;}\r\n\r\n/* Text color */\r\n#gb .gb_f /* Header stuff */,\r\n.sshpplo :link /* [L] Below searchbar text */,\r\n.sshpplo :visited /* [L] Below searchbar text */,\r\n#als /* [I] Language */,\r\n#_eEe * /* [I] Lang links */,\r\n#fsett * /* Settings menu */{\r\ncolor: white !Important;\r\ntext-shadow:\r\n 0px 0px 6px #2d2d2d\r\n,0px 0px 6px #2d2d2d\r\n,0px 0px 6px #2d2d2d !important;}\r\n\r\n/* [L] Header border color */\r\n#gbx3{\r\nborder-bottom: 1px solid white !important;}\r\n\r\n/* Link underscore */\r\n.sshpplo :link /* [L] */,\r\n.sshpplo :visited /* [L] */,\r\n#_eEe > a /* [I] */,\r\n.fbar :link,\r\n.fbar :visited,\r\n#gb * :link,\r\n#gb * :visited{\r\ntext-decoration: underline !important;}\r\n\r\n/* Footer div padding for the URLs, footer border color */\r\n.fbar{\r\nbackground: #2d2d2d !important;\r\nborder-top: 1px solid white !important;}\r\n\r\n/* Footer link colors (No-shadow) */\r\n.fbar :link,\r\n.fbar :visited{\r\ncolor: white !important;}\r\n\r\n/* [I] Lazy fix for search results on some Google sites */\r\n#cnt,\r\n#rcnt{\r\nbackground: none !Important;}\r\n}\r\n\r\n/* Changelog for update #25\r\n   > Modification of some font specifications\r\n   > Text shadow exclusions\r\n\r\n   Changelog for update #26\r\n   > Forgot to include new fixes from dark header, included now\r\n*/"
  }
}