{
  "id": 9514,
  "info": {
    "name": "Color Toolbar(s) to identify profile (DM*)",
    "description": "Use&nbsp; \"Color Toolbar(s)\"&nbsp; to help identify an additional profile such as might be used with a TEST profile,  or  to distinguish a different user, or version of Firefox with a unique color choice per profile.\r\n\r\nChoose a color which will be used in your profile on the  Firefox Window, on Customize Toolbars, the  Dom Inspector,  Organize Bookmarks  (Library), Stylish Manage &amp; Edit, and several other dialogs choosing a different color for each profile, some suggestions for light pastel colors are within the code.",
    "additionalInfo": "The Stylish  Edit Window provides an  Insert  button that can help you quickly choose a color and drop it  in where needed.&nbsp; Some sample colors can also be found -- in http://kb.mozillazine.org/User:Dmcritchie\r\n\r\nUsage Tip:&nbsp; If you update the style from userstyles.org your color choice will be reverted back to the sample code.&nbsp; Suggest you store your color code at the end of the description so if you use #BDF in one profile instead of the default #F3E078, you will be able to change the color back to your choice.&nbsp; So your Manage Styles might look like this:\r\nDescription:     style 9514 [#BDF]\r\n\r\nSome Tips for working with  multiple profiles besides what you see in \"Using multiple profiles - Firefox\" -- http://kb.mozillazine.org/Using_multiple_profiles_-_Firefox \r\n<ul>\r\n<li> This style is for color identification of profiles, for a pictorial  example of different coloring used on several different profiles, -- see http://www.mvps.org/dmcritchie/icons/ff_colorized_profiles.png (image, 394 KB)\r\n<li> Install \"Launchy\" extension to include Firefox  version and profile so you can bring up the current page in other browsers including other versions of Firefox and other  profiles.  Example of launchy.xml  -- in http://www.mvps.org/dmcritchie/firefox/code/launchy.txt and additional tips for using the \"Launchy\" extension -- in http://www.mvps.org/dmcritchie/firefox/firefox.htm#launchy    \r\n<li> Quick Launch shortcuts (in Windows) to start Firefox with desired Firefox version and profiles -- in http://www.mvps.org/dmcritchie/firefox/quicklaunch.htm\r\n<li> To  help identify the profile you are using for times when you are in safe mode and don't have use of extension,  include  a  bookmark on the bookmarks toolbar titled with the name of the profile. \r\n<li> To quickly install your bookmarks, keyword shortcuts used in your main profile,  restore the latest .json backup file in your main profile  to your test profile so that your bookmarks are installed quickly.   Just make sure you bookmark anything you want to keep in your main profile.\r\n<li> It would also be nice if all of  \"Firefox should display the current profile name somewhere\" [Bug 283685].  Partially implemented in Firefox 3.6, click on HELP(F1) -> Troubleshooting Information -> \"Open Containing Folder\" or type in about:support and then \"Open Containing Folder\" \r\n</ul> \r\n\r\nFor  Firefox coloring of a profile's main Window just colors the menu bar and status bar, for other dialogs there is a bit more coloring all of which should certainly help distinguish windows between your  normal profile (main profile) and your TEST profiles.\r\n\r\nSince these changes are dependent upon the Stylish extension, this manner of identification will not apply in Safe Mode.&nbsp; You can add a bookmark to the bookmarks toolbar with a title the same as that of the profile.&nbsp; You can use Help > Troubleshooting Information > click on \"Open Containing Folder\"\r\n\r\nIdentifying Stylish Custom dialogs and Edit within, using  \"dialog *\" instead of  just \"dialog\"  would be way too much coloring.\r\n\r\nIf you do not want to color bookmarks toolbar background such as on your main profile comment out some of the bookmarks toolbar code.\r\n\r\nThis style is to be able to simply identify several profiles using a minimum amount of pastel coloring and low impact on Firefox, I only color the menu bar and status bar, but color more on dialogs that don't appear as often.  \r\n\r\n''The \"AnyColor\" extension is not an extension alternative since it was not updated for Firefox 5-- all the more reason to use Styles instead of extensions.''&nbsp; Those with only one profile and want a customizable extension like \"AnyColor\" (274KB) -- https://addons.mozilla.org/firefox/6991 or any of the many coloring styles  by searching here in userstyles.org on \"theme\".&nbsp; Anyone who wishes to actually see their toolbars should avoid \"personas\" (light themes).\r\n\r\nAlternative style \r\n\r\nLeave the Tab colors alone in this style, but see style 9023. Suggest resizing Menu bar,  Navigation Bar, and Status Bar with other styles found on my profile (user  12592). \r\n\r\nAlternative style 33773 (33773) is compatible with personas. \r\n\r\n---------------------------------------------------------------\r\nWindows 7 Aero Damage control\r\n\r\nHow to turn disable transparency of Aero Glass and get closer to classic, while maintaining Windows 7 changes. \r\n* Control Panel\\All Control Panel Items\\Personalization \r\n* Pick a Theme or current theme \r\n* at the bottom click on Advanced Windows Color and Appearance \r\n* choose a color, change intensity to about 75% (experiment) \r\n* turn off the transparency checkmark <=== (Must be like Firefox, \"advanced features\" means what you are used to without the crap)\"\r\n* above is from http://dmcritchie.mvps.org/windows-7/win7.htm\r\n\r\nIf you have Aero on your system,  you will need to append the following o they style code  included.\r\n\r\n/* Minefield Firefox 4.0 with Windows 7 AERO damage control */\r\n#searchbar /* Search Bar */\r\n, #urlbar /* Location Bar */\r\n{background-color: #ffffff !important; }\r\n#nav-bar /* Navigation Bar */\r\n, #urlbar-container /*surrounds urlbar */\r\n{background-color: #f0f0f0 !important; }\r\n#PersonalToolbar /* Personal Toolbar (bookmarks toolbar) / 2nd color*/\r\n{background-color: #f8fff0 !important; }\r\n\r\n---------------------------------------------------------------\r\n\r\nUpdates: since 2008-08-10\r\n2008-12-22 dialogs change inner gray color and url-link, customize\r\n2009-10-15 Error console\r\n2010-04-28 Stylish Custom coloring\r\n2010-10-12 browser-bottombox replacement of status-bar (damage control)\r\n2011-02-17 Stylish edit dialog, addon-bar 4.0 Fx4 damage control",
    "format": "uso",
    "category": "browser",
    "createdAt": "2008-08-10T16:19:17.000Z",
    "updatedAt": "2011-02-17T09:21:42.000Z",
    "license": "NO-REDISTRIBUTION",
    "author": {
      "id": 12592,
      "name": "David McRitchie",
      "homepage": "http://kb.mozillazine.org/User:Dmcritchie"
    }
  },
  "stats": {
    "installs": {
      "total": 1794,
      "weekly": 0
    }
  },
  "screenshots": {
    "main": {
      "name": "9514_after.png",
      "archived": false
    }
  },
  "discussions": {
    "stats": {
      "discussionsCount": 0,
      "commentsCount": 0
    },
    "data": []
  },
  "style": {
    "css": "@namespace url(http://www.mozilla.org/keymaster/gatekeeper/there.is.only.xul);\r\n\r\n/* Color Toolbar(s) to identify profile   - David McRitchie (DM*)  */\r\n/* ===============  Style 9514, User 12592 ======================= */\r\n/* David McRitchie,  2008-08-10 created                  */\r\n/* 2008-12-22 dialogs change inner gray color, url-link, customize */\r\n/* 2009-10-15 Error console                                        */\r\n/* 2010-04-28 window  - Stylish Custom coloring,   still note edit */\r\n/* 2010-10-12 browser-bottombox replacement of status-bar (Fx4 damage control)\r\n/* 2011-02-17 Stylish edit dialog, addon-bar 4.0 Fx4 damage control*/ \r\n\r\n/* Use color to identify TEST profiles or system --  examples try in color picker\r\n   #F3E078 (Fx3_main/orangish), #FFC (light beige), #CCF (gray-blue), \r\n   #F3E0ff (purplish), #33FF33/#f8fff0 (minefield/greenish), #E4C880 (tan) */\r\n\r\n  #status-bar, #browser-bottombox, #bookmark-window  {\r\n   -moz-appearance: none !important;}\r\n\r\n  #toolbar-menubar    /*Firefox Menu Bar */\r\n  , window            /* 2010-04-28 stylish-custom styles, but ^edit */ \r\n  , dialog            /*dialogs change inner gray color */  \r\n  , #status-bar       /*Firefox Status bar    */\r\n  , #browser-bottombox /* 2010-10-12 status-bar replacement in Fx4 */\r\n  , #toolbar          /*Manage Styles Toolbar */        \r\n  , #style-url-link   /*Styles edit - Visit website in edit.css*/\r\n  , #palette-box      /*Customize Toolbar icons from style 547 */\r\n  , #extensionsManager /*Addons dialog background  */\r\n  , #trDOMTreeBody    /*Dom Inspector tree items can't hit dialog */\r\n  , #BrowserPreferences /* tools options Main Tab */\r\n  , #updates          /* Help - Check for Updates  */\r\n  , #ConsoleBox       /* Error console picked up  */\r\n  , #contentView .tree-bodybox  /* Library - Organize Bookmarks, list*/\r\n  , #stylishCustomToolbox  /* stylish custom edit dialog */\r\n  , #addon-bar        /* Fx4.0 Status bar  */\r\n  {background-color: \t#F3E078 !important; }\r\n\r\n/* possibly choose a lighter background tone for personal bookmarks */\r\n/*  #PersonalToolbar /* Personal Toolbar (bookmarks toolbar)*/\r\n/*  {background-color: #F3E078 !important; } /* lighter than #F3E078 */ \r\n\r\n/* Note if you followed the tip for this style you included the color wanted at the */\r\n/* end of your description to facilitate manually updating the code after updates */\r\n\r\n/* See styles notes -- you may want to include  AERO damage control here... */\r\n\r\n"
  }
}