{
  "id": 96044,
  "info": {
    "name": "TT DeepDark: change msg list highlight/selection",
    "description": "Better highlights the currently <b>selected</b> message.\r\n\r\nReactivates the hightlight of the currently focused (when you navigate in the list without selecting) message.\r\n\r\nPlease remember that the current message (navigating with Up and Down, for example) is <b>always</b> selected <b>and</b> focused.\r\n\r\nYou really don't need to use TT DeepDark to use this. But the changes may or may not be visible or pleasant, according to your current theme.",
    "additionalInfo": "As of Thunderbird v24.1.1 using TT DeepDark v9.0.4.2 (great dark theme, btw), maybe it's by design, but I lost the capability of quickly checking what's the currently selected message in message list. This only happens if it's on an odd line, since the list is striped. As the selected line background color was the same, you could lose track of which one you were selecting, except by moving again, of course.\r\n\r\nI also fixed the currently <b>focused</b> message highlighting. This is different from selection. If you use the keyboard a lot, like me, sometimes you have some messages selected and wants to select another that is not contiguous (by using the Ctrl key to move the focused line). This was completeley disappeared in my TB with TT DeepDark and I changed it in order to get it back.\r\n\r\nAnyway, design and Thunderbird CSS is not my specialty. Any suggestions are always welcome!\r\n\r\n<i>(I also hope that Steva, author for TT DeepDark, does not get upset with my proposed changes - I guess viewing can change a lot from some displays to others, don't know if it was my case)</i>",
    "format": "uso",
    "category": "browser",
    "createdAt": "2013-12-11T20:47:28.000Z",
    "updatedAt": "2013-12-11T20:47:28.000Z",
    "license": "NO-REDISTRIBUTION",
    "author": {
      "id": 251191,
      "name": "Charles Canato",
      "paypalEmail": "charlescanato@yahoo.com.br",
      "homepage": "http://charlescanato.blogspot.com"
    }
  },
  "stats": {
    "installs": {
      "total": 728,
      "weekly": 0
    }
  },
  "screenshots": {
    "main": {
      "name": "96044_after.png",
      "archived": false
    }
  },
  "discussions": {
    "stats": {
      "discussionsCount": 1,
      "commentsCount": 1
    },
    "data": [
      {
        "id": 39424,
        "title": "Nice catch",
        "createdAt": "2013-12-13T05:26:13.000Z",
        "author": {
          "id": 251306,
          "name": "To6"
        }
      }
    ]
  },
  "style": {
    "css": "@namespace url(\"http://www.mozilla.org/keymaster/gatekeeper/there.is.only.xul\");\r\n\r\ntreechildren::-moz-tree-row(selected) {\r\n  background-image: linear-gradient(rgba(255,255,255,.15), rgba(255,255,255,.15)) !important;\r\n}\r\n\r\ntreechildren::-moz-tree-row(current, focus) {\r\n  border: 1px dotted blue !important;\r\n}"
  }
}