{"id":109448,"name":"SailorFuku - (outil)Magasin_Type vêtement","category":"site","raw_subcategory":"sailorfuku","subcategory":"sailorfuku","style_tags":[],"description":"Éditez cet outil pour n'afficher qu'une ou certaines sortes de vêtements. Mettez le terme INITIAL à la place de NONE pour afficher une catégorie, ou à l'inverse changer INITIAL en NONE si vous ne voulez pas qu'une sorte s'affiche.\r\n\r\nNB : je vous conseille d'utiliser avec style 109447 car sinon il est facile d'oublier qu'on ne voit pas certaines catégories. Avec l'outil de coloration, on s'en rend vite compte (si vous ne voyez que des vignettes jaunes, vous en déduirez que vous avez laissé le sélectionneur de types de fringues actif pour la seule catégorie \"hauts\")","user":{"id":44925,"name":"S9Clay","email":"redacted","paypal_email":null,"homepage":null,"about":"Bonjour !\r\n\r\nA propos de moi... Ben j'aime les CCS, je suis nulle en graphismes, donc je fais plein de trucs cools et kitchs X-D.\r\n\r\nSi l'un des themes semble ne pas fonctionner, contactez-moi en précisant la version de votre navigateur : je ne mords pas et ferai mon possible pour améliorer la chose ^__^.\r\n<i>If there is a problem on my themes, please contact me and tell me which browser and its version : I will try to adapt the theme.</i>\r\n\r\n\r\nJe ne mets pas de pledgie campagn ni mon adresse paypal, car j'aurais du mal à imaginer demander une rétribution pour ce que je fais par loisir, et d'abord pour moi-même. Cependant, si vous tenez à me remercier pour ce partage, vous pouvez éventuellement envoyer des dons à l'association que j'ai décidé de mettre en avant : La Quadrature Du Net. Ainsi, votre récompense à une chose que j'ai faite pour moi, ira aussi à vous ^o^.\r\n<a href=\"https://soutien.laquadrature.net/\" title=\"lien vers la page de soutien de la Quadrature du Net\">Aller sur la page de soutien de l'asso La Quadrature Du Net !</a>\r\nLQDN est une association de défense des droits propres à internet : elle participe activement à la défense de la liberté et de la neutralité du net, et à l'information du public à ce propos.\r\n<i>I don't have a paypal account or a pledgie campaign, but I would like to help a french association for the rights on internet : La Quadrature Du Net. They fight to make or change laws to protect freedom and rights of internet. It's important for all of us :-)</i>","license":"ccbyncsa"},"admin_delete_reason_id":null,"updated":"2015-01-18T04:50:33.000Z","weekly_install_count":0,"total_install_count":87,"rating":null,"screenshot_url":"https://userstyles.org/style_screenshots/109448_after.jpeg?r=1587801908","url":"/styles/109448/sailorfuku-outil-magasin-type-v-tement","discussionsCount":0,"commentsCount":0,"css":"@namespace url(http://www.w3.org/1999/xhtml);\r\n\r\n@-moz-document url-prefix(\"http://www.sailorfuku.com/shop/shop.html?shop_id=\") {\r\n\r\ndiv.article_oreilles {display : NONE !important ;}  \r\ndiv.article_lunettes {display : NONE !important ;}  \r\ndiv.article_haut {display : INITIAL !important ;}  \r\ndiv.article_bas {display : NONE !important ;}  \r\n  \r\n}"}