{"id":11190,"name":"Freewebs - Evil Homepage","category":"site","raw_subcategory":null,"subcategory":null,"style_tags":[],"description":"The first page you reach on Freewebs (http://members.freewebs.com/) will have a black background and red features on it. The \"remember me\" button is only red when you click it because it is controlled by JavaScript.\r\n\r\nThe username box and password box can use the font \"Old English Five\" if you have it (giving it a sort of medieval look). The blue-drenched orange arrow is still there since I cannot change the 'src' of an image via CSS. The text boxes are most of the time white for an unidentified reason.\r\n\r\nThe demo video picture is replaced with a picture of http://www.freewebs.com/emosaint/ because looks dark-colored. It moves a little to the left because of my incorrect positioning.\r\n\r\nThe 4 possibilities pictures are removed and so is the box to the right of them.\r\n\r\nI removed the Search box because I never (if not rarely) use it plus the arrow has a blue background and again, I cannot change the 'src' attribute of an image via CSS. If I could change the image, I would have kept the search bar.\r\n\r\nINSTRUCTIONS: Do not press the \"Load into Stylish\" button! Because of the big filesize, the real stylesheet is at:\r\nhttp://www.freewebs.com/sgh9/darkfreewebshome.css","user":{"id":15579,"name":"styling_pages_is_cool","email":"redacted","paypal_email":null,"homepage":null,"about":null,"license":null},"admin_delete_reason_id":null,"updated":"2008-10-11T01:09:17.000Z","weekly_install_count":0,"total_install_count":431,"rating":null,"screenshot_url":"https://userstyles.org/style_screenshots/11190_after.gif?r=1595837307","url":"/styles/11190/freewebs-evil-homepage","discussionsCount":0,"commentsCount":0,"css":"/*\r\n\r\nThe real CSS file is too big so I put it on my site:\r\n\r\nhttp://www.freewebs.com/sgh9/darkfreewebshome.css\r\n\r\n*/\r\n\r\n\r\n@-moz-document url(\"DO_NOT_USE_THE_CONTENT_OF_THIS_BOX_AS_YOUR_STYLE,_USE_THE_FILE_ABOVE\") {\r\n}\r\n"}