{"id":113156,"name":"Multi-Column Spanning Widescreen Google Results","description":"Columnized (or 'boxified'?) search results. Great for huge monitors or widescreen TVs. I have a 3200x1080 desktop, so I hated the fact that all my search results only occupied the 15% of the left side of the screen while the rest lay unused on the right* The style in the preview is combined with \"Darker Google\" by Zigboom Designs.","user":{"id":87204,"name":"osirisgothra","email":"osirisgothra@hotmail.com","paypal_email":"osirisgothra@hotmail.com","homepage":"http://www.github.com/osirisgothra","about":"Gabriel Sharp\r\n\r\nI consider myself a lifetime student of Computer Sciences and Information Sciences, as the time for learning is never over, especially when working in a field that deals with envelopes that are ever-changing, pushing endlessly, so to speak. My work and play cross paths often since I get a lot of joy out of what I do and study, some of which are:\r\n\r\n- Perl + CPAN Developer\r\n- Linux C++ Developer (Qt4, Qt5, KDE4, KFM5, and related)\r\n- Shell Script Developer (Perl, BASH, sh, upstart, vim plugin development)\r\n- Web Style Developer (CSS, SaSS, SGML, HTML5, etc) though I do know HTML4 too [who doesn't?]\r\n- Windows C++ Developer (Old Pro in Microsoft related technologies)\r\n- Old-School Technologies (qbasic, vbdos, borland c++, ms-dos 6.66, i386 assembler /w emphasis on _some_ 64-bit stuff)\r\n- Music Hobbyist (Electronic Music Writer, Piano, Keyboard player/Enthusiast)\r\n- Graphic Artist (Pencil/Pen/Watercolor physical media, Maya/Blender/3DSMax/Bryce/Gimp/Photoshop HD and post-production)\r\n\r\nI am not currently in any group at the time. I am not sure if I will be doing that ever again. The last few groups I participated in were too incoherent and seemed to have different ideals, ethics, goals. \r\n\r\nI am open to suggestion or requests, just don't make them impossible for a single person to do. Requesting a theme have a black version is probably okay. Requesting that I personally show up and restyle your entire website is probably not. Of course, if I were getting paid to do it, that would be a whole other matter, but I rarely see people paying for such things these days when you can hire someone in another country to do it for 2 cents -- that's right I'm a bitter man :D= \u003c- those are vampire teeth!!","license":"publicdomain"},"updated":"2015-04-29T03:16:37.000Z","weekly_install_count":0,"total_install_count":369,"rating":null,"after_screenshot_name":"https://userstyles.org/style_screenshots/113156_after.jpeg?r=1687334414","obsoleting_style_id":null,"obsoleting_style_name":null,"obsolete":0,"admin_delete_reason_id":null,"obsoletion_message":null,"screenshots":null,"license":"publicdomain","created":"2015-04-27T16:58:19.000Z","category":"site","raw_subcategory":"google","subcategory":"google","additional_info":"*=by 'unused on the right' i actually mean 'used by all those ads'.. its not like I use an ad blocker  that viciously removes any and all ads and is called adblock+ aka 'ABP', or anything like that :)\r\n- v1.1 \"the-very-next-day-fixed-stuff-that-was-apparently-wrong-bugfixes\"\r\n- Fixed google's 'you did this wrong' cues from mixing with results (appearing under first last boxes)\r\n- Kinda fixed the long ending BUT... google does modify this en route so ive noticed if stylish doesnt change it after google dynamically changes the column to not float, it ends up having a huge space at the end. There is nothing I can do about that save writing a greasemonkey script and thats just not worth it. I made it so the 1 2 3 4 5 6 bar (is that what its called?) appears right under the results, so unless you are dying to read the copyright messages, you shouldnt suffer much.\r\n- v1.0\r\n- Intended For Mozilla-Based Browsers (for now)  tested with firefox 35+, komodo 8\r\n- written quickly by gabriel sharp (osirisgothra@hotmail.com)\r\n- uses some experimental phase CSS (-moz-) to grid-ize/columnize search results\r\n- doing this required me to hide the footer stuff.... so yeah i know it has that (but who cares, we have columns now!!! yay!)\r\n- uses NO filter elements or other performance-degrading css elements!\r\n- public domain\r\n- spelling, grammar, and other mistakes in the text is intentional because I am human and we need to remeber not to submit to such tools lest our handwriting look worse than our kids' 3rd grade handwriting, which is still pretty bad since they are already using computers at school at that age. By intended, i mean the not using autochecking tools, not the mistakes themselves. (btw, I'd post this at the end of most of my new descriptions whenver I can remember to do it).","style_tags":[],"css":"@namespace url(http://www.w3.org/1999/xhtml);\r\n\r\n@-moz-document domain(\"google.com\") {\r\n      \r\n   \r\n    .mw\r\n    {\r\n        display: -moz-grid !important;\r\n        width: 100% !important;\r\n        max-width: 100% !important;\r\n    }\r\n/* not working? Now open your inspector... notice that the item\r\n   with the .col class is still saying 'float: right'? Thats because\r\n  google dynamically **cks with their pages after they are loaded\r\n  making stylish changes completely useless unless it gets lucky\r\n  this happens 1 out of 50 times for me.\r\n  \r\n  along with web devs adding \"!important\" to their css/sass, this dynamic css is something i hate even more!\r\n  \r\n  */\r\n    .col\r\n    {\r\n        float: none !important;        \r\n    }    \r\n    #rcnt, #center_col\r\n    {\r\n        float: none !important;        \r\n        width: 100% !important;\r\n        max-width: 100% !important;        \r\n        display: -moz-grid !important;\r\n    }\r\n    li.g:hover\r\n    { opacity: 1.0; }\r\n    li.g\r\n    {        \r\n\r\n        border: white solid 1px;\r\n        padding: 4px;\r\n        margin: 4px;\r\n        border-radius: 9px;\r\n        opacity: 1.0;\r\n        display: -moz-grid !important;\r\n        overflow: hidden !important;\r\n        width: 512px !important;\r\n        height: 128px !important;        \r\n   \r\n    }\r\n    \r\n    #navcnt,#botstuff,#extrares, .card-section\r\n    {\r\n        display: inline;        \r\n    }\r\n\r\n\r\n}","discussions":[],"discussionsCount":0,"commentsCount":0,"isPremium":false,"userjs_url":"/styles/userjs/113156/multi-column-spanning-widescreen-google-results.user.js","style_settings":[]}