{"id":121663,"name":"Postimage - Black - Lime \u0026 Cyan Links, Red Hover","description":"Postimage.org Free Image File Host restyle - Black Background with Lime and Cyan text links (Red Links when hovered).\u003cbr\u003e\u003cbr\u003eThis restyle pushes the top down to help center the user interface (on logged-out homepage and uploading pages only), and recolors the elements. Removed \"Add to Favorites\" bookmark link and all footer links. To compensate for the pitifully small user interface, user is advised to zoom magnify the page with their browser controls, as shown in screenshot (133% or 150% minimum suggested; whatever user prefers) - your browser will remember this site-specific zoom scaling. Alternate screenshot, linked under the main \"style enabled\" screenshot, shows Postimage.org unmodified (with the style disabled). A mini tutorial on the excellent Postimage file host service, from a satisfied user, is at the bottom of the NOTES section.","user":{"id":298434,"name":"R. Schneider","email":"rschneider@engineer.com","paypal_email":null,"homepage":null,"about":"I have another Google mod - a Greasemonkey user script,\u003cbr\u003e\"Revert to Google's Old 2012-2015 Favicon\" (reverts to the white lower-case \"g\" in blue square)...\r\nhttps://greasyfork.org/en/scripts/12271-revert-to-google-s-old-2012-2015-favicon","license":"ccbync"},"updated":"2017-04-02T01:40:17.000Z","weekly_install_count":0,"total_install_count":167,"rating":null,"after_screenshot_name":"https://userstyles.org/style_screenshots/121663_after.png?r=1679990417","obsoleting_style_id":null,"obsoleting_style_name":null,"obsolete":0,"admin_delete_reason_id":null,"obsoletion_message":null,"screenshots":["https://userstyles.org/style_screenshots/121663_additional_17791.png?r=1679990417"],"license":"ccbync","created":"2015-12-10T08:10:05.000Z","category":"site","raw_subcategory":"postimg","subcategory":"postimg","additional_info":"\u003cb\u003e2017 Jan 31 / Feb 01 - UPDATE: \"http://postimage.org\" NOW REDIRECTS to \"https://postimage.io\".\u003c/b\u003e Due to the variety of scripts that try to run - identified by the \"uBlock Origin\" ad blocker add-on - Postimage may now have one or more servers hosted in Russia (at least, Russian sites are the origin of some of those scripts). Due to the new URL, this user style stopped working. So, this user style's \"@-moz-document url-prefix\" has been updated to reflect Postimage's new URL, to enable Stylish to detect that new URL as an applicable user script target.\r\n\r\n\u003cb\u003e2016 Nov 5 - UPDATE:\u003c/b\u003e Postimage.org posted a Notice on their website that their image availability problem has been resolved, for now, due to support received in response to their pleas - support from user donations, and companies offering free server and reduced-price CDN services. See my Pastebin posting (linked in the Oct 27 NOTICE, below), for the latest update information (which also details the Postimage.org image availability problem).\r\n\r\n\u003cb\u003e2016 Oct 27 - NOTICE !!!\u003c/b\u003e The image hosting service I have used for years, Postimage.org (founded in 2004), had the access to the servers hosting all their images taken offline by their Content Delivery Network provider, CloudFlare.com - which has NOT affected the Postimage.org website, just the servers storing their hosted images.\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u003cb\u003e(1) ALL Postimage HOSTED IMAGES WERE UNREACHABLE / NOT BEING SERVED UP / HAD DEAD LINKS, starting Oct 27, 2016.\u003cbr\u003e\u0026nbsp;\u0026nbsp;(2) Postimage Hosted Images became available again sometime before late-day Oct 29, 2016.\u003c/b\u003e\u003cbr\u003eThat's right, CloudFront shut down Postimage.org's image hosting server access, making nearly 140 million images hosted by Postimage, and embedded into some 450 thousand websites, totally unreachable - due to Postimage exceeding CloudFlare's bandwidth useage limits, even though CloudFlare clearly states (on their Support page), \"CloudFlare does not have bandwidth limits. As long as the domains being added comply with our Terms of Service, CloudFlare does not impose any limits.\" By the way, CloudFlare's Terms of Service also went offline the same day, and wasn't restored until about 9pm Eastern Time (US) Oct 27, possibly related to their re-wording their Terms of Service after Postimage claimed there had been no guidance from CloudFlare on exceeding any bandwidth limits. (I uploaded Postimage.org's NOTICE about the problem in a PasteBin posting of mine, for those interested, at http://pastebin.com/0Dp510C2).\u003cbr\u003eThere is no way to know at this time whether Postimage.org will have consistant access to their hosted images in the future, though image access was initially restored within 2 days of the first outage - but for how long? I had 2 critical images hosted on Postimage: my Google logos for 2 Stylish UserStyles [both my \"Black Google by Panos - R. Schneider Mod (Large)\" \u0026 \"... (Small)\" userstyles]. I have since uploaded those images to \u003ci\u003e\"Imgur.com\"\u003c/i\u003e (also a free image hosting service, and very big), and edited my Stylish UserStyles to point to the new \u003ci\u003e\"imgur.com\"\u003c/i\u003e URLs. [\u003cb\u003eNOTE:\u003c/b\u003e CloudFlare.com should not be confused with another CDN with a similar name, Cloudfront.net.]\r\n\r\n\u003cb\u003ev1.3 - Styling differentiated between \"Logged-In\" vs \"Logged-Out\" and \"Homepage \u0026 Uploading Pages\" vs \"All Other Pages\" with separate @-moz-document rules.\u003c/b\u003e The 40-pixel top push-down now applies only on postimage.org (spelled-out \"image\") - NOT on postimg.org (abbreviated \"img\"), which allows uploaded large-height images (on postimg.org) to display in \"fit-to-page\" full screen without a vertical scrollbar. [All pages from homepage, to uploading, to display of uploaded image, to display of all uploaded photo links (for logged-in user - more in the 2nd from last paragraph of this NOTES section) - now look great with this style, whether logged-in or logged-out.]\r\n\r\n\u003cb\u003ev1.2 - Added image upload progress bar color\u003c/b\u003e (cyan on black background).\r\n\r\n\u003cb\u003ev1.1 - Released WITHOUT zoom scaling\u003c/b\u003e (the 40-pixel top push-down was retained), and advise users to employ browser zoom magnification of 133%, 150%, or whatever they prefer (user's browser will remember this site-specific, user chosen zoom scaling)...\u003cbr\u003eCSS transform declaration is now - \u003cu\u003ehtml {transform:translateY(40px) !important;}\u003c/u\u003e - \u003cb\u003eBUT (as of v1.3) ONLY\u003c/b\u003e on \"postimage.org\" (spelled-out \"image\".org) pages, \u003cb\u003eNOT\u003c/b\u003e on \"postimg.org\" (abbreviated \"img\".org) pages (see v1.3 Release Notes, above).\r\n\r\n\u003cb\u003ev1.0 - Released WITH fixed zoom scaling in CSS\u003c/b\u003e (along with 40-pixel top push-down)...\u003cbr\u003eCSS transform declaration - \u003cu\u003ehtml {transform:scale(1.2) transform:translateY(40px) !important;}\u003c/u\u003e\r\n\r\n\"Postimage.org\" has been a great Free Image File Host [they originally hosted my Google logos for my \"Black Google by Panos - R. Schneider Mod (Large)\" \u0026 \"... (Small)\" user styles]. [In the past, Imgur.com compressed images so much (lowering their quality), that professional photographers fled from their site in droves. Apparently now, that is not an issue]. \u003cb\u003ePostimage's features:\u003c/b\u003e Free - Unlimited Number of images (max. 8MB each - formats: JPG, PNG, GIF, BMP, TIFF, PDF, PSD) - NO COMPRESSION and NO DOWNWARD RESIZE (for the \"Default\" upload - however, the user can choose specific resizes) - Images are NEVER deleted due to inactivity - No Registration Required (the user can register - free - for more image gallery and links options - see next paragraph). [Oh, and, er, psst! - Postimage is one of the few (or only) \"Free\" Image File Hosts to allow hosting of Adult Content (with nudity) - however, the Postimage.org website says IF a user uploads an \"adult\" image WITHOUT selecting \"Adult Content\", it WILL be deleted. There are 2 radio buttons - \"Adult Content\" and \"Family Safe\" from which to select prior to upload.]\r\n\r\n\u003cb\u003eUPLOADED IMAGE DISPLAY:\u003c/b\u003e An uploader, whether logged-in OR logged out, or a visitor to an uploaded image page, sees JUST the uploaded image on a BLANK PAGE - NO banners or ads(!) - compare THAT to some other free image hosts.\r\n\r\n\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; \u003cb\u003eLogged-In (Registered Free User) vs Logged-Out (anonymous uploader):\u003c/b\u003e\r\n\r\n\u003cb\u003eLogged-in (registered users)\u003c/b\u003e are displayed a page with links to the image display page; links to the actual file (which includes the filename and extension) for direct linking; formatted URL links for forums; etc. Registered, logged-in users also have Galleries (\"folders\") for storing and organizing their uploaded images, with links info accessible to the user (an advantage of Registering). Registration for logging-in is totally free.\r\n\r\nPostimage uses your uploaded file's name, with spaces and some characters replaced with an underscore (\"_\"). If consecutive characters \"space\", \"hyphen\", \"space\" is used (\" - \"), Postimage replaces them with one underscore (\"_\"). If your filename is long, Postimage truncates it at 48 characters (plus extension), i.e. a \"48.3\" or 48.4\" naming convention (JPEG or TIFF being the \"4\"-character extensions). \r\n\r\n\u003cb\u003eLogged-out (anonymous uploaders)\u003c/b\u003e do not see a links display page, only the BLANK PAGE displaying the uploaded image. The link to that view-page can be copied from the browser's address bar (however, this URL does NOT display the filename for direct linking in a \"data URI/URL\"... just the URL of the display page)... \u003cb\u003eFor the actual direct link to the complete URL of the image\u003c/b\u003e (including filename and extension), either \u003cb\u003e(1)\u003c/b\u003e right-click the image, then click \"View Image\", then copy the URL from the \"View Image\" page's browser address bar - or \u003cb\u003e(2)\u003c/b\u003e right-click the image, then click \"View Image Info\", or \"Properties\" (available in Firefox if you have the \"Element Properties\" Add-On installed). \u003cb\u003eTHEN, COPY AND RECORD THE URL\u003c/b\u003e, along with details such as file name or description, in a text file.\r\n\r\nPostimage.org is based in the The Netherlands, so I have a better feeling about them respecting privacy, due to the European Union's strict Privacy Laws, administered and enforced by the European Commission (EC). The EC is right now disciplining Google - again - for violating Search Manipulation regulations; Google has been fined big-time in the past by the EC for violating European Individuals' Privacy Rights. So providing an email address and Registering at Postimage.org (a European company) doesn't raise the kind of Privacy concerns for me that a US-based file-host company does, since U.S. based companies all have cozy arrangements with the NSA, including backdoors.","style_tags":[],"css":"@-moz-document url-prefix(\"https://postimage.io\")  /* spelled-out \"image\" */\r\n\r\n      {\r\n\r\n/* \"LOGGED-OUT HOMEPAGE \u0026 UPLOADING PAGES ONLY\" CHANGES (URL = postimage.org) - NOTE \"image\" is spelled out\r\n   on LOGGED-OUT HOMEPAGE \u0026 UPLOADING PAGES ONLY (postimage.org), otherwise it is \"...img\" (postimg.org) */\r\n\r\n  /* On LOGGED-OUT HOMEPAGE \u0026 UPLOADING PAGES ONLY, push top down 40 pixels, to better center contents */\r\n\r\nhtml {transform:translateY(40px)!important;}\r\n\r\n  /* Recolor elements */\r\n  \r\n* {background:black!important; color:dimgray!important; border-color:dimgray!important; text-shadow:none!important;}\r\n\r\n#header a {color:cyan!important;}\r\n\r\na, a * {color:cyan!important; text-decoration:none!important;}\r\n\r\n#header a:hover, a:hover, b:hover, label:hover {color:red!important;}\r\n\r\ndiv#status_uploading.progress.overall-progress {background-color:cyan!important}\r\n\r\n  /* Remove \"Add to Favorites\" (bookmark) link, and all Footer links */\r\n\r\nspan#bmc, #footer {display:none!important;}\r\n\r\n}\r\n\r\n\r\n@-moz-document domain(\"postimg.org\")  /* abreviated \"img\" */\r\n\r\n      {\r\n\r\n/* LOGGED-IN \u0026 OTHER-THAN-HOMEPAGE CHANGES (URL Prefix = \"http://postimg.org/...\") */\r\n\r\n  /* Recolor elements */\r\n  \r\n* {background:black!important; color:dimgray!important; border-color:dimgray!important; text-shadow:none!important;}\r\n\r\n#header a {color:cyan!important;}\r\n\r\na, a * {color:cyan!important; text-decoration:none!important;}\r\n\r\n#header a:hover, a:hover, b:hover, label:hover {color:red!important;}\r\n\r\ndiv#status_uploading.progress.overall-progress {background-color:cyan!important}\r\n\r\n  /* Remove \"Add to Favorites\" (bookmark) link, and all Footer links */\r\n\r\nspan#bmc, #footer {display:none!important;}\r\n\r\n}\r\n","discussions":[],"discussionsCount":0,"commentsCount":0,"isPremium":false,"userjs_url":"/styles/userjs/121663/postimage-black-lime-cyan-links-red-hover.user.js","style_settings":[]}