{
  "id": 12373,
  "name": "userstyles.org -downsize screenshots to fit window",
  "description": "BEYOND OUR CONTROL:  (due to overlap of images and resizing)\r\nYou may no longer be able to compare Before and After images very well with new Stylish version and formatting, unless you turn off all styling with \"Read Easily\" extension or using View (Alt+V) --> Page Style --> No Style,  or anything else that will toggle CSS style on/off.   \r\n---\r\n\r\nWill downsize screenshots that exceed window width and will align them vertically, if necessary,  so you should be able to see most screenshots in their actual size instead of resized pictures side-by-side.  If the fullsize screenshots don't fit side by side they will be shown vertically, and may then be downsized to fit window, you can view them fullsize by hovering the cursor over the image, or by using context menu \"View Image\".    You can use the arrow keys to navigate within a hovered image.   To keep mouse away from hovering on images and changing size when comparing images, suggest keeping the cursor on the vertical scrollbar.",
  "user": {
    "id": 12592,
    "name": "David McRitchie",
    "email": "redacted",
    "paypal_email": null,
    "homepage": "http://kb.mozillazine.org/User:Dmcritchie",
    "about": null,
    "license": "ccbyncsa"
  },
  "updated": "2008-11-25T20:11:10.000Z",
  "weekly_install_count": 0,
  "total_install_count": 993,
  "rating": null,
  "after_screenshot_name": null,
  "obsoleting_style_id": null,
  "obsoleting_style_name": null,
  "obsolete": 0,
  "admin_delete_reason_id": null,
  "obsoletion_message": null,
  "screenshots": null,
  "license": null,
  "created": "2008-11-24T19:22:51.000Z",
  "category": "site",
  "raw_subcategory": "userstyles.org",
  "subcategory": "userstyles.org",
  "additional_info": "The Before and After shots will  appear fullsize unless your window is not large enough to accommodate a fullsize image.  Whenever two screenshots appear side by side, you will know that both screenshots are fullsize, since it was not necessary to split the second to a new line.   This is a big improvement over the default and over comparable styles.\r\n\r\nThis is my modification of user 1's   style 575 (575),  with the hovering option derived from user 14722's style 10575 (10575).   Additional comparable styles are style 321 (321),   style 2824 (2824),   and  style 6158 (6158).    \r\n\r\nuser 14809 pointed out his style 11912 (11912) and used downsize to window from there instead of to a fixed width - Thanks!.\r\n\r\nThis style can be tested with the very large screen shots found at style 3866 (3866), which have images 1338x611 and 1354x551, so will be aligned vertically since full sized before and after images cannot be shown side  by side.  \r\nBecause they are still too large, both images will be reduced in size to fit screen.  Hover over an  image to view full size.  To navigate within a large fullsize image use the arrow keys so you don't change mouse position by attempting to use scroll bars.\r\n\r\nA style that has images that could appear side by side without reduction will appear side by side without the default reduction, see style 9029 (9029) where the images are 311px x 181px and 347px x 313px.  Without restyling they would appear to have the same width, but the after image is actually wider.   \r\n\r\nIf the two images cannot appear side by side full size then they will appear on above / below each other and will be full-size if possible; otherwise, reduced to fit window width. \r\n\r\nIf the size of an image is reduced because it cannot fit in the window, then click on the plus-cursor (+) to see actual size.  \r\n\r\nIn another style there is a tremendous reduction both horizontally and vertically in the before and after pictures for style 9091 reduced from 623px x 24px  to 340px x 15px, without this style they would appear to be about the same size but in reality about twice as many bookmark folders could be shown in the same space.\r\n\r\nThe styles that I use can be seen briefly described at http://kb.mozillazine.org/User:Dmcritchie\r\n\r\nRecommended Customization:\r\n/* customization: make userstyles readable after 2009-06-15 change */\r\nh1 {color:white !important; background-color: #5573A0 !important; \r\n   font-variant: normal !important;}\r\n\r\nUpdates  since 2008-11-24\r\n2008-11-25 incorporate most of downsize screenshot portion found in 11912",
  "style_tags": [],
  "css": "/* userstyles.org - downsize screenshots to window width (DM) */\r\n/* hovering or use of context \"View Image\" will show fullsize image   */\r\n/* ===================================================== */\r\n/* David McRitchie, 2008-11-24 Style 12373, updated (none)*/\r\n/* 2008-11-25 incorporate most of downsize screenshot portion found in 11912 */\r\n\r\n/* use right arrow key to move  right when hovering over  image  */\r\n\r\n@-moz-document domain(\"userstyles.org\") {\r\n/* 14722 hover, 575  don't resize  */\r\nimg.multiple-screenshot:hover \r\n     {max-width: none !important;   }\r\nimg.single-screenshot:hover\r\n     {max-width: none !important;}\r\n\r\n/* style 321 has a resize but found better in 11912 */  \r\n/* style 11912 Large screenshots are downsized to fit the body of the page*/\r\n.screenshot-table  {display:block!important;text-align:left!important;} \r\n.screenshot-table *{display:inline-block!important}  \r\n.screenshot-table tbody,.screenshot-table tr,.screenshot-before,.screenshot-after,.screenshot  {max-width:100%!important}\r\n\r\n}  /* end brace for domain limitation */\r\n",
  "discussions": [
    {
      "id": 11075,
      "name": "I'm giving 5 stars however I already made even bet",
      "rating": 3,
      "created": "2008-11-25T00:02:14.000Z",
      "author_name": "xren",
      "author_id": 14809
    }
  ],
  "discussionsCount": 1,
  "commentsCount": 2,
  "userjs_url": "/styles/userjs/12373/userstyles-org-downsize-screenshots-to-fit-window.user.js",
  "style_settings": []
}