{
  "id": 124974,
  "name": "Mail.com News Links - Delete Floating Header Bar +",
  "description": "Removes the SUPER ANNOYING Floating Header Bar, with its Horizontal Progress-Strip (that displays the article page vertical-scroll position, and follows you down the page), from Mail.com NEWS-related articles ONLY. The standard, non-floating Header Bar is NOT removed on Mail.com's home page, login, logout, or any other NON-NEWS pages. News topic categories (such as \"SciTech\", \"Business\", \"Entertainment\", etc) are added to this User Style's \"@-moz-document url-prefix\" section when new URL patterns are encountered. Also, removes the blocks of ads and junk in the right column. See the 2nd screenshot (with User Style disabled) linked under the main screenshot, which shows elements removed. I recommend also using \"Mail.com - Project:ABE\" for Mail.com generally (see the <b>NOTES</b> section).",
  "user": {
    "id": 298434,
    "name": "R. Schneider",
    "email": "redacted",
    "paypal_email": null,
    "homepage": null,
    "about": "I have another Google mod - a Greasemonkey user script,<br>\"Revert to Google's Old 2012-2015 Favicon\" (reverts to the white lower-case \"g\" in blue square)...\r\nhttps://greasyfork.org/en/scripts/12271-revert-to-google-s-old-2012-2015-favicon",
    "license": "ccbync"
  },
  "updated": "2016-05-12T03:48:44.000Z",
  "weekly_install_count": 0,
  "total_install_count": 82,
  "rating": null,
  "after_screenshot_name": "https://userstyles.org/style_screenshots/124974_after.jpeg?r=1588320287",
  "obsoleting_style_id": null,
  "obsoleting_style_name": null,
  "obsolete": 0,
  "admin_delete_reason_id": null,
  "obsoletion_message": null,
  "screenshots": [
    "https://userstyles.org/style_screenshots/124974_additional_18985.jpeg?r=1588320287"
  ],
  "license": null,
  "created": "2016-03-01T03:59:01.000Z",
  "category": "site",
  "raw_subcategory": "mail",
  "subcategory": "mail",
  "additional_info": "<b>2016/05/12 - v1.2:</b> Mail.com changed their CSS name for the Floating Header Bar, <b>AND</b> added \"https\" protocol to their news pages - both of which broke my Floating Header Bar deletion (since I used their previous \"http\" protocol addressing in all my \"@-moz-document url-prefix\" listings, to match their older URL protocol). By adding both \"http\" and \"https\" protocols to the \"@-moz-document url-prefix\" list, AND using their new name for their Floating Header Bar in my CSS, this Style's functionality has been restored.\r\n\r\nOn Mail.com, I recommend using both my user style to clean up the News Article page links, as well as Kurim's user style \"Mail.com - Project: ABE\" ('Mail.com - Project: A Better Experience'), which cleans up Mail.com pages generally. These 2 styles compliment each other, for all users who use Mail.com for email and occasionally click a News article link from the Mail.com homepage portal. Also, there are NO conflicts leaving both User Styles enabled simultaneously. [Per the \"@-moz-document\" rules in our CSS codes, Kurim's style applies to the Mail.com domain generally (but did NOT clean up the ads on News Article pages - until after I published my code, then found an omission in Kurim's, and edited my copy of Kurim's style on my computer), while mine applies to the specific URL prefixes of AP News Articles, and ONLY affects those News pages linked from the Mail.com homepage portal.]\r\n &nbsp;&nbsp;&nbsp; * Kurim's style: https://userstyles.org/styles/116553/mail-com-project-abe\r\n\r\nMail.com has offered Free-For-Life web-based e-mail accounts since 1995. I've used them for over 10 years and like the company. A UNIQUE feature of Mail.com is the ability to pick your <b>DOMAIN</b> from OVER 200 choices! (Your email address = \"<b>{chosen username} @ {DOMAIN}\"</b>). ALSO, Mail.com users can have 10 free email addresses (1 default plus 9 alias addresses), all of which deliver to the chosen \"default address\" inbox - only 1 login is needed. See my PasteBin page (http://pastebin.com/3j5FySf8) for a list of Mail.com's free e-mail Domains (200+ available), plus more information about the company, and my experiences with them. They are currently run by \"1&1 Internet\" - one of the largest internet website hosting companies in the USA - in partnership with United Internet AG (of Europe), a branch of GMX - with servers in Kansas USA, Germany, Asia, and elsewhere. No need to upgrade to their pro, paid version, unless you want a Premium Service such as email forwarding, or delivery to a POP email client on your computer.",
  "style_tags": [],
  "css": "@namespace url(http://www.w3.org/1999/xhtml);\r\n\r\n@-moz-document url-prefix(\"http://www.mail.com/news/\"),\r\n               url-prefix(\"https://www.mail.com/news/\"),\r\n               url-prefix(\"http://www.mail.com/scitech/\"),\r\n               url-prefix(\"https://www.mail.com/scitech/\"),\r\n               url-prefix(\"http://www.mail.com/business/\"),\r\n               url-prefix(\"https://www.mail.com/business/\"),\r\n               url-prefix(\"http://www.mail.com/entertainment/\"),\r\n               url-prefix(\"https://www.mail.com/entertainment/\"),\r\n               url-prefix(\"http://www.mail.com/pictures/\"),\r\n               url-prefix(\"https://www.mail.com/pictures/\"),\r\n               url-prefix(\"http://www.mail.com/sports/\"),\r\n               url-prefix(\"https://www.mail.com/sports/\")\r\n    { \r\n\r\n/* Remove the SUPER ANNOYING Floating Header Bar, with its Horizontal Progress-Strip\r\n   (that displays the article page vertical-scroll position), from Mail.com NEWS-related\r\n   articles ONLY, that are linked from its homepage AP News portal. The Header Bar is NOT\r\n   removed on Mail.com's home page, login, logout, or any other NON-NEWS pages. News topic\r\n   categories (such as \"SciTech\", \"Business\", \"Entertainment\", etc) are added to this User\r\n   Style's \"@-moz-document url-prefix\" section when new URL patterns are encountered. */\r\n  \r\ndiv.mod.mod-header {display:none !important;}\r\n\r\n/* Remove ad and junk blocks in right column - such as ad block \"Your Future Job\", and junk\r\n   blocks such as \"Popular Searches\", \"Trending Now, and \"Most Read Articles\" - to the right\r\n   of the news article content */\r\n\r\ndiv.mod.mod-tool {display: none !important;}\r\n   \r\n}\r\n",
  "discussions": [],
  "discussionsCount": 0,
  "commentsCount": 0,
  "userjs_url": "/styles/userjs/124974/mail-com-news-links-delete-floating-header-bar.user.js",
  "style_settings": []
}