{
  "id": 135767,
  "name": "No ClearType",
  "description": "Стиль для корректного отображения шрифтов при выключенном \"ClearType\" и сглаживании шрифтов, в условиях отсутствия функции \"Disable DirectWrite\" \r\nДействует аналогично функции браузера FireFox, глобально заменяя шрифты используемые на страницах, шрифтами оговоренными в этом стиле.",
  "user": {
    "id": 350818,
    "name": "jakill02",
    "email": "redacted",
    "paypal_email": null,
    "homepage": null,
    "about": null,
    "license": "publicdomain"
  },
  "updated": "2019-07-20T14:54:10.000Z",
  "weekly_install_count": 0,
  "total_install_count": 120,
  "rating": null,
  "after_screenshot_name": "https://userstyles.org/style_screenshots/135767_after.jpeg?r=1600157081",
  "obsoleting_style_id": null,
  "obsoleting_style_name": null,
  "obsolete": 0,
  "admin_delete_reason_id": null,
  "obsoletion_message": null,
  "screenshots": [
    "https://userstyles.org/style_screenshots/135767_additional_23363.jpeg?r=1600157081"
  ],
  "license": null,
  "created": "2016-11-28T19:50:07.000Z",
  "category": "global",
  "raw_subcategory": null,
  "subcategory": null,
  "additional_info": "Я думаю многие раньше использовали настройку chrome://flags \"Disable DirectWrite\" в Chrome'подобных браузерах, но в новых версиях её нет, а без неё при отключённом ClearType и сглаживании неровностей экранных шрифтов (кто боролся с ClearType-ом, тот знает зачем это всё нужно) обычные шрифты на страничках очень часто выглядят кривыми и неравномерными. За основу этого стиля была взята идея из браузера FireFox, с возможностью заменять шрифты используемые на страницах, шрифтами которые использует сам браузер, и выдрав кусок стиля созданного для \"Вконтакте\"(VK.com) был создан этот миниатюрный стиль использующий заранее оговоренный набор шрифтов который действует глобально на шрифты использующиеся на всех открытых страницах.\r\n  Есть несколько шрифтов которые этот стиль исправить не способен и наблюдаются искажения позиционирования элементов, но даже в таком виде результат весьма неплох, если конечно вы готовы смириться с тем что теперь у вас везде будут одинаковые шрифты. :)",
  "style_tags": [],
  "css": "/*шрифты без сглаживания*/\r\n\r\nbody {    \r\nfont-family: tahoma, arial, verdana, sans-serif, Lucida Sans, Consolas, Courier New, Segoe UI, Trebuchet MS, Roboto !important;\r\n}\r\n",
  "discussions": [],
  "discussionsCount": 0,
  "commentsCount": 0,
  "userjs_url": "/styles/userjs/135767/no-cleartype.user.js",
  "style_settings": []
}