{"id":14640,"name":"Gmail / Google Apps Login - Minimized Design","category":"site","raw_subcategory":"google","subcategory":"google","style_tags":[],"description":"This is an edited version of ( Gmail logon - minimized ) at ( http://userstyles.org/styles/172 ) except this version works for Google Apps login pages.\r\n\r\nThis is my first attempt at a userstyle, so if it does not work for you... I'm very very sorry!!! (really) I built this because I hate looking at all the text on the log in page EVERY FREAKING time I log into the website (which is about a bazillion times a week). Sad shame Google cannot make us have our own custom log in page without having to hack up their own website just to have a clean website. Like I really want everybody in my company to have to look at all that crap text every time they want to log in too. Sigh, come on Google.\r\n\r\nAnyway, please post a comment if this does not work for you, or if you have any suggestions/fixes. I am not exactly a CSS master - or even close. Took me about an hour to hack this together LOL. I will try my best to fix anything that does not work for you... but no promises.\r\n\r\n**** Update: 2/8/2009 8:00 PM *****\r\n\r\nI just discovered that this will cause the Google Dashboard to go crazy. I am trying to figure out how to exclude the /cpanel/ within the url-prefix. As soon as I figure that out I will update this script so it does not cause the Dashboard to have issues.","user":{"id":19594,"name":"yokhannan","email":"redacted","paypal_email":null,"homepage":null,"about":null,"license":null},"admin_delete_reason_id":null,"updated":"2009-02-08T06:18:13.000Z","weekly_install_count":0,"total_install_count":700,"rating":null,"screenshot_url":"https://userstyles.org/style_screenshots/14640_after.png?r=1588406924","url":"/styles/14640/gmail-google-apps-login-minimized-design","discussionsCount":0,"commentsCount":0,"css":"@namespace url(http://www.w3.org/1999/xhtml);\r\n\r\n@-moz-document url-prefix(\"https://www.google.com/a/\")\r\n{\r\n       body br, p, li, h1, h2, td[class=\"header\"], img, table[class=\"f\"]\r\n\t{ \r\n\t\tdisplay: none !important;\r\n\t}\r\n\ttable[width=\"100%\"]\r\n\t{\r\n\t\twidth: 60% !important;\r\n\t}\r\n\ttd[class=\"smallfont\"]\r\n\t{\r\n\tdisplay: none !important;\r\n\t}\r\n\t/* remove this to show the \"i cannot access my account\" link */\r\n\ttr[id=\"ga-fprow\"]\r\n\t{\r\n\tdisplay: none !important;\r\n\t}\r\n}"}