{
  "id": 148842,
  "name": "End Habitica Task Columns at Last Item",
  "description": "Don't like how far the shorter task columns extend downward when one of your task columns is longer than the others? This changes the behavior so it cuts off right after the last item in the list. No more empty dark grey box just because you have more of one task type than another! (Previously Unscroll Habitica Task List.)",
  "user": {
    "id": 462168,
    "name": "citrusella",
    "email": "redacted",
    "paypal_email": null,
    "homepage": null,
    "about": null,
    "license": null
  },
  "updated": "2017-11-03T08:27:25.000Z",
  "weekly_install_count": 0,
  "total_install_count": 552,
  "rating": null,
  "after_screenshot_name": "https://userstyles.org/style_screenshots/148842_after.png?r=1617523619",
  "obsoleting_style_id": null,
  "obsoleting_style_name": null,
  "obsolete": 0,
  "admin_delete_reason_id": null,
  "obsoletion_message": null,
  "screenshots": null,
  "license": "publicdomain",
  "created": "2017-09-29T05:11:41.000Z",
  "category": "site",
  "raw_subcategory": "habitica",
  "subcategory": "habitica",
  "additional_info": "2017/11/03 - Recent changes to the task columns necessitated my removing one of the main parts that \"unscrolled\" the task list back before this style's original purpose was annulled by site updates. It was a fast fix to get back editing/deleting and the (re)new push to top/bottom, but since it removed that bit, it was even more inappropriate to call it \"Unscroll Habitica Task List\"... so it's not called that anymore. I might get a more up-to-date screenshot later, but the old one still does the job, so it might wait until after I'm not so real-life busy.\r\n\r\n----\r\n\r\n2017/09/30 - This extension's functionality has been incorporated into Habitica proper, but this extension might still be useful if you prefer the slight changes it still makes to the task list:\r\n\r\n<ul>\r\n<li>By default Habitica's columns all extend all the way to the footer, but this style truncates the columns to end at their last item.</li>\r\n<li>There's ever so slightly more padding between the bottom of the longest column and the footer</li>\r\n</ul>\r\n\r\n----\r\n\r\nThanks to Monthis for the solution to a scroll problem that was plaguing the attempts to get it working! That's actually the basis of this style, though I added a few stylistic things (like a pad to the bottom before the footer and a minimum height to the columns, to allow the \"help\" text in the columns to be read if the column is empty).\r\n\r\nThis style is pretty bare bones. It does what it says and little else.",
  "style_tags": [],
  "css": "@-moz-document domain(\"habitica.com\") {\r\n    .tasks-column, .tasks-list {\r\n        height: auto !important;\r\n        min-height: 200px;\r\n        padding-bottom: 4em;\r\n  }\r\n}",
  "discussions": [
    {
      "id": 60026,
      "name": "Works great!",
      "rating": 0,
      "created": "2017-09-29T10:29:11.000Z",
      "author_name": "Alexander Zakharov",
      "author_id": 517925
    },
    {
      "id": 60037,
      "name": "Thanks so much for this. Makes Habitica usable for my needs again.",
      "rating": 0,
      "created": "2017-09-29T17:20:01.000Z",
      "author_name": "Jason Grimes",
      "author_id": 518165
    }
  ],
  "discussionsCount": 2,
  "commentsCount": 0,
  "userjs_url": "/styles/userjs/148842/end-habitica-task-columns-at-last-item.user.js",
  "style_settings": []
}