{"id":164215,"name":"IRCCloud web panel [Vivaldi]","description":"A style for Vivaldi which is intended for use with irccloud.com as a web panel.","user":{"id":15989,"name":"there.is.only.xul","email":"bluufoxx@gmail.com","paypal_email":null,"homepage":null,"about":null,"license":null},"updated":"2018-09-21T05:20:22.000Z","weekly_install_count":0,"total_install_count":211,"rating":null,"after_screenshot_name":"https://userstyles.org/style_screenshots/164215_after.png?r=1685692814","obsoleting_style_id":null,"obsoleting_style_name":null,"obsolete":0,"admin_delete_reason_id":null,"obsoletion_message":null,"screenshots":null,"license":"publicdomain","created":"2018-09-17T08:19:36.000Z","category":"site","raw_subcategory":"vivaldi","subcategory":"vivaldi","additional_info":"This will make it so IRCCloud.com is more friendly in a web panel. The changes which allow for this as follows;\r\n\u003cul\u003e\u003cli\u003e\u003ccode\u003ebody\u003c/code\u003e has its horizontal overflow hidden to prevent the appearance of a scrollbar at the bottom of the page.\u003c/li\u003e\r\n\u003cli\u003e\u003ccode\u003e#container\u003c/code\u003e has its minimum width set to zero as to make the page more flexible.\u003c/li\u003e\r\n\u003cli\u003e\u003ccode\u003e#sidebarwrapper\u003c/code\u003e by default is set to show the first six pixels of the sidebar. When hovered it moves entirely into view. This would cause a scrollbar to be shown along the bottom if not for the previously-mentioned changes.\u003c/li\u003e\r\n\u003cli\u003e\u003ccode\u003e#maincontainer\u003c/code\u003e, \u003ccode\u003e#sidebarcontainer\u003c/code\u003e and \u003ccode\u003e#accountMenu\u003c/code\u003e have a specified z-index to influence how they appear in the Z-stack, which makes certain elements hide correctly when overlapped.\u003c/li\u003e\r\n\u003cli\u003eAdded left side support (via \u003ccode\u003eBODY.app.left\u003c/code\u003e) for people into that sort of thing.\u003c/li\u003e\r\n\u003cli\u003e\u003ccode\u003e#sidebar\u003c/code\u003e tab indicators are shown when the sidebar is collapsed.\u003c/li\u003e\r\n\u003cli\u003eSidebar tab indicators with badges also show in the collapsed sidebar as badge red.\u003c/li\u003e\u003c/ul\u003e\r\nEven if you are not using this for a web panel, as Vivaldi is the only modern, up-to-date browser with tiled tabs \u003ci\u003eI know of\u003c/i\u003e this style makes it very easy to monitor multiple chats at once via tab tiling. If you are sticking it out with Firefox version 56 or ESR 52 you can still use the Tile Tabs add-on for a similar effect, though you might only be limited to the right side because I did not code this for Gecko in mind (sorry legacy Fx users!).\r\n\r\nUse of the Vivaldi domain in the code is only to make this easier to find by browsing themes for the Vivaldi landing page. This block also provides tons more useful information so take a read through that.\r\n\r\nIf you encounter any problems, Discord is the \u003ci\u003ebest\u003c/i\u003e place to find me. I use their service as Heebeejeebees, \u003ca href=\"https://discord.me/page/vivaldi\"\u003eJoin us here\u003c/a\u003e and leave your query in #off-topic.\r\n\r\n\u003ci\u003eUpdate 09/17/18.1\u003c/i\u003e Removed nickname in \u003ccode\u003e.bufferinputcell\u003c/code\u003e because it's not necessary and gets in the way. If you want to change your nickname, do it the olde-fashioned way by sending a \u003ccode\u003e/nick\u003c/code\u003e command.\r\n\r\n\u003ci\u003eUpdate 09/18/18\u003c/i\u003e Added some extra padding to topic and main wrapper so the scrollbar along the chat log shows and the buttons alongside the header appear correct compared to default appearance. Because of this I included additional information about design considerations when producing new themes for the website.\r\n\r\n\u003ci\u003eUpdate 09/18/18.1\u003c/i\u003e Description changes.\r\n\r\n\u003ci\u003eUpdate 09/19/18\u003c/i\u003e Chat optimizations and removal of timestamps. \u003cb\u003eNote: \u003c/b\u003e timestamps use transparent text, they are not removed entirely.\r\n\r\n\u003ci\u003eUpdate 09/19/18.1\u003c/i\u003e Actually adding chat optimizations this time.\r\n\r\n\u003ci\u003eUpdate 09/19/18.2\u003c/i\u003e Date box fixes to auto-resize rather than being of fixed size, appended 09/19/18 update information.\r\n\r\n\u003ci\u003eUpdate 09/21/18\u003c/i\u003e \"The lefty update\": \u003cb\u003eA lot\u003c/b\u003e more code is dedicated to using different values for left and right orientations, which makes this a more complete and universal style depending on preferred orientation. Because of how extensive these changes are the initial description has been modified with the basics. In detail:\r\n\u003cul\u003e\u003cli\u003eMain wrapper accommodations for the sidebar has been simplified because I was stupid the first time I changed it.\u003c/li\u003e\r\n\u003cli\u003eUsed transforms to flip the left sidebar so the \"Indicators\" can show when collapsed\u003c/li\u003e\r\n\u003cli\u003eIntegrated theming for the sidebar box shadow which would otherwise be there because \u003ci\u003esomehow\u003c/i\u003e transforms screw with that.\u003c/li\u003e\r\n\u003cli\u003eActive badge unread messages have a shiny red nose so you don't miss them (happy holidays).\u003c/li\u003e\r\n\u003cli\u003eCountless other little changes I can't bother recalling\u003c/li\u003e\u003c/ul\u003e\r\nNeedless to say \u003ci\u003e\u003cb\u003e\u003cu\u003eit's big\u003c/u\u003e\u003c/b\u003e\u003c/i\u003e so you really should update if you haven't already.","style_tags":[],"css":"@-moz-document domain(\"vivaldi.com\") {\r\n/* IRCCloud style for use in Vivaldi while browsing page as a web panel.\r\n   CC0 Heebeejeebees / Hebgbs / there.is.only.xul 2018\r\n*/\r\n/* This block only exists for site theme search, when browsing for Vivaldi themes.\r\n   Visit this address for more: https://userstyles.org/styles/browse/vivaldi\r\n*/\r\n/* Style information:\r\n   ==================\r\n   I. MINIMUM SIZE\r\n   IRCCloud as a web panel looks best at 480px wide. Though, it can be smaller there\r\n   are some elements which look weird in a smaller box, especially on Wednesdays.\r\n\r\n   II. UPDATES\r\n   Unless there are other design considerations I should be aware of, this should be\r\n   the last revision of my style with the present CSS file. If things change, either\r\n   this style will no longer be necessary or be updated to work with new CSS.\r\n\r\n   III. GENERAL THEMING\r\n   This style takes the easy way out with content inside #mainwrapper by making it use\r\n   padding which may present an \"ugly\" gap along the right side regardless of sidebar\r\n   appearance. Because of this. consider using like colours for a custom theme or\r\n   avoiding use of alpha transparency in the sidebar.\r\n\r\n   As interactions with the sidebar are severely limited under normal use, there is no\r\n   reason whatsoever why it should show text from underneath it, though if you don't care\r\n   about the gap along the right side then do what feels right.\r\n\r\n   IV. ADDITIONAL THEMING\r\n   Where appllicable, theme-specific code exists to compensate for changes in the code\r\n   to make certain items appear in a certain orientation. Because of this, you may need\r\n   to purpose !important flags to override changes in a custom theme, or be more specific\r\n   with what classes to affect. Bear this in mind while styling to appear a certain way.\r\n\r\n   V. SIDEBAR AT LEFT\r\n   Because I wanted the highlights along each tab to appear at the left side, the element\r\n   and related elements have been transformed along the Y axis to literally flip it over.\r\n\r\n   Because of this, custom themes might look a bit funny without some tweaking. I also\r\n   could had left well enough alone but I could not help myself; the extra work is well\r\n   worth it to see the indicators light up so you don't miss a message.\r\n\r\n   Due to this, however the scrollbar is along the left side, which is a foreign design\r\n   compared to most web pages but what I felt was a necessary evil considering the result.\r\n   Unfortunately this meand the theme is webkit-only, but that's fine; a majority of web\r\n   browsers you'd bother installing Stylus in use webkit regardless.\r\n   \r\n   VI. TIMESTAMPS\r\n   While timestamps have been modified to not appear, they still exist and companion\r\n   styles can be made to go along with them. Below is an example of a companion style\r\n   which can be used to make them appear and look rather nice when revealed on hover:\r\n   https://userstyles.org/styles/164277\r\n   \r\n   While it is only an example, it can be used as-is or modified to make it look\r\n   however you wish. Have fun with it!\r\n*/\r\n}\r\n\r\n@-moz-document domain(\"www.irccloud.com\") {\r\n/* Hide bottom scrollbar for page body\r\n   (This normally doesn't generate under intended use) */\r\nBODY,\r\nBODY.app.left #sidebarwrapper #sidebar{\r\n    overflow-x: hidden !Important;\r\n}\r\n/* Liberate date box to stretch in tight spaces */\r\ndiv.dateWrapper.dateChange {\r\n    height: auto !important;\r\n}\r\n/* Liberate min-width for use in web panel */\r\nDIV#container {\r\n    min-width: 0%;\r\n}\r\n/* Liberate sidebar from main interface and animate it */\r\n#sidebarwrapper {\r\n    position: absolute;\r\n    top: 0px;\r\n    /* Default state */\r\n    transition: ease-out .20s;\r\n}\r\n#sidebarwrapper:hover {\r\n    /* Hover state */\r\n    transition: ease-in .20s;\r\n}\r\n/* Reposition sidebar to hide it */\r\nBODY.app.left #sidebarwrapper { /* Left */\r\n    left: -195px;\r\n}\r\nBODY.app.left #sidebarwrapper:hover {\r\n    left: 0px;\r\n}\r\nBODY.app:not(.left) #sidebarwrapper { /* Right */\r\n    left: calc(100% - 6px);\r\n}\r\nBODY.app:not(.left) #sidebarwrapper:hover {\r\n    left: calc(100% - 201px);\r\n}\r\n/* Additional changes for left sidebar */\r\nBODY.app.left #sidebarwrapper #sidebar,\r\nBODY.app.left #sidebarwrapper #limits,\r\nBODY.app.left #sidebarwrapper SPAN.buffer,\r\nBODY.app.left #sidebarwrapper BUTTON{\r\n    transform: scaleX(-1);\r\n}\r\nBODY.app.left #sidebarwrapper SPAN.buffer {\r\n    border-left-width: 0px;\r\n    border-right-width: 5px;\r\n    border-radius: 4px 0 0 4px;\r\n}\r\nBODY.app.left #sidebar .addNetworkButtonContainer{\r\n    width: 116px;\r\n    position: relative;\r\n    left: 59px;\r\n}\r\nBODY.app.left #sidebar LI.activeBadge SPAN.buffer { /* So you don't miss it! */\r\n    border-color: #ff1f1a;\r\n}\r\n/* Theming for left sidebar */\r\nBODY.app.left.theme-dawn #sidebarwrapper {\r\n    box-shadow: #b3cfff -5px 0px 0px 0px inset;\r\n}\r\nBODY.app.left.theme-dusk #sidebarwrapper {\r\n    box-shadow: #17334f -5px 0px 0px 0px inset;\r\n}\r\nBODY.app.left.theme-tropic #sidebarwrapper {\r\n    box-shadow: #174f4f -5px 0px 0px 0px inset;\r\n}\r\nBODY.app.left.theme-emerald #sidebarwrapper {\r\n    box-shadow: #204f17 -5px 0px 0px 0px inset;\r\n}\r\nBODY.app.left.theme-sand #sidebarwrapper {\r\n    box-shadow: #4f4117 -5px 0px 0px 0px inset;\r\n}\r\nBODY.app.left.theme-rust #sidebarwrapper {\r\n    box-shadow: #4f1717 -5px 0px 0px 0px inset;\r\n}\r\nBODY.app.left.theme-orchid #sidebarwrapper {\r\n    box-shadow: #4f1742 -5px 0px 0px 0px inset;\r\n}\r\nBODY.app.left.theme-ash #sidebarwrapper,\r\nBODY.app.left.theme-midnight #sidebarwrapper{\r\n    box-shadow: #333 -5px 0px 0px 0px inset;\r\n}\r\n/* Adjust elements to show alongside exposed sidebar */\r\nBODY.app.left #mainwrapper {\r\n    padding-left: 6px;\r\n}\r\nBODY.app:not(.left) #mainwrapper{\r\n    padding-right: 6px;\r\n}\r\n/* Hidden timestamps */\r\n#buffersContainer DIV.time-right .row.messageRow .date {\r\n    opacity: 0;\r\n}\r\n/* Layer stacking stuff */\r\n#mainwrapper {\r\n    z-index: 0;\r\n}\r\n#sidebarwrapper,\r\n#accountMenu {\r\n    z-index: 1;\r\n}\r\n/* Chat optimizations */\r\n.nickinputcell \u003e div {\r\n    width: calc(100% - 25px);\r\n}\r\n.row.messageRow {\r\n    padding-right: 5px !important;\r\n}\r\n/* Removed unnecessary stuff */\r\n.bufferinputcell .nickcell SPAN[role=button] /* Use /nick command for rename instead! */,\r\n#timeContainer, /* Time stuff */\r\n.timecell{\r\n    display: none !important;\r\n}\r\n}","discussions":[],"discussionsCount":0,"commentsCount":0,"isPremium":false,"userjs_url":"/styles/userjs/164215/irccloud-web-panel-vivaldi.user.js","style_settings":[]}