{"result":{"id":164869,"name":"Dark BBC","description":"A dark theme designed for the BBC.\r\n\r\nCurrent Version: 5.6\r\n\r\nChrome Extension: \r\nhttps://chrome.google.com/webstore/detail/bbc-dark/bdifipamjgmfefcpemmlppcmcdjndhig?hl=en","category":"site","url":"/styles/164869/dark-bbc","created":"2018-10-12T09:14:48.000Z","updated":"2023-10-04T16:46:32.000Z","rating":0,"screenshotUrl":"https://userstyles.org/style_screenshots/164869_after.jpeg?r=1698307292","user":{"name":"Deco","paypalEmail":"","id":734135,"photoUrl":"https://lh3.googleusercontent.com/a-/AFdZucrO5BsuI6ItUMvljw0vwrnePuIrLgYtxfv1V9uaIAY=s96-c"},"subcategory":"bbc","isPremium":false,"weeklyInstallsCount":3,"totalInstallsCount":1549,"md5":"720ad1df9eb529f1b1047f82edf4aab7","notes":"Changelog URL: https://github.com/Recol/BBC-Dark/blob/master/README.md\r\n\r\nV5.6 - 2023 Q3 Update\r\n\r\nBBC News:\r\nFixes to the global navigation bar appearing white.\r\nFixes to the global navigation text appearing black.\r\nUpdates to the promotion banners on articles to return them to a dark state.\r\nText clarity improvements between dark and gray.\r\nFixes to topic article buttons not being dark.\r\n\r\nBBC homepage:\r\nImprovements to the BBC homepage promotion articles not appearing dark.\r\n\r\nBBC Sports:\r\nMinor fix for body text being too dark.\r\n\r\nV5.5  - 2023 Fix Everything Update\r\n\r\nFixes to promotional badges on the main page appearing white.\r\nFixes to article buttons appearing white.\r\nImprovements to live coverage elements appearing white.\r\nDarkened the \"Around the UK\" and \"Sports coverage\" sections on the homepage.\r\nFixed the submenu bar on articles not appearing dark.\r\nFixes to the right sidebar of the top stories not being darkened.\r\nFixes to the \"Related Topics\" buttons not appearing dark.\r\nInclusion of the \"Using the BBC\" page for theming.\r\nCleanup of minor article elements appearing black.\r\nDarkened the share button submenu.\r\nFixes to some secondary navigation bars nto appearing dark.\r\nFixes for the BBC Sports navigation bar appearing slightly out of line.\r\nAdded support for the Boxing section underneath BBC Sports.\r\nSweeps to fix some drawers appearing unreadable for their text.\r\n\r\nV5.1 - 2023 Update\r\n\r\nFixes to the navigation column to theme it dark correctly.\r\nUpdated the menu selector to correctly be dark.\r\nFixes to the top header appearing white.\r\nChanges to icon colours to make them gray.\r\nText fix inconsistencies on the menu selector appearing dark instead of white.\r\nLightened the BBC header links on the top menu bar to appear gray to improve readability.\r\nFixes to the \"Search the BBC\" main background and search box appearing not dark.\r\nPromo links on articles have now been fixed to correctly be dark.\r\nDarkened the notification area.\r\nHyperlink fixes being dark in articles.\r\nRemoval of depreciated BBC subdomains.\r\nFixes to bright white flashes when transitioning between pages.\r\n\r\nV5.0 - Major Code Revisions\r\n\r\nChanged over out of date code which was causing issues with page compatibility.\r\nRefactored and fixed support for the main BBC homepage.\r\nFixed articles not appearing dark within BBC News.\r\nFixed toolbar conflicts between various BBC pages.\r\nImplemented support for BBC Food articles.\r\nFixed live coverage having the media player disappear at the top of the article.\r\nImplemented support for BBC Sounds (request by Alex Martini).\r\nFixed hyperlinks not being readable within articles.\r\nRemoved conflicting legacy code to allow promo images to correctly display their images.\r\nImplemented support for BBC Sports pages.\r\nFixes to padding issues causing lines to conflict with header titles.\r\nLightened and fixed article headers not being readable.\r\nFixed support for the BBC IPlayer bottom section not being dark.\r\nFixed promo images on the BBC homepage not being dark.\r\nFixed submenu issues with links appearing white when they are hovered over.\r\nFixed further compatibility with the BBC migrating to the SRCSS scheme.\r\nFixed containers not appearing dark when they should.\r\nSome minor code removals where no longer necessary.\r\n\r\nV4.1\r\n\r\nPatched in support for allowing the BBC homepage to be correctly dark again.\r\nImplemented missing elements that were ported over for articles not appearing dark.\r\nLightened text on the homepage to increase legibility.\r\nFixed incorrect banner element assignments causing text to appear strange.\r\nPatched in some other arbitrary missing elements pertaining to bottom columns to allow them to be dark again.","license":"ccbyncsa","obsolete":false,"exampleUrl":"https://www.bbc.co.uk","afterScreenshotName":"164869_after.jpeg","tags":[]}}