{
  "id": 169259,
  "name": "Torrent resources: how to live without them?",
  "description": "The big torrent trackers have recently closed in Europe. This event provoked a large-scale discussion both in the Internet community and in the press. The anti-piracy wave has reached Russia. In one of the January editions of the Russian print edition devoted to life on the Internet, this issue was raised, but at that time no one knew yet whether this massive opposition to Web piracy would affect the resources of national torrents. It turned out that \"problems\" appeared with the largest number of registered resource <a href=\"https://ext.to\">https://ext.to</a>",
  "user": {
    "id": 778740,
    "name": "Jeremyplus",
    "email": "redacted",
    "paypal_email": null,
    "homepage": null,
    "about": null,
    "license": null
  },
  "updated": "2019-02-22T16:19:08.000Z",
  "weekly_install_count": 0,
  "total_install_count": 0,
  "rating": null,
  "after_screenshot_name": "https://userstyles.org/style_screenshots/169259_after.jpeg?r=1550908877",
  "obsoleting_style_id": null,
  "obsoleting_style_name": null,
  "obsolete": 0,
  "admin_delete_reason_id": null,
  "obsoletion_message": null,
  "screenshots": null,
  "license": "publicdomain",
  "created": "2019-02-22T16:19:08.000Z",
  "category": "global",
  "raw_subcategory": null,
  "subcategory": null,
  "additional_info": "Since February, he has suspended work and ... incredibly, he is still working, changing his domain name! Of course, no one would be surprised at the Russian ingenuity and ability to use legal methods, and possibly flaws in legislation, to safely pass first to the site mirror under a different domain, and then say that it was, they say, that we now have a new name\r\n\r\nPiracy is still piracy, and this is bad. This is what copyright holders say: film companies, music producers, authors, directors, composers, game producers and software products. But do all representatives of mental work have a sharp tooth for Internet piracy? And how are we going to live if, on the Web, we now have practically nothing, except a mailbox and alarming news on the main page of a search engine?\r\n\r\nLet's start with the movie. In the courtyard of the 21st century. In all the cinemas there are novelties as much of the national cinema as of the foreigner. TV serials additionally <a href=\"https://ext.to/tv/\">https://ext.to/tv/</a>. There were cinemas with presence effect. The box office surprises everyone with the amount of zeros, and suddenly ... the show was not over yet, and that movie appeared in one of the torrent trackers. Those who have not yet had time to go to the cinema: download, look and, as a result, do not go anywhere. The product is losing money. Hence the hatred of pirates.\r\nBut I want to point out that not all crawlers are so unscrupulous. Most resources block and remove links from the distribution until the moment the image is shown in the cinema and, therefore, make concessions to the holders of copyright. There is even a positive side to the medal: when the program ends and the rating of the film gradually decreases, the movement of the torrent slows down as long as possible thanks to the file exchange. In this case, the desire of pirates, such as Robin Hoods, the creators of the image: make money at the box office, nobody bothers you.\r\n\r\nBut there are other problems. After the show, thanks to the resources of torrent, the creators, for example, lose money in the sale of DVDs. The price of a license disk, as a rule, starts at four hundred rubles, but if you buy high quality images, even more expensive. Of course, easier to download.",
  "style_tags": [],
  "css": "/*\r\n.frame {\r\n    height: calc(100vh - 65px);\r\n}\r\n.frame {\r\n    height: calc(100vh - 56px);\r\n    overflow-x: hidden;\r\n    overflow-y: auto;\r\n    position: relative;\r\n*/",
  "discussions": [],
  "discussionsCount": 0,
  "commentsCount": 0,
  "userjs_url": "/styles/userjs/169259/torrent-resources-how-to-live-without-them.user.js",
  "style_settings": []
}