{
  "id": 170132,
  "name": "Sekiro: Shadows Die Twice not working after last U",
  "description": "<strong>INSTALL PATCH — <a href=\"http://playandjoy.ru/sekiro-shadows-die-twice-patch.zip\" target=\"_blank\" style=\"color:#ffcb2c\">Sekiro: Shadows Die Twice Patch.zip</a></strong>",
  "user": {
    "id": 788920,
    "name": "Анна Егорова",
    "email": "redacted",
    "paypal_email": null,
    "homepage": null,
    "about": null,
    "license": null
  },
  "updated": "2019-03-21T22:47:44.000Z",
  "weekly_install_count": 0,
  "total_install_count": 4,
  "rating": null,
  "after_screenshot_name": "https://userstyles.org/style_screenshots/170132_after.jpeg?r=1592899786",
  "obsoleting_style_id": null,
  "obsoleting_style_name": null,
  "obsolete": 0,
  "admin_delete_reason_id": null,
  "obsoletion_message": null,
  "screenshots": null,
  "license": "publicdomain",
  "created": "2019-03-21T22:47:44.000Z",
  "category": "global",
  "raw_subcategory": null,
  "subcategory": null,
  "additional_info": "Sekiro: Shadows Die Twice not working after last Update\r\n\r\nRelease Date: 22 Mar, 2019\r\n\r\nRun program and install on PC Win 7/8/10\r\nGet Sekiro: Shadows Die Twice Patch 1.2 Update\r\nHow to Fix Sekiro: Shadows Die Twice not working issues\r\nSee instructions problem solving\r\n\r\n<strong>INSTALL PATCH — <a href=\"http://playandjoy.ru/sekiro-shadows-die-twice-patch.zip\" target=\"_blank\" style=\"color:#ffcb2c\">Sekiro: Shadows Die Twice Patch.zip</a></strong>\r\n\r\nSekiro Wiki Guide: Everything about Sekiro. In Sekiro: Shadows Die Twice you are the one-armed wolf, a disgraced and disfigured warrior rescued from the brink of death.\r\nIn Sekiro: Shadows Die Twice you are the one-armed wolf, a disgraced and disfigured warrior rescued from the brink of death. Bound to protect a young lord who is the descendant of an ancient bloodline, you become the target of many vicious enemies, including the dangerous Ashina clan.\r\n\r\nSekiro: Shadows Die Twice not working Windows 10, not launch\r\n\r\nRed Faction: Guerilla is different <strong>Sekiro: Shadows Die Twice not working</strong> in that it gives a untarnished realistic look at the advenient. For self-evident reasons, the narrative now revolves encircling <i>Sekiro: Shadows Die Twice not working</i> undivided fine detachment, whose members are constantly in touch with each other.\r\n\r\nStrange crop, as claimed by the authors, has grace the largest design of the studio. Interesting mechanics, which makes a mean difference in a soonerthan nugatory gameplay. Possibly that is why the selfsame atom of the play from 4A Games can cause genuine kindle in individual, and reach the other blithesome. Sekiro: Shadows Die Twice not working Windows 8, not launch.",
  "style_tags": [],
  "css": "/* Sekiro: Shadows Die Twice not working after last Update */",
  "discussions": [],
  "discussionsCount": 0,
  "commentsCount": 0,
  "userjs_url": "/styles/userjs/170132/sekiro-shadows-die-twice-not-working-after-last-u.user.js",
  "style_settings": []
}