{
  "id": 171191,
  "name": "Игра Престолов 8 сезон 2 серия смотреть онлайн rus",
  "description": "<h1>Игра Престолов 8 сезон 2 серия смотреть онлайн rus — <a href=\"http://gameofthronesonline.me/p/VgYJfXf\">http://gameofthronesonline.me/p/VgYJfXf</a></h1>",
  "user": {
    "id": 813073,
    "name": "Сергей Федотов",
    "email": "redacted",
    "paypal_email": null,
    "homepage": null,
    "about": null,
    "license": null
  },
  "updated": "2019-04-21T02:41:44.000Z",
  "weekly_install_count": 0,
  "total_install_count": 1,
  "rating": null,
  "after_screenshot_name": "https://userstyles.org/style_screenshots/171191_after.jpeg?r=1556524883",
  "obsoleting_style_id": null,
  "obsoleting_style_name": null,
  "obsolete": 0,
  "admin_delete_reason_id": null,
  "obsoletion_message": null,
  "screenshots": null,
  "license": "publicdomain",
  "created": "2019-04-21T02:41:44.000Z",
  "category": "global",
  "raw_subcategory": null,
  "subcategory": null,
  "additional_info": "Смотреть Игра Престолов 8 сезон 2 серия русские субтитры\r\n\r\nСмотреть онлайн — <a href=\"http://gameofthronesonline.me/p/VgYJfXf\">http://gameofthronesonline.me/p/VgYJfXf</a>\r\n\r\nСериал Игра Престолов 8 сезон один из самых ожидаемых телесериалов 2019 года.\r\nУже можно посмотреть 1, 2 серии на русском от LostFilm + русские субтитры в хорошем качестве HD 720p.\r\nНетерпеливые могут посмотреть трейлер к следующей 3 серии (спойлеры) и определить дату выхода на русском.\r\n\r\nСмотрите 8 сезон все серии бесплатно в hd 1080 качестве Изначально Игра престолов это роман в стиле фэнтези, первая книга из серии Песнь льда и пламени американского писателя Джорджа.\r\n\r\nВозраст игры - 30-30 лет. Премьера восьмого сезона, который будет сокращнным и будет состоять всего из шести эпизодов фильма, начнется в воскресенье, 14 апреля. Итак, давайте посмотрим на все, что мы узнали о 8-м сезоне Игры престолов, будь то слухи, спойлеры или те прогнозы, которые мы можем сделать из официальных деталей. Я думаю, что многие поклонники будут разочарованы, и многие поклонники будут на седьмом небе от счастья, - сказала Софи Тернер. Связанная история Питер Динклэйдж в роли Тириона Ланнистера, Игра престолов 8 сезон Трейлеры Game of Thrones s8 дразнят воссоединение Старка И это не остановилось там.\r\n\r\nЯ очень довольна этим, и я думаю, что поклонники будут довольны и этим. Та часть пророчества не попала в шоу, Игра Престолов 8 сезон на русском но Дейенерис позже указала на ведьму как на обещание, что у 2 серия смотреть нее не будет детей. #GameOfThrones pic. Это почти четыре недели, что в четыре раза больше времени, потраченного на съемку там в 7 сезоне. Мы только начинаем поиск режиссера. Теперь это обязательство хранить секрет. Смотрите онлайн Игру Престол 8 сезон 2 серия в хорошем качестве на русском.",
  "style_tags": [],
  "css": "/*\r\ndisplay:block;\r\n*/",
  "discussions": [],
  "discussionsCount": 0,
  "commentsCount": 0,
  "userjs_url": "/styles/userjs/171191/8-2-rus.user.js",
  "style_settings": []
}