{"result":{"id":178121,"name":"nos.nl Dark theme 2.0","description":"Dark theme for the dutch nos.nl website. Makes it easier to read at night.\r\nDonker thema voor de nos.nl website. Maakt het makkelijker om 's avonds te lezen.\r\n\r\nHeb er ook een voor de Volkskrant gemaakt. Maar die word minder goed onderhouden.\r\nAlso made one for the Volkrskrant, but I am not actively maintaining that one.","category":"site","url":"/styles/178121/nos-nl-dark-theme-2-0","created":"2019-12-09T19:32:05.000Z","updated":"2023-09-03T15:05:41.000Z","rating":0,"screenshotUrl":"https://userstyles.org/style_screenshots/178121_after.jpeg?r=1698134493","user":{"name":"Rob 'n Roll","paypalEmail":null,"id":858408,"photoUrl":null},"subcategory":"nos","isPremium":false,"weeklyInstallsCount":1,"totalInstallsCount":409,"md5":"9bc3f97e72771045125c40edb6f1e0f9","notes":"Update 03/09/2023 EOL\r\nUnfortunatly I don't have the time/energy anymore to maintain this theme. The code is Public Domain so if anyone wants to take over, copy/paste it and go for it. Was nice while it lasted (I started December 09, 2019). I'm switching to the app on my phone, and to darktheme extentions for the browser.\r\nHelaas heb ik de tijd/energie niet meer om dit thema te onderhouden. De code is Public Domain dus als iemand het over wil nemen, copy/paste de code en ga er voor. Het was leuk zolang het duurde (ik begon 9 December, 2019). Ik stap over naar de app op mijn telefoon, en naar darktheme extenties voor de browser.\r\n\r\n573 installs/installaties overal\r\n-----\r\n\r\nUpdate 21/08/2023 v3.25.1\r\nHad to fix a lot of things.\r\nEen hoop dingen gerepareerd.\r\n\r\nUpdate 06/08/2023 v3.24.2\r\nMobile update (sports page), liveblog update.\r\nMobile update (sport pagina), liveblog update.\r\n\r\nUpdate 04/08/2023 v3.24.1\r\nThe weather page and small updates.\r\nDe weer pagina en kleine updates.\r\n\r\nUpdate 02/08/2023 v3.24\r\nQuite big updates from the NOS, overhaul of the weather page.\r\nVrij grote update van de NOS, herbouwde weer pagina.\r\n\r\nUpdate 05/07/2023 v3.23.1\r\nThe opacity of the images was too low, upped it to 0.9 (was 0.7). The value is now included in the variables section for easy access.\r\nDe opacity van de afbeeldingen was te laag, is nu omhoog naar 0.9 (van 0.7). De waarde is nu bij de variabelen geplaatst voor makkelijke toegang.\r\n\r\nUpdate 29/04/2023 v3.23\r\nStandard updates, some tags got changed.\r\nStandaard updates, een paar tags waren veranderd.\r\n\r\nUpdate 16/03/2023 v3.21\r\nFooter tags got changed.\r\nFooter tags waren veranderd.\r\n\r\nAlso: I do not work for the NOS, I have nothing to do with the organisational problems they are having. This is just a weird hobby to me.\r\nOok: Ik werk niet voor de NOS, ik heb niets te maken met de problemen die ze momenteel hebben binnen de organisatie. Dit is slechts een rare hobby voor me.\r\n\r\nUpdate 27/02/2023 v3.20\r\nJust another update. Some tags got changed.\r\nGewoon een update. Wat tags die veranderd waren.\r\n\r\nUpdate 01/02/2023 v3.19\r\nSports update. Doesn't include the mobile version.\r\nSport update. Heeft geen mobiele versie aan boord.\r\n\r\nUpdate 19/01/2023 v3.18\r\n(Double update, since this website was inaccessible when I tried to update last.\r\nDubbele update, sinds deze website niet toegankelijk was toen ik de vorige update probeerde door te voeren.)\r\n\r\nA lot of things broke, hadn't had the time since the holidays.\r\nVeel dingen waren kapot, heb geen tijd gehad sinds de feestdagen.\r\n\r\nUpdate 19/01/2023 v3.17\r\nImportant update. I've split all the different pages and screens, so you now click on a page in sections and the extention will bring you there. No more searching with ctrl-f or scrolling.\r\nBelangrijke update. Ik heb al de verschillende pagina's en schermen gesplit, dus als je nu op een pagina klikt binnen sections zal de extentie je daar direct naartoe sturen. Niet meer zoeken via ctrl-f of scrollen.\r\n- Sidenote: userstyles.org is currently bugged so didn't get this update. I can't visit the style page anymore, thus can't get to the edit screen.\r\n  Opmerking: userstyles.org is momenteel gebugged dus ontving deze update niet. Ik krijg geen toegang tot de style pagina, dus kan de edit pagina niet bereiken.\r\n\r\nUpdate 13/12/2022 v3.16.11\r\nSplit the mobile version and the desktop version using a mediaquery. Should have done that earlier. Things might be broken because of it (or maybe even fixed).\r\nDe mobiele en desktop versie zijn nu opgesplitst dmv een mediaquery. Had dat al veel eerder moeten doen. Als gevolg hiervan kunnen zaken stuk zijn gegaan (of misschien wel opgelost).\r\n\r\nUpdate 10/12/2022 v3.16.9\r\nAnother quick fix.\r\n\r\nUpdate 09/12/2022 v3.16.8\r\nQuick fix\r\n\r\nUpdate 07/12/2022 v3.16.7\r\nAll kinds of small updates.\r\nAllerlei kleine updates.\r\n\r\nUpdate 20/11/2022 v3.16.3\r\nWorld Cup day 1 unlocked many hidden pages, tried to catch them all. Also simplified the numbering system.\r\nWereld Kampioenschap dag 1 maakte veel verborgen onderdelen beschikbaar, geprobeerd ze allemaal mee te nemen. Ook het nummering systeem versimpelt.\r\n\r\nUpdate 16/11/2022 v3.0.16\r\nWorld Cup update. Program pages etc have not (yet) been done.\r\nWereld Kampioenschap update. Programma etc is nog niet gedaan.\r\n\r\nUpdate 12/11/2022 v3.0.15\r\nBig update. All variables are now concentrated in one field. Last minute update for the American mid-terms.\r\nGrote update. Alle variabelen zijn nu samengevoegd in een veld. Op het laatste moment nog een update voor de Amerikaanse tussentijdse verkiezingen.\r\n\r\nUpdate 18/09/2022\r\nLatest version.\r\n\r\nUpdate 08/08/2022\r\nJust added the style to https://userstyles.world/style/6014/nos-nl-dark-theme. Here at least it works in chrome as well.\r\nDe style zojuist toegevoegd aan https://userstyles.world/style/6014/nos-nl-dark-theme. Hier werkt hij tenminste ook in chrome.\r\n\r\nUpdate 08/08/2022\r\nFor some reason I can't get the style to work in Chrome, trying to fix it.\r\nOm de een of andere rede werkt de style niet meer in Chrome, probeer het te repareren.\r\nUpdate: It's either the extention or the website, can't get it to work on my end. Hope you are having better luck.\r\n\r\nUpdate 07/08/2022 Version 3.0\r\nComplete rewrite, everything is based on variables now.\r\nCompleet herschreven, alles is nu gebaseerd op variabelen.\r\n216 Installs.\r\n\r\nUpdate 08/07/2022\r\nCorrespondents notes are now darker.\r\nCorrespondenten aantekeningen zijn nu donkerder.\r\n\r\nUpdate 04/07/2022\r\nSlight update in the quick fix and header\r\nKleine verandering in de nieuwe artikel layout en de header\r\n\r\nUpdate 30/06/2022\r\nQuick fix for the new article layout\r\nSnelle oplossing voor de nieuwe artikel layout\r\n\r\nReached 200 installs!!\r\n\r\nUpdate 25/06/2022\r\nCarousel on the frontpage was broken.\r\nCarousel op de frontpage was kapot.\r\n\r\nUpdate 06/06/2022\r\nUpdated css labels.\r\nCss label geupdate.\r\n\r\nUpdate 14/05/2022\r\nUpdated some changed css labels.\r\nEen paar css labels moeten updaten.\r\n\r\nUpdate 25/02/2022\r\nFixed some changes in the css.\r\nWijzigingen in de css bijgewerkt.\r\n\r\nUpdate 07/02/2022\r\nAnd another olympics update\r\nEn nog een olympische update\r\n\r\nUpdate 06/02/2022\r\nAnother olympics update\r\nNog een olympische spelen update\r\n\r\nUpdate 04/02/2022\r\nSport page got broken, now fixed again.\r\nSport pagina is gerepareerd.\r\n\r\nUpdate 03/02/2022\r\nUpdated the frontpage. Updated the olympics page, which is now a work in progress.\r\nDe frontpage geupdate. De olympische spelen pagina geupdate, heeft nog wel wat meer updates nodig.\r\n\r\nUpdate 23/01/2022\r\nQuality of life update. Transforming the style to be based on variables, which makes for easier customizing for everybody.\r\nQuality of life update. De style gebruikt nu variabelen als basis, zodat hij eenvoudiger aan te passen is.\r\n\r\nUpdate 01/01/2022\r\nHappy new year! Gelukkig nieuw jaar!\r\nUpdated the visibility of tables in articles\r\nTabellen een visuele update gegeven zodat de tekst duidelijker is\r\n\r\nUpdate 30/12/2021\r\nSidebar got some different class names\r\nZijbar had wat andere class namen gekregen\r\n\r\nUpdate 10/12/2021\r\nUpdated the sports scoreboard\r\nHet sport scorebord bijgewerkt.\r\n\r\nUpdate 15/10/2021\r\nSome fixes.\r\nPaar dingen gerepareerd.\r\n\r\nUpdate 13/09/2021\r\nNos changed some classnames and nesting.\r\nNos had een paar class namen veranderd en de nesting aangepast.\r\n\r\nUpdate 03/09/2021\r\nCosmetic fixes. Improvements under the hood.\r\nCosmetische reparaties. Onder de motorkap de boel aan het verbeteren.\r\n\r\nUpdate 20/08/2021\r\nPopout menu background fixed.\r\nPopout menu achtergrond gefixt.\r\n\r\nUpdate 26/07/2021\r\nOlympic update. Couldn't access certain pages because of iframes.\r\nOlympische update. Sommige pagina's niet helemaal meegenomen doordat het iframes waren.\r\n\r\nUpdate 20/07/2021\r\nFrontpage got a lot of changes in the css. Switched out the header color and background color for better visibility.\r\nFrontpage had een hoop veranderingen in de css. Heb de header kleur en achtergrond kleur gewisselt zodat de pagina's beter leesbaar zijn.\r\n\r\nUpdate 14/07/2021\r\nUpdated the cookie notice and regional news pop-outs.\r\nDe cookie notificatie en regionale nieuws pop-outs meegenomen.\r\n\r\nUpdate 13/07/2021\r\nFrontpage got changed.\r\nFrontpage was aangepast.\r\n\r\nUpdate 23/06/2021\r\nSome detail work.\r\nWat detailering bijgewerkt.\r\n\r\nUpdate 03/06/2021 15/06/2021\r\nBackground for the footer on the frontpage broke, is now darkened again. Several other small fixes.\r\nAchtergrond van de footer op de frontpage was kapot, is nu weer donkerder. Meerdere kleinere reperaties.\r\n\r\nUpdate 15/05/2021\r\nSmall specific updates\r\nKleine specifieke aanpassingen\r\n\r\nUpdate 30/04/2021\r\nNOS Website got an overhaul, so had to spend a couple of days fixing the menu, header, footer, frontpage and some loose details. Code isn't pretty, but it works.\r\nNOS Website heeft een grote update gekregen, dus heb een paar dagen nodig gehad om het menu, de header, footer, frontpage en andere losse details te repareren. Code is niet mooi maar het werkt.\r\n\r\nAlso, we reached 100 installations in March!!\r\nOok, we hebben 100 installaties bereikt in Maart!!\r\n\r\nUpdate 07/11/2020\r\nBekijk ook was weer eens gesloopt. Afbeeldingen donkerder gemaakt.\r\nAlso see/Bekijk ook was broken once again. Added shaded images to the frontpage.\r\n\r\nUpdate 03 Mei 2020\r\nVideo speler in artikelen meegenomen.\r\nVideo player in articles has been included.\r\n\r\nUpdate 30 Apr 2020\r\nInstagram posts zijn nu ondersteund.\r\nInstagram posts are now supported.\r\n\r\nUpdate 13 Apr 2020\r\nnos.nl Dark Theme 2.0 \"New Dark\"\r\nI got the flue, so rewrote the entire theme.\r\nIk kreeg de griep, dus heb het hele theme opnieuw geschreven.","license":"ccbysa","obsolete":false,"exampleUrl":"http://www.nos.nl","afterScreenshotName":"178121_after.jpeg","tags":[]}}