{"id":19517,"name":"Fix for Digg Comments Page bouncing effect","category":"site","raw_subcategory":"digg","subcategory":"digg","style_tags":[],"description":"For some users or at least for me, the Digg comment page bounces when you reach the end of the initially viewable space as it tries to expand and then returns to default size and keeps doing it every time you type a character.\r\n\r\nI wrote this script to fix it.  Its very short.  I've been using it for a while and it seems to work with the comment box but if it breaks other functionality let me know.  The problem seems to be caused by diggs attempts to customise the box so when you reply to an earlier post on the page and then use the bottom box, it messes up its sizing and it keeps going back to the default size.\r\n\r\nIts been like this for ages across multiple versions of Firefox so I got annoyed and decided to fix it. \r\n\r\nNote if you remove the width and height it breaks the script, these are required to force the browser to use sizing other than the default which then prevents diggs javascript from kicking in and the browser uses a default textarea instead of the digg one.  You can change the values to whatever you want.  I've made them so they will always be readable at the moment and they work prefectly after using it for a bit.","user":{"id":25955,"name":"brim4brim1","email":"redacted","paypal_email":null,"homepage":null,"about":null,"license":null},"admin_delete_reason_id":null,"updated":"2009-07-14T16:53:02.000Z","weekly_install_count":0,"total_install_count":242,"rating":null,"screenshot_url":"https://userstyles.org/style_screenshots/19517_after.png?r=1587369869","url":"/styles/19517/fix-for-digg-comments-page-bouncing-effect","discussionsCount":0,"commentsCount":0,"css":"@namespace url(http://www.w3.org/1999/xhtml);\r\n\r\n@-moz-document domain(\"digg.com\") {\r\n\r\n\r\ntextarea {\r\ndisplay:inline!important;\r\noverflow-x:auto!important;\r\noverflow-y:scroll!important;\r\nwidth: 600px !important; \r\nheight: 200px ! important;\r\n}\r\n}"}