{"result":{"id":217057,"name":"Google Classroom Dark Mode","description":"Dark Theme for Google Classroom\r\nFor some reason, this site will not allow me to upload my latest code. So, I have created a version of this same style on userstyles.world, only more up to date. I plan to eventually update the code so that it would work on here, but in the meantime, you can check out a much better version of this style by clicking <a href=\"https://userstyles.world/style/7655/google-classroom-dark-mode\" target=\"_blank\">here</a>.","category":"site","url":"/styles/217057/google-classroom-dark-mode","created":"2021-10-22T02:10:42.000Z","updated":"2023-08-09T16:24:17.000Z","rating":4,"screenshotUrl":"https://userstyles.org/style_screenshots/217057_after.jpeg?r=1698307292","user":{"name":"Cole Ruth","paypalEmail":null,"id":1271872,"photoUrl":"https://lh3.googleusercontent.com/a-/AFdZucquvaTISge1LzWFlAK-UJaCFYx2chq2Pi9UA9mEag=s96-c"},"subcategory":"google","isPremium":false,"weeklyInstallsCount":13,"totalInstallsCount":1651,"md5":"c9a3974a28548a1460f8de0684652ba0","notes":"IMPORTANT NOTE--\r\nDue to technical limitations, this style is not being updated on this site any longer. For the full style, please visit https://userstyles.world/style/7655/google-classroom-dark-mode. Thank you.\r\n\r\nv.1.1.2 -\r\nFixed teacher appreciation week banner. This change would theoretically affect any future banners that Google puts up.\r\n\r\nv.1.1.1 -\r\nUpdated the internal ids of the drop-down setting to be clearer. This means that if you previously selected the \"Follow System Theme\" mode, you will need to re-select it before updating the style.\r\nDarkened the loading bar at the top - thanks <a href=\"https://userstyles.org/users/1422668\">Eduardo Werner</a>!\r\n\r\nv.1.1.0 -\r\nAssignments in the classroom page look better on hover and focus\r\nBy default, the page is now dark no matter what, but there is a new option to have the page follow the browser-wide theme setting. Previously it would always follow the browser.\r\nMinor improvements\r\n\r\nv.1.0.5 -\r\nClasses with the black color are displayed as white so they don't blend into the background\r\nAssignments in \"your work\" look better on hover and focus\r\n\r\nv.1.0.4 -\r\nMinor upkeep due to a few changes on Google's end\r\n\r\nv.1.0.3 -\r\nSmall bug fixes\r\n\r\nv.1.0.2 - \r\nRemoved the white border around posts in the stream on hover.\r\n(Update: only for classes with the blue accent color... this is being fixed)\r\n\r\nv.1.0.1 -\r\nA couple of minor bug fixes.\r\n\r\nv.1.0.0 -\r\nI created this by myself. There are still a few bugs with the teacher view, but it is nearly perfect for students.","license":null,"obsolete":false,"exampleUrl":"https://classroom.google.com","afterScreenshotName":"217057_after.jpeg","tags":[]}}