{"result":{"id":245004,"name":"Google Razor Glass - Frosted Glass Blur Effects","description":"Please Enable Dark Mode on YouTube and Google first before using this theme.\r\n\r\nRazor Glass is a UI skin that adds many blur effects, animations, transitions, and modern gradients to many websites:\r\nGoogle\r\nGoogle docs\r\ndocs.unity.com\r\nnexusmods.com\r\nYouTube.com\r\n\r\nMake sure to uninstall and reinstall Razor Glass periodically to see new changes.\r\n\r\nPlease submit bugs to the style form link below. Commenting bugs will result in slower solution times.\r\n\r\n--------------------Please donate to Razor Glass on my Account Profile--------------------\r\nKeywords: Blur Effects, Gradients, Shadows, Animate, Animated, Transition, Dark Mode, Aero Glass, Modern, Custom Background, Homepage Background\r\n\r\nSubmit any requests for website customization or changes to:\r\n\r\nhttps://forms.office.com/r/sAYTdrg8wn","category":"site","url":"/styles/245004/google-razor-glass-frosted-glass-blur-effects","created":"2022-07-13T05:02:10.000Z","updated":"2023-09-03T15:34:44.000Z","rating":4.1,"screenshotUrl":"https://userstyles.org/style_screenshots/245004_after.jpeg?r=1698307292","user":{"name":"Stellan Stafford","paypalEmail":"sungodjelly@gmail.com","id":1981465,"photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GjBzamuKDlo-m5HXRw3dgH-Cg3Sl539-yHYxJE_Ykg=s96-c"},"subcategory":"google","isPremium":false,"weeklyInstallsCount":40,"totalInstallsCount":10293,"md5":"146ca372a562c2fbb615b7ecc5da8bbe","notes":"| Razor Glass is shattering into multiple styles soon - different styles for different websites |\r\n\r\n---Sorry It's been a while since updates have come out - school is getting more time consuming---\r\n\r\n\\\r\n  Working on major YouTube update again\r\n/\r\nGmail search bar issue has been resolved. The search bar works again.\r\nSubmit any suggestions for a Facebook Redesign to the RG Form\r\nYouTube completely redesigned again following UI changes\r\nYouTube Fullscreen issue fixed. Fullscreen videos now appear.\r\nWe are currently working on YouTube's new ambient mode and its integration in razor glass.\r\nYouTube Timeline Transition bug fixed. It no longer jumps from frame to frame with a transition effect.\r\nGoogle RG V2 released! Google has been completely redesigned!","license":"ccbysa","obsolete":false,"exampleUrl":"https://google.com","afterScreenshotName":"245004_after.jpeg","tags":[]}}