{"id":24648,"name":"Zoklet++ Lite v1.3","category":"site","raw_subcategory":"zoklet","subcategory":"zoklet","style_tags":[],"description":"Various enhancements for Zoklet.net. Includes larger images on mouseover username hide.  Will add more features in the future.\r\n\r\nUPDATE(4/13/2010): This version simply removes some of the bugs that were occuring before, such as the disappearing IM icons and invisible images in quotes.  I did this by removing the deprecated feature of removing annoying social networking icons, which are no longer a problem.  I will also be releasing Zoklet++ 2 for Greasemonkey, which will be here very soon with some new features.  Version 1.3 is really just a temporary version for those who are fed up with the bugs in the previous version.\r\n\r\n\r\n\r\nFEATURES:\r\n\r\nPreserve aspect ratios of images\r\n--------------------------------\r\nZoklet, by default, resizes all posted images to 200x200 resolution.  While this sort of function is essential for preventing page-stretching and clutter, it takes extra CPU power for the server to correctly maintain the aspect ratio of the images.  As a result, all images appear in 1:1 aspect ratio.  With Zoklet++, the aspect ratio of images are corrected on the client-side.\r\n\r\nLarger images on mouseover\r\n--------------------------\r\nI always find it painful to click on all of the 150x150 thumbnails one by one in a thread with lots of pictures.  Now you can simply hover your mouse over a thumbnail and it will become enlarged for easier viewing.  Since this is done in CSS, no extra bandwidth or loading time is required since the thumbnail is basically a smaller version of the full image.(because the full image has already been loaded)\r\n\r\nThis is especially useful in forums like Pics Or It Didn't Happen.\r\n\r\nUsername hide\r\n--------------------------\r\nI've already had problems in the past with family and friends finding out my identity on Zoklet by looking to my computer monitor.  This is because your username is present in the upper-right corner of all pages on the Zoklet BBS.  I got fed up with nosy people looking at my screen and having to switch to another tab to prevent them from seeing my name, so I wrote this style sheet to make the username invisible.  That way if someone knows you go on Zoklet, at least they do not know who you are.  This can also be useful for when you take screenshots of pages on Zoklet and you don't want your name on the screenshot.  \r\n\r\nShow visited links in Hot Topics\r\n--------------------------\r\nSometimes I forget which topics I've already visited, and I tend to like to find new topics.  So now with this style sheet, visited topics in the Hot Topics box will now be slightly faded so you know you've already been there.","user":{"id":39943,"name":"Mutant Funk Drink","email":"redacted","paypal_email":null,"homepage":null,"about":null,"license":null},"admin_delete_reason_id":null,"updated":"2010-04-13T12:51:51.000Z","weekly_install_count":0,"total_install_count":225,"rating":null,"screenshot_url":null,"url":"/styles/24648/zoklet-lite-v1-3","discussionsCount":0,"commentsCount":0,"css":"@namespace url(http://www.w3.org/1999/xhtml);\r\n\r\n@-moz-document domain(\"zoklet.net\") {\r\n\r\n/* Saves the aspect ratio while maintaining max height/width */\r\n.postmessage A IMG\r\n{\r\n\twidth: inherit !important;\r\n\theight: inherit !important;\r\n        max-width: 200px !important;\r\n        max-height: 200px !important;\r\n}\r\n\r\n/* Larger images on mouseover */\r\n.postmessage A IMG:hover\r\n{\r\n\twidth: inherit !important;\r\n\theight: inherit !important;\r\n\tborder: 1px solid #000000 !important;\r\n        max-width: 600px !important;\r\n        max-height: 900px !important;\r\n}\r\n.postmessage A IMG\r\n{\r\n\tz-index: 0;\r\n\t/*[disabled]position:relative;*/\r\n}\r\n\r\n/* Hide username from top-right corner */\r\nDIV DIV.page DIV TABLE.tborder TBODY TR TD.alt2 DIV.smallfont STRONG {\r\n     visibility: hidden !important;\r\n}\r\n\r\nDIV DIV.page DIV TABLE TBODY TR TD TABLE.tborder TBODY TR TD.alt2 DIV.smallfont A STRONG {\r\n     visibility: visible !important;\r\n}\r\n\r\n/* Show visited links in Hot Topics */\r\n.alt1 DIV.smallfont A:visited\r\n{\r\n     color: #323232 !important;\r\n}\r\n\r\n.alt2 DIV.smallfont A:visited\r\n{\r\n     color: #323232 !important;\r\n}\r\n\r\n/* Hide distracting icons at the bottom of posts (DEPRECATED) */\r\n/*.tborder TBODY TR TD DIV DIV A IMG*/\r\n/*{*/\r\n/*     visibility: hidden !important;*/\r\n/*}*/\r\n\r\n\r\n}"}