{"id":2523,"name":"Del.icio.us (Delicious) in columns","category":"site","raw_subcategory":"del.icio.us","subcategory":"del.icio.us","style_tags":[],"description":"This style is really more of an exploration of Stylish. I get the impression that perhaps Stylish should simply be integrated with Greasemonkey. One reason, for instance, is that I have to combine this style with a Greasemonkey script in order to even make its primary purpose a useful (splitting Delicious bookmarks into four columns isn't too useful when only showing ten bookmarks.) The Greasemonkey script automatically redirects user pages to display 100 results rather than ten. But maybe this is an exceptional scenario, and doesn't justify merging Greasemonkey and Stylish. In any case, here are some other problems I've had with this little exploration, I'd appreciate any help on them:\r\n\r\nFirst problem: because Delicious infers the meaning of some URLs based on whether or not certain elements of the requested resource match registered usernames, you cannot create a rule to match only user pages on Delicious using the \"Insert > Site Rules\" feature of Stylish.\r\n\r\nIs there a simple solution? \"Insert > Site Rules\" produces a @-moz-document directive in your CSS invoking one of the following functions: domain(), url-prefix(), and url(). None of these seem powerful enough to deduce whether or not the currently viewed Delicious URL is a user page.\r\n\r\nSecond problem: You may notice that by applying this style, you get a Delicious page which is mostly white, using smaller fonts, eliminating the header, footer, and tag cloud, and most obviously, organizing the bookmarks into four columns. Locate the style in Stylish and choose Edit, then click Preview. Notice the change?\r\n\r\nUsing Firefox 1.5.0.1, my style is only fully applied to the page when you click Preview in Stylish's built-in CSS editor. Have I done something wrong here?\r\n\r\nUPDATE: It turns out that clicking the check-mark next to the style in Stylish's \"Manage Styles\" dialog has the same effect as clicking preview. Another problem has also been discovered: When I uncheck the style, the style is NOT disabled. :(","user":{"id":2904,"name":"Donny Viszneki","email":"redacted","paypal_email":"donny.viszneki@gmail.com","homepage":null,"about":null,"license":null},"admin_delete_reason_id":null,"updated":"2007-06-07T03:11:47.000Z","weekly_install_count":0,"total_install_count":370,"rating":null,"screenshot_url":"https://userstyles.org/style_screenshots/2523_after.png?r=1589702632","url":"/styles/2523/del-icio-us-delicious-in-columns","discussionsCount":0,"commentsCount":0,"css":"@-moz-document domain(del.icio.us), domain(del.icio.us) {\r\nbody{ background-color: black; color: silver; }\r\n#main{ padding-right: 0px; margin-right: 0px; }\r\n.posts li{ background-color: black; width:25%; float: left; font-size: 60%; }\r\n.posts a:link, .posts a:visited{ color: yellow; }\r\n.posts .commands, .posts .meta{ display: none; }\r\n.posts .post .notes{ color: gray; }\r\n#sidebar{ display:none } #header{ display:none } #infobar{ display:none } #footer{ display:none }\r\n.pager{ position:fixed; bottom:0; background-color:#222; margin:0; width:100%; }\r\n.pager .grey{ color:#222 }\r\n.pager a:link, .pager a:visited{ color:red }\r\n}"}