{"id":264418,"name":"Spinel wallpaper","description":"Spinel is the main antagonist of Steven Universe: The Movie and a supporting character in Steven Universe Future.\r\nShe was created 6,000 years prior to the events of the movie to comfort the lonely Pink Diamond, who had lost her first Pearl to White Diamond. The two would play in Pink's garden until she was finally given a colony. At this point, Pink outgrew Spinel and abandoned her under the guise of playing a game by having Spinel stand alone for thousands of years while Pink never returned.\r\n\r\nAfter discovering this through Steven's message to the universe, she went to Earth and attempted to destroy all organic life forms on the planet as an act of revenge.\r\n\r\nAfter making amends with Steven and the Crystal Gems, the Diamonds take her back to live with them on Homeworld. Now reformed and free, she is still living with the Diamonds, living a less destructive and aggressive life.","user":{"id":3272946,"name":"sunnyplayz 123","email":"sunnybff109@gmail.com","paypal_email":"","homepage":"","about":"","license":null},"updated":"2023-05-13T23:15:17.000Z","weekly_install_count":0,"total_install_count":3,"rating":null,"after_screenshot_name":"https://userstyles.org/style_screenshots/264418_after.png?r=1686816016","obsoleting_style_id":null,"obsoleting_style_name":null,"obsolete":0,"admin_delete_reason_id":null,"obsoletion_message":null,"screenshots":null,"license":null,"created":"2023-05-13T23:13:30.000Z","category":"global","raw_subcategory":null,"subcategory":null,"additional_info":"Spinel originally had a goofy, fun-loving personality. Acting somewhat naive and oblivious to others, she was to be Pink Diamond's best friend to the point of being clingy and ingenuine to her feelings.\r\n\r\nIn stark contrast, upon being abandoned and later learning that Pink Diamond is gone with Steven taking her place and making new friends, Spinel is bitter and full of resentment towards everything connected with Pink Diamond.\r\n\r\nDue to her abandonment, Spinel is unhinged, prone to spontaneous laughter, and extreme outbursts when reminded even indirectly that Pink Diamond forgot her. This can be seen when her face contorts with fury after Steven asked Pearl who she was.\r\n\r\nDespite her anger and irrationality, Spinel is somewhat trusting, as she is willing to go along with Steven to stop her injector. That is until she sees the rejuvenator and believes he wanted to reset her. Fearful of being betrayed for a second time, Spinel immediately relapses into insanity and decides that she hates Steven, before launching a preemptive attack on him.\r\n\r\nSpinel was fueled by her vendetta and willing to eliminate anyone who gets in her way. This can be seen when she resets Pearl, Garnet, and Amethyst immediately after they just met, as she feels that they got between her and Pink. She may have had every intention of erasing Pink's \"brand new friends\" in a misplaced rage. She displays deeper emotions, like when she shows remorse after Steven saves her, and tearfully asks herself why she wants to hurt him and others. Spinel is also mature enough to understand she will have difficulty creating friendships after what Pink Diamond put her through, but she is willing to start over with the other Diamonds.","style_tags":[],"css":"div {\r\n\tfont-face: \"Arial\" !important;\r\n}\r\n\r\ndiv {\r\n\tfont-face: \"Arial\" !important;\r\n}\r\n\r\ndiv {\r\n\tfont-face: \"Arial\" !important;\r\n}\r\n\r\ndiv {\r\n\tfont-face: \"Arial\" !important;\r\n}\r\n\r\ndiv {\r\n\tfont-face: \"Arial\" !important;\r\n}","discussions":[],"discussionsCount":0,"commentsCount":0,"isPremium":false,"userjs_url":"/styles/userjs/264418/spinel-wallpaper.user.js","style_settings":[]}