{"id":303,"name":"Google Search Results Filter","category":"site","raw_subcategory":"google","subcategory":"google","style_tags":[],"description":"I'm a huge GMail and Google fan!  This, in conjunction with Customize Google Extension, allows you to search the best search engine on the planet - Google - without some of the garbage results put up by advertsers who want to sell you something - now you get just the results.  Please add your own terms within the quotes; below is \"my set.\"  Customize Google removes some of it but leaves \"greyed out\" links - this script removes those for the sites you wish.\r\n\r\nUSBMan has offered an alternative approach which you might try here:\r\nhttp://userstyles.org/styles/2686\r\n\r\nFormer \"href + table\" (which was supplied by Jason Barnabe - thanks np!) didn't work for a while; Webb has now discovered that it works again - so add that line of code below and thanks to Webb for re-discovering it works again!!    What I have here works GREAT for me, along with Customize Google, to remove all traces and there are NO GAPS in the search results - the ads don't show up and the layout is fine.  Feel free to use mine below, Webb's addition (originally written by np) below, or USBMan's new style that does not require individual naming of elements as mine does.  I like specificity.  Again,  these direct link-blockers are meant to work in conjunction with Customize Google.  Formerly this script did it all completely - ","user":{"id":15,"name":"Paulfox","email":"redacted","paypal_email":"paulbrit@gmail.com","homepage":null,"about":null,"license":null},"admin_delete_reason_id":null,"updated":"2007-06-23T08:51:35.000Z","weekly_install_count":0,"total_install_count":2816,"rating":null,"screenshot_url":"https://userstyles.org/auto_style_screenshots/303-after.png?r=1593158859","url":"/styles/303/google-search-results-filter","discussionsCount":1,"commentsCount":1,"css":"/*GOOGLE Search Ver 3.0 Coded by Paulfox Dec 10 2006 Updated News/References June 23 07*/\r\n@-moz-document url-prefix(http://www.google.com/search),url-prefix(http://www.google.com/custom) { \r\na:link[href*=\"amazon.com\"],\r\na:link[href*=\"citysearch.com\"],\r\na:link[href*=\"experts-exchange\"],\r\na:link[href*=\"geeksquad.com\"],\r\na:link[href*=\"match.com\"],\r\na:link[href*=\"myhelpdesk.com\"],\r\na:link[href*=\"oreilly.com.com\"],\r\na:link[href*=\"rentspeed.com\"],\r\na:link[href*=\"socialgrid.com\"],\r\na:link[href*=\"tech24.com\"]\r\n{display:none!important}}"}