{"id":30922,"name":"Ars Technica Ad Removal","category":"site","raw_subcategory":"arstechnica","subcategory":"arstechnica","style_tags":[],"description":"This removes all traces of advertising from Ars Technica (http://arstechnica.com/). This includes the annoying blanks left by more general blockers such as ABP [Adblock Plus]. Ars Technica is a technology site, so its not surprising that they have taken several counter-measures to attempts such as this to block advertising on the site, some of which are outlined below.\r\n\r\n----------\r\n\r\nThere are at least four advertising blocks on Ars. The masthead and small sidebar advertisement, which only shows when the large 100px masthead is in use, the large 90px below navigation and huge 600px sidebar advertisement which only shows when the small masthead is in use. There is also several smaller block advertisements below all normal sidebar elements which usually shows cross-promotional items with other Condé Nest websites. \r\n\r\nThe counter-measures used include the use of noscript tags to show static advertisements to users with whitelist script blockers (ie. NoScript), randomized, session controlled, dynamically generated id attributes to prevent ADP's element blocker from latching on with specific id filters, and junk elements (random, empty tags) in front of advertisements to prevent CSS scripts such as these from using selectors such as the adjacent child selector (+) or the first-child pseudo-class (:first-child) from latching on to the advertisements. \r\n\r\nTo circumvent these measures, I'm bringing in a pretty heavy weapon - the :not selector is a new CSS 3 selector, and it does what is says on the tin. Using this, I'm removing *everything* in the sidebar and the masthead that is not useful. (That would be the article list, the rotating featured article box, the etc. box and jobs.ars box, and the logo for the masthead.) \r\n\r\nThe main reason why I'm doing this only *now* is that Ars just introduced that humongous 600px advertisement which annoys the hell out of me. The ad pushes useful content all the way to the bottom of the screen, and is just inexcusable - this is the single largest ad I've ever seen on a website, excluding full page advertisements. \r\n\r\n---------\r\n\r\n\r\nDisclaimer: The use of this script WILL constitute a violation of the site's User Agreement/Terms of Service, specifically the sections that states \r\n\r\n\"The copying, reproduction, publication, display, rearrangement, redistribution, modification, revision, alteration, cropping, re-sizing, reverse engineering, movement, removal, deletion, or other use or change by you, directly or indirectly, of any such Website Content, including but not limited to the removal or alteration of advertising, is strictly prohibited.\" \r\n\r\nUse at your own risk - Although the author here can tell you that this statement has yet to be formally tested under real-world legal conditions and that it is highly dubious the site would and could track the usage of this script.","user":{"id":29128,"name":"MediumDeviation","email":"redacted","paypal_email":null,"homepage":null,"about":null,"license":"ccby"},"admin_delete_reason_id":null,"updated":"2010-05-24T03:08:20.000Z","weekly_install_count":0,"total_install_count":294,"rating":null,"screenshot_url":"https://userstyles.org/auto_style_screenshots/30922-after.png?r=1567152093","url":"/styles/30922/ars-technica-ad-removal","discussionsCount":0,"commentsCount":0,"css":"@namespace url(http://www.w3.org/1999/xhtml);\r\n\r\n@-moz-document domain(\"arstechnica.com\") {\r\n\r\ndiv[id*=\"bullshit\"]{\r\n    display: none !important;\r\n}\r\n\r\n.premium, .adFrameContainer, #masthead > *:not(#logo) {\r\n    display: none !important;\r\n}\r\n\r\n#page.roadblock #news-bar {\r\n    width: 980px !important;\r\n}\r\n\r\n#sidebar > div:not(#features-slider):not(#etc):not(#jobs-ars):not(#journals-box){\r\n    display: none !important;\r\n}\r\n\r\n}\r\n"}