{"id":35013,"name":"GCal: Fix vertical scrolling bug for Chrome","category":"site","raw_subcategory":"google","subcategory":"google","style_tags":[],"description":"Google Calendar seems to render with a vertical scrollbar and an extra few pixels (about the height of a status bar?) down at the bottom.  This means that when you scroll to the previous month (in Month View, obviously), the month changes and the whole page moves a bit.  This is EXTREMELY annoying, but it appears to be a bug limited to Chrome.  This is seen in ALL views and I've seen it in Windows 7 and Windows XP.  It is also mentioned many times on the various forums out there.\r\n\r\nThe script uses the \"position\" style which is not available in IE as far as I know, but that's OK since the bug does not exist there as far as I could tell.  \r\n\r\nI have no idea how this fix will perform in Firefox...\r\n\r\nThere is already a style on this website disabling the vertical scrollbar (\"GCal: no scrollbar (content window, May2010)\"), but it still allows the page to scroll.  I've simply added a couple of lines to that style.  I fix the position of the page, which causes the calendar to be drawn to the exact height of the browser (stopping the scrolling).  However, the width reverts to some default value and the only occupies the left half-or-so of the browser window, so I make sure the left and right margins are zero.\r\n\r\nThanks to mod_wastrel for writing the original style.  I outright copied that code and added the \"position\", \"left\", and \"right\" styles to it.  \r\n\r\nThis is the first (and probably last) time I write anything in CSS, so please forgive stupid mistakes if I made any.","user":{"id":57948,"name":"p1ayaone","email":"redacted","paypal_email":null,"homepage":null,"about":null,"license":null},"admin_delete_reason_id":null,"updated":"2010-07-28T10:32:02.000Z","weekly_install_count":0,"total_install_count":538,"rating":null,"screenshot_url":null,"url":"/styles/35013/gcal-fix-vertical-scrolling-bug-for-chrome","discussionsCount":1,"commentsCount":1,"css":"@namespace url(http://www.w3.org/1999/xhtml);\r\n\r\n/* \r\n\r\n  GCal: Fix vertical scrolling bug for Chrome\r\n\r\n*/\r\n\r\n@-moz-document url-prefix(\"http://www.google.com/calendar/\"),\r\n\r\n               url-prefix(\"https://www.google.com/calendar/\") {\r\n\r\n\r\n\r\nhtml { \r\noverflow-y: hidden !important; \r\nposition: fixed !important;\r\nleft: 0px !important;\r\nright: 0px !important;\r\n}\r\n\r\n\r\n\r\n}"}