{"id":35971,"name":"Facebook Video Viewer","category":"site","raw_subcategory":"facebook","subcategory":"facebook","style_tags":[],"description":"This is a simple style I decided to keep separate from the cosmetic styles, since it changes more than just the way things looks normally and still has a few hitches.\r\n\r\nI am using 1680x1050 resolution, so it's set for that, really. I made a note on the right of each setting for a smaller ideal setting. Just change each one accordingly and it should work out fine.\r\n\r\nThis allow you to hover over a playing video and it will enlarge for your viewing pleasure :D Once you click to play a video (or any embedded feature for that matter) just hover over it and it will enlarge and position itself near-center. I made it a fixed position so you can scroll the page while still watching.\r\n\r\nThe hitches are:\r\n\r\n1. You cannot take your mouse itself off of the video itself or it will revert to its normal size and restart the video. The resizing causes the restart and I haven't found a way around this yet. You can still scroll the page with your wheel while remaining over the video, if you feel like it.\r\n\r\n2. Related to the one above, when you are finished with the video and remove your mouse from it, the video will go back to how it should be, but it starts playing all over again. I tried adding a visited pseudo to it, to force it to be hidden when you are done, but for some reason it doesn't affect it in any way. Any ideas?\r\n\r\nLet me know what you think about it and if there is something I can do to make it better!","user":{"id":58252,"name":"AlienPoison","email":"redacted","paypal_email":null,"homepage":null,"about":null,"license":null},"admin_delete_reason_id":null,"updated":"2010-08-23T10:22:41.000Z","weekly_install_count":0,"total_install_count":26373,"rating":null,"screenshot_url":"https://userstyles.org/style_screenshots/35971_after.png?r=1590307412","url":"/styles/35971/facebook-video-viewer","discussionsCount":0,"commentsCount":0,"css":"@namespace url(http://www.w3.org/1999/xhtml);\r\n\r\n@-moz-document domain(\"facebook.com\") {\r\n\r\nembed:hover\r\n{\r\nposition:fixed !important;\r\ntop:25px !important; /*120px*/\r\nleft:290px !important; /*450px*/\r\nwidth:1080px !important; /*810px*/\r\nheight:650px !important; /*475*/\r\nz-index: 9001 !important;\r\n}\r\n\r\n}"}