{"id":3782,"name":"Google Maps Max Updated!","category":"site","raw_subcategory":"google","subcategory":"google","style_tags":[],"description":"Update - 4 March, 2010:\r\n\r\nRemoved the bit of code hiding and enlarging the inset map and other parts that don't work anymore.\r\nPretty much it just enlarges the map now.\r\n\r\nBe sure to disable the style long enough to check out and activate the cool new Google Maps features\r\n in Google Labs; such as drag and drop  & smart zoom!\r\n\r\n -End Update\r\n\r\n-----------------------------------------------------------------------------------------------------------\r\n\r\nGreasemonkey Users take note!\r\nI recommend running \"Google Maps Max Updated!\" with Stylish.  Some Greasemonkey users (as seen in a couple of the comments) may need to resize their browser windows after loading Google Maps to eliminate a bit of undesirable white space that initially shows up on the bottom of the page.  Once resized, everything works fine, but this is, admittedly, an annoyance.  This does not occur when using the CSS.  I definitely recommend loading \"Google Maps Max Updated!\" as a style, with the stylish extension.  If you don't have stylish, give it a try, it's awesome!\r\n\r\n*** NOT SO FAST, GOOGLE!! ***\r\nThe sidebar recently widened a bit, so I've just updated the style to move the \"get directions\" dialog further right (to keep it away from the sidebar).  Works great with Firefox 3!\r\n\r\nGoogle also [quite some time ago now] changed the way the maps page is written and this caused the Zoom Control (upper left) to NOT be erased by Google Maps Max Updated! anymore.  No matter, I've found a way to hide the zoom control again and the change can be found in the new code (posted 31 October, 2007) below.  Enjoy!!!\r\n***************************************\r\n\r\nHi!  \r\n\r\nAfter another night of study, I re-wrote last night's  \"Google Maps Max\" http://userstyles.org/styles/3758/ style so that you can now use the Written Directions Sidebar in full screen mode!  I think it looks awesome and is rather clever ... I hope you like it!\r\n\r\nMore pictures hosted here:\r\n\r\nhttp://i32.photobucket.com/albums/d42/CTskydiver/GoogleMapMaxUpdated.jpg\r\nhttp://i32.photobucket.com/albums/d42/CTskydiver/GoogleMapMaxUpdatedClosed.jpg\r\nhttp://i32.photobucket.com/albums/d42/CTskydiver/GoogleMapMaxUpdatedOpen.jpg\r\nhttp://i32.photobucket.com/albums/d42/CTskydiver/GoogleMapsBefore.jpg\r\n\r\nI wanted to combine what I saw and liked on \"Google Maps Full Screen\" and \"Google Maps Minimal\" and \"Google Maps Remove Copyright\" ... basically it shows Google Maps images full screen - no white space!\r\n\r\nAnd since we have the room, we've increased the size of the inset map window four times.\r\n\r\nThis version of \"Google Maps Max\" maintains the Sidebar where the turn-by-turn directions are listed.  It is open by default, but you can close it and view your maps as big as your browser window if you don't need it!\r\n\r\nIn \"Google Maps Max\" I couldn't figure out how to keep the Sidebar without all sorts of wonky things happening (like loosing the buttons and map inset off the right side).  I don't normally use it anyway, so I figured I'd just get rid of it.  I could still access the normal Google Maps homepage without disabling the stylish by using the \"www.google.com/maps\" page (because these stylish's only change \"maps.google.com\".  Never know when Google might break my Stylish!\r\n\r\nDon't worry about the missing \"Get Directions\" button - it's redundant!  Just type \"to\" between two addresses.  Or use the \"MAP THIS!\" extension!  It rocks!\r\n\r\n***\r\n\r\nI also made a Custom toolbar Button for Stylish (that toggles open the Stylish Manager in the browser Sidebar when you left-click it).  It replaces (for me) the button that comes with the extension, but it doesn't have the context menu features.  It requires the \"Custom Buttons\" extension.  \r\n\r\nThe button text code is:  \r\n\r\nthis.textResize = function(evt) {\r\n  if(evt.button == 0 && !evt.shiftKey && !evt.ctrlKey && !evt.altKey) {\r\n\t\ttoggleSidebar('viewStylishSidebar');}\r\n}\r\nthis.setAttribute(\"onclick\", \"this.textResize(event);\");\r\nthis.setAttribute(\"context\", \"\");\r\n\r\nThe button icon is:  chrome://stylish/skin/smallicon.png\r\n\r\n***\r\nAnswer to comment:\r\n\r\nTo put the zoom tool back in, delete exactly the following code:\r\n\r\n#map>div:first-child+div+div+div,\r\n\r\nIf you do that, it may overlap with the text box(es) when the sidebar is open.  If you have a scroll wheel mouse, it's probably better just to scroll in and out and click+drag to pan the view.  You can also position the  zoom control absolutely (maybe on the right side between the buttons and inset map?), but I couldn't find anywhere aesthetically pleasing to me, especially when one considers different window sizes.   YMMV.\r\n\r\nI haven't figured out how to make Google Maps open with the sidebar closed yet (unless you delete it entirely).  I don't think I can do that with a style, as it may require running a script.  \"Google Maps Minimal\" uses on-hover effects to hide and show the toolbar, if you want to try that.\r\n\r\nP.S.  They're both after pics below.  I'm sure you know what Gmaps looks like.","user":{"id":4394,"name":"FLskydiver","email":"redacted","paypal_email":"CTskydiver@gmail.com","homepage":null,"about":null,"license":null},"admin_delete_reason_id":null,"updated":"2010-03-04T23:53:11.000Z","weekly_install_count":2,"total_install_count":17652,"rating":null,"screenshot_url":"https://userstyles.org/style_screenshots/3782_after.gif?r=1597305985","url":"/styles/3782/google-maps-max-updated","discussionsCount":8,"commentsCount":8,"css":"@namespace url(http://www.w3.org/1999/xhtml);@-moz-document domain(maps.google.com)\r\n{\r\n#map>div:first-child+div>*,#guser,#gbarl,#gbarc,#gbar,#map>div:first-child+div+div+div,#links.links,#paneltabs,#search .logo{display:none !important;}\r\n\r\n#page {position:absolute!important;bottom:0!important;right:0!important;width:99%!important;height:100%!important}\r\n#search {position:absolute!important;left:420px!important;top:25px!important}\r\n}"}