{"id":5690,"name":"about.com-decaf makes about.com forums readable","category":"site","raw_subcategory":"about","subcategory":"about","style_tags":[],"description":"\r\n\r\nWARNING! This style is being discontinued. You can use the search function to look for a host of scripts I am creating for about.com. As about.com is performing changes to their layout it is becoming a pain to keep all fixes in a single file. Instead, I am moving most of the changes into individual scripts which are easier to maintain.\r\n\r\n\r\n\r\nVersion 0.1\r\n\r\nThis style for about.com forums is my first; it was created because the glaring large white areas are bad on the eyes, the font is too small with too little contrast, the message is area too narrow etc.\r\n\r\nThis style addresses these issues; it has a coffee-and-milk colour theme, and it must be decaf because it removes many unwanted items ;). \r\n\r\nScreenshots in real size:\r\nhttp://www.nyboria.de/images/pre-decaf.jpg\r\nhttp://www.nyboria.de/images/post-decaf.jpg\r\n\r\n\r\nUpdate to version 0.2: Lighter background, better contrast, removal of grey text, some further color changes.\r\n\r\nUpdate to version 0.3: no functional changes, but added comments and changed the sequence to make customizing the style easier for you.\r\n\r\nUpdate to version 0.4: the previous versions proved not to be invertible; not all elements would gracefully convert when settings were made for a dark background with light foreground. 0.4 addresses that. Conversion still isn't perfect, especially as some icons and images used on the forums presuppose a light (actually white) background. You'll want to set the foreground color not too light, or you will not be able to see some of the elements in message windows and the editor.\r\n\r\nUpdate to version 0.4.1: Just a small added function: remove the maximum height for signatures, so signatures don't get cut off at 500 px. They may also be as wide as possible now, no artifical width restriction anymore. You can decrease the maximum-height, too, if those giant signatures bug you. \r\n\r\nUpdate to version 0.4.2: no additional functionality, but as about.com have now wisely given in to the demands of users who wanted the avatars on top of the message rather than have them waste space to the left, the code for removing the avatars has now been dropped from the script. If you do not upgrade (or remove the code yourself) you will not see who sent a message anymore.\r\nThe update is not perfect, there's a bit of border missing, but as about.com is going to change even more things in the near future I am not going to remedy small design errors, just keep functionality alive. I suppose once the amendment of the redesign is finished I'll whip up a new script to make the forums (and possibly the whole site design) editable.\r\n\r\nUpdate to 0.4.3: search boxes were set to white text on white background, this update remedies that and leaves input boxes alone in the editor. This might cause trouble when you try to invert the color scheme, but such inversions are probably more hassle than it is worth anyway. With the exception of actual usability bugs like this one decaf will not be developed further; instead I will concentrate on individual fixes to about.com design blunders like the avatar fix already available here: http://userstyles.org/styles/7654 .\r\n\r\nOr maybe the programmers in question will see the light and fix things themselves... ;)\r\n\r\n\r\nA word of caution:\r\n\r\nMake sure that you save a self-edited style under a different name, so that your changes do not get overwritten with the next update.\r\n\r\nEnjoy!","user":{"id":6742,"name":"bitpicker","email":"redacted","paypal_email":"robinpfeifer@web.de","homepage":null,"about":null,"license":null},"admin_delete_reason_id":null,"updated":"2008-06-05T01:41:22.000Z","weekly_install_count":0,"total_install_count":384,"rating":null,"screenshot_url":"https://userstyles.org/auto_style_screenshots/5690-after.png?r=1588493039","url":"/styles/5690/about-com-decaf-makes-about-com-forums-readable","discussionsCount":2,"commentsCount":2,"css":" /*\r\n   Welcome to the Decaf style for about.com forums, version 0.4!\r\n\r\n   This is a style for the Stylish extension for the Firefox browser.\r\n   It is supposed to make the forums more easily readable. It also \r\n   removes some possibly unwanted items. It includes\r\n   comments for easier editing and customizing of the style.\r\n   To remove a block, make sure you remove it completely including \r\n   its closing bracket. Alternatively, use the slash - asterisk ...\r\n   asterisk - slash notation to comment unwanted things out.\r\n\r\n   This version 0.4 now permits improved inversion of the color scheme.\r\n   You can now easily set a dark background and light foreground.\r\n   The editor window is now excluded from color changes by default.\r\n   */\r\n\r\n\r\n   /* The following line makes sure that the style sheet applies\r\n   only to about.com forums. Better leave it as it is. Don't remove it.\r\n   */\r\n\r\n@-moz-document url-prefix(http://forums.about.com/) {\r\n\r\n\r\n   /*\r\n   The following block gets rid of various items such as the masthead,\r\n   the ads and various other relatively unimportant items. If you \r\n   want to see those items, remove the block, but the result may not look\r\n   nice.\r\n   */\r\n\r\n#globalwrapper, #adL, iframe, div.ptcAdSpace, #ptcBrandFooter, div#pfBelowMsgsHtml, div.ptcBranding span  {\r\ndisplay:none !important;\r\n}\r\n\r\n\r\n   /*\r\n   This block makes the display of the message wider. It represents the\r\n   width of the editor window more faithfully, but I can't do anything\r\n   about signature widths. You can fiddle with the width (in pixels).\r\n   */\r\n\r\ndiv.pfMsgText {\r\nwidth:550px !important;\r\n}\r\n\r\n   /*\r\n   The following section sets the background color for the whole forum.\r\n   The layout makes it necessary to set individual background colors\r\n   for lots of items in order to gain a single continuous background.\r\n   Better leave the items alone, but you can change the color. If you\r\n   don't like the default #f7f2eb, replace it with another value.\r\n   You can find different color codes at:\r\n   http://www.w3schools.com/html/html_colornames.asp\r\n   and you can find well-matched sets of colors using:\r\n   http://colorblender.com/\r\n   */\r\n\r\nbody.ptWrapBody, tr.ptcHead th, tr.ptcSpacer td, td.ptcHead, td.ptcValue, td.ptcName, table .ptAttachInfoPageTable td, div.ptNavpost, div.ptcBranding, div.ptcSearch, div.ptNavDiscussionList, div#PTID-discussionList-header-discussionListMenuBar, div.ptNavmessageList, div#ptcHeaderDescription.ptcForumHeader, div.ptcBacktoDiscussion, a.vBtn, td#ptcBodyContents.ptcListContainerCell, td.ptcListContainerCell, td.ptcListContainerCellRight, tr.ptcHeadRow *, td.pfFolder, td.pfEmptyFolder, table#pfDiscListTable.ptcContentTable *, td.ptcTableContainerCell, td.ptcListContainerCellLeft, td.ptcValueCell, td.ptHeaderText, td#ptcBodyRight.ptcListContainerCellRight, a.ptbAction, a#MBbtnWysiwyg.vBtn {\t\r\nbackground-color:#f7f2eb !important;\r\nbackground-image:none !important;\r\n}\r\n\r\n\r\n   /*\r\n   The following three sections set the color for anything that isn't\r\n   black (the default #865c3d is dark brown) and not the background color.\r\n   Change as per instructions above if you don't like it. The first \r\n   changes borders of items, the second backgrounds, the third text.\r\n   You'll probably want to keep all three the same color. Or maybe not.\r\n   */\r\n\r\n   /* Borders */\r\n\r\niframe#mMsg_body_Editor.mMsg_body_EditorStyle table.ptcTableContainer, caption, table.pfMsgDisplayTable, table.ptcListContainer * {\r\nborder-color:#865c3d !important;\r\n}\r\n\r\n   /* Backgrounds */\r\n\r\ncaption, div.ptcHeadertext, tr.ptHeadertext {\r\nbackground-color:#865c3d !important;\r\n}\r\n\r\n   /* Text */\r\n\r\na, span.ptcWelcome, span.ptbLogout, a.basic, a.navLink, td.ptcValue a, a.ptbAction, li a, div#ptcContentTop.ptcWrapperHeader a, div.ptBlueBody a, th.ptcNameCell {\r\ncolor:#865c3d !important;\r\n}\r\n\r\n   /*\r\n   The following section makes things black. You may want to change it to\r\n   white if you want to invert the color scheme. Black is #000000, \r\n   white is #ffffff.\r\n   */\r\n\r\ntable.pfSearchResultsSummary, td.ptcListContainerCellRight, td.ptcNameCell, td.ptcValueCell, th.ptcName, td.ptcValue, td.ptcName, td.ptHeadertext, div.ptcBranding a, div.ptBlueBody td, span.ptcNameCell, a.ptcMemberLink, div#ptcLogout, td.ptcHead, td.ptTitleBarText, ul.ptcListStack li, tr.ptcHead th, input, table.ptAttachmentAllocation td, table.ptAttachInfoPageTable td, div#ptcHeaderDescription.ptcForumHeader p, span.ptcListPrefix, span.ptcListText, button.ptbMenuLink, ul.ptcListFlow li, div.ptcDescText, table#mMsg_PorS td, div.csInstructionText, div.csReplyToMessageHeader, div#csPostOptionsDiv.csPostOptions label {\r\ncolor: #000000 !important;\r\n}\r\n\r\n   /*\r\n   The following section makes things white. You may want to change\r\n   it to black if you want to invert the color scheme. \r\n   Black is #000000, white is #ffffff.\r\n   */\r\n\r\ncaption, div.ptcHeadertext, tr.ptHeadertext, td.pfMsgBody  {\r\ncolor:#ffffff !important;\r\n}\r\n   /*\r\n   The following section keeps the message window white.\r\n   You definitely want to keep it that way if you are\r\n   going for a dark background. If your background is\r\n   light and you want it to be used inside the message\r\n   window, remove the section. You can also change the\r\n   background color of the message window separately here,\r\n   but keep in mind that people might want to use color\r\n   in what they write, and you might not be able to \r\n   read it anymore.\r\n   */\r\n\r\ntd.pfMsgBody, td.pfMsgBody *, td.pfMsgOptions, td.pfMsgEnvelope, td.pfMsgActionBar * {\r\nbackground-color:#ffffff !important;\r\n}\r\ntd.pfMsgBody, td.pfMsgBody span.ptcListPrefix, td.pfMsgBody span.ptcListText {\r\ncolor:#000000 !important;\r\n}\r\n\r\n   /*\r\n   The following section keeps the editor window white.\r\n   Better keep the section unless you want to use a very\r\n   light background for the whole forum and display it\r\n   in the editor, too. If so, remove.\r\n   */\r\n\r\n/*\r\ntable#mMsg_body_Toolbar *, td.mMsg_body_ToolbarArea *,\r\niframe#mMsg_body_Editor, iframe#mMsg_body_Editor.mMsg_body_EditorStyle, tr#mMsg_body_TabRow *, div#mMsg_body_Toolbar *, table#pfEditMessageFields.ptcContentTable * {\r\nbackground-color:#ffffff !important;\r\nborder:none !important;\r\n}\r\n*/\r\n   /*\r\n   The following section makes various small text bits bold.\r\n   Delete if you don't like that.\r\n   */\r\n\r\na, span.ptcWelcome, span.ptbLogout, a.basic, a.navLink, td.ptcValue a, a.ptbAction, li a, div#ptcContentTop.ptcWrapperHeader a, a.ptcMemberLink {\r\nfont-weight:bold !important;\r\n}\r\n\r\n   /*\r\n   The following section removes the background image the forum uses\r\n   in some headings (the light grey-white tinge). Necessary if you want\r\n   to see a background color set above.\r\n   */\r\n\r\ntable.ptcContentTable caption, div.ptcHeadertext, tr.ptHeadertext, div.ptcSearch, div.ptcBacktoDiscussion, div.ptcBranding td {\r\nbackground-image:none !important;\r\n}\r\n\r\n   /*\r\n   The following section removes some borders which break the\r\n   background color. Better not touch.\r\n   */\r\n\r\nbody div, span, h1, h2, h3, h4, h5, h6, p, font, li, div, td, span, caption, tbody, th, a {\r\nborder:none !important;\r\n}\r\n\r\n   /*\r\n   The following section does the same as the one above for a different item.\r\n   Don't touch.\r\n   */\r\n\r\ntable.ptcContentTable {\r\nborder-style:none !important;\r\n}\r\n\r\n   /*\r\n   The following section sets the border width around messages.\r\n   Not sure whether you want to change that.\r\n   */\r\n\r\n\r\ntable.pfMsgDisplayTable {\r\nborder-width:1px !important;\r\n}\r\n\r\n\r\n   /*\r\n   The following section makes sure you still get to see the editor.\r\n   Don't touch.\r\n   */\r\n\r\niframe#mMsg_body_Editor.mMsg_body_EditorStyle {\r\ndisplay:inline !important;\r\n}\r\n\r\n   /*\r\n   The signature area has a standard maximum height of 500 pixels.\r\n   The following section removes this restriction, so signatures\r\n   can be any size. If you don't want those mega-large signatures\r\n   which take up a lot more space than what makes the original post,\r\n   set a smaller value, for instance 200px instead of 'none'.\r\n   The 'width' line removes the width restriction so you don't have\r\n   to scroll sideways anymore.\r\n   */\r\n\r\ntd.pfMsgBody div.pfMsgSig {\r\nmax-height:none !important;\r\nwidth:100% !important;\r\n}\r\n\r\n\r\n   /*\r\n   This final section sets a specific size value because else\r\n   some text just gets bigger while you travel around. Don't touch.\r\n   */\r\n\r\ntd.ptcValue {\r\nfont-size:0.8em !important;\r\n}\r\n\r\n}"}