{"id":57226,"name":"Custom AppChan","category":"site","raw_subcategory":"4chan","subcategory":"4chan","style_tags":[],"description":"Don't like the colors of AppChan or just wanna take a shot at doing your own? This userstyle serves to take the color portions of style 54149 and simply move them out of the layout and position elements to allow easier customization to fit your needs.\r\n\r\nCurrently only the original AppChan color scheme, Midnight Caek, and Muted are supported. More options will become available as I rewrite them with better commenting.\r\n\r\nIf you feel comfortable trying to make your own color scheme from scratch for AppChan without having a base, without having to edit CSS, or simply using the \"Tomorrow\" scheme as a base, style 55308 provides a simple interface which should be compatible with AppChan unless user 98506 decides to deviate style 56312 in a direction different than AppChan. With the preceding warning in mind, this style should also be compatible with OneeChan.","user":{"id":118804,"name":"AppChan","email":"redacted","paypal_email":"jinira@hotmail.com","homepage":null,"about":null,"license":null},"admin_delete_reason_id":null,"updated":"2011-11-30T15:13:40.000Z","weekly_install_count":0,"total_install_count":438,"rating":null,"screenshot_url":null,"url":"/styles/57226/custom-appchan","discussionsCount":0,"commentsCount":0,"css":"/* Custom AppChan - For use with \"Custom AppChan\" color scheme option in AppChan\r\nMake sure to always enable AFTER AppChan to override the settings.\r\nEverything is labelled for you here. Play around with settings, use a site like palettebuilder.com to find a nice color scheme from one color. Use GIMP or Photoshop or your preferred image editor to pick new colors to get the hexidecimal (#color) of it.\r\nDo not delete selections here. This will not remove what you want, but rather, default it to AppChan's colors to make it uncustomizable from here. Add \"display: none !important;\" to the section instead to remove things. \r\n\r\nTo uncomment something remove the slashes and stars.\r\n*/\r\n\r\n@-moz-document domain(\"4chan.org\") {\r\n\r\n/*[[scheme]]*/\r\n\r\n}"}