{"id":5875,"name":"Statusbar: Mouseover for clutter","category":"app","raw_subcategory":"browser","subcategory":"browser","style_tags":[],"description":"Not sure if someone already did this or something similar, but I just came up with it and it was a simple script to whip up.\r\n\r\nBasically it hides all the statusbar items except those that are in plain vanilla Firefox... until you mouseover, then the statusbar returns to its normal clutter so you can use all the items there.\r\n\r\nThink of it as a variant on Windows' taskbar's \"Customize notifications\" idea, where you can hide system tray icons.\r\n\r\nMade for Firefox 3, I expect it should work for older versions of Firefox.  If newer versions put new items in the statusbar, those will be hidden until this script is updated.\r\n\r\nMenus from icons act a bit funky but they are still functional.\r\n\r\n[Edit: Fixed it being applied to ALL statusbars (IE: ArchView).]\r\n\r\n[Edit: To add new items to the exclusion list so they are shown always, open up DOM Inspector (if you have Firefox 3 you'll have to install it from addons.mozilla.org) or, hell, Firebug can probably do it too... and inspect the main firefox chrome window.  Look under #document > window > vbox > statusbar.\r\n\r\nLook at the ids for the different items and compare them to the ones in my list and you should be able to figure out how to add your own.  Firebug's panel, for example, has an id of fbStatusbar.  Icons are handled by the first CSS selector.  Putting another :not(#fbStatusbar) on the first statusbarpanel of the first selector group, and the statusbarpanel in the last selector group will cause Firebug's icon to be always shown.\r\n\r\nHere's a more detailed explanation of the rules, w3.org's specs on CSS can help fill in any gaps.\r\n\r\nThe first selection group deals with things we want hidden.  The first selector hides all images that aren't from Firefox 3's default statusbar items and that aren't menu icons.  The next one hides labels that aren't from Firefox 3's default statusbar items and that aren't in menus.  The last one is a special case for the original Adblock extension which uses a \"spacer\" element to pad its box (CSS padding rule, anyone?).\r\n\r\nThe second selection group is a hack which overrides the first group to make sure all menu images display, and for some reason the security button label.  I forget why I did that instead of making it an exception.  I don't think the security button is even used in Firefox 3 anymore.\r\n\r\nThe last group removes all the padding from the statusbarpanels and forces their widths to 0.\r\n\r\nIf you're wondering why the rules are so complex and I just don't hide the statusbarpanels, when I did that menus weirded out when you move the mouse outside them and the statusbar and everything hid again.  It works better the way it is now but the menus still behave a bit weird, couldn't figure out how to fix it.  Also in the default Firefox theme you get the dividers for the now-empty panels.  Can't figure out how to fix that either.\r\n\r\nAlso I don't think I figured out how to hide one or two extensions, so those will show all the time. :( ]\r\n\r\n[Edit: Fixed separators always showing.]","user":{"id":1226,"name":"The MAZZTer","email":"redacted","paypal_email":null,"homepage":null,"about":null,"license":null},"admin_delete_reason_id":null,"updated":"2009-07-26T03:27:04.000Z","weekly_install_count":0,"total_install_count":7238,"rating":null,"screenshot_url":"https://userstyles.org/style_screenshots/5875_after.png?r=1584777668","url":"/styles/5875/statusbar-mouseover-for-clutter","discussionsCount":9,"commentsCount":11,"css":"@namespace url(http://www.mozilla.org/keymaster/gatekeeper/there.is.only.xul);\r\n\r\n#status-bar:not(:hover) statusbarpanel:not(#download-monitor):not(#security-button):not(#page-report-button) image:not(.menu-iconic-icon), #status-bar:not(:hover) statusbarpanel:not(#statusbar-display):not(#statusbar-progresspanel):not(#download-monitor) label:not(.menu-iconic-text):not(.menu-text), #status-bar:not(:hover) spacer {\r\n  display: none;\r\n}\r\n\r\n#status-bar:not(:hover) menupopup .menu-iconic-left > image, #status-bar:not(:hover) #security-button label {\r\n  display: -moz-box !important;\r\n}\r\n\r\n#status-bar:not(:hover) statusbarpanel:not(#statusbar-display):not(#statusbar-progresspanel):not(#download-monitor):not(#security-button):not(#page-report-button):not(.statusbar-resizerpanel) {\r\n  padding: 0px !important;\r\n  min-width: 0px !important;\r\n  width: 0px !important;\r\n\r\n  border: none !important;\r\n  -moz-appearance: none !important;\r\n}\r\n\r\n/* Remove this if the statusbar text isn't properly divided with a separator from other elements when not hovered. */\r\n#status-bar:not(:hover) #statusbar-display {\r\n  border: none !important;\r\n  -moz-appearance: none !important;\r\n}"}