{
  "id": 66071,
  "name": "HCTP Titlebar Button Box Fix",
  "description": "Hide Caption Titlebar Plus has been limited by a new Firefox interface change since 12.0a1 version. HCTP 2.6.0 was released to mitigate this problem, but if certain HCTP settings are used, this causes Min-Max-Close button box misalignment.\r\n<b>UPDATE: Newer versions of HCTP have been released solving the major issues covered by this userstyle,</b> but depending on your settings it's still useful, plus it provides some extra solutions.",
  "user": {
    "id": 131773,
    "name": "strel",
    "email": "redacted",
    "paypal_email": null,
    "homepage": null,
    "about": null,
    "license": null
  },
  "updated": "2013-04-09T21:45:04.000Z",
  "weekly_install_count": 0,
  "total_install_count": 522,
  "rating": null,
  "after_screenshot_name": "https://userstyles.org/style_screenshots/66071_after.png?r=1602835495",
  "obsoleting_style_id": null,
  "obsoleting_style_name": null,
  "obsolete": 0,
  "admin_delete_reason_id": null,
  "obsoletion_message": null,
  "screenshots": [
    "https://userstyles.org/style_screenshots/66071_additional_7022.png?r=1602835495"
  ],
  "license": null,
  "created": "2012-05-22T19:55:17.000Z",
  "category": "app",
  "raw_subcategory": "browser",
  "subcategory": "browser",
  "additional_info": "----- <b>NOTE: Newer versions of HCTP after has been released solving the major issues covered by this userstyle,</b> unless you still use 'system buttons' with that versions, in which case this userstyle is still useful, plus it provides some new solutions for the newer versions. <b>https://addons.mozilla.org/en-US/firefox/addon/hide-caption-titlebar-plus-sma/versions/</b> -----\r\n\r\n----- <b>NOTE on 20130409 update</b>: I've updated \"Other uses\" screenshot, so I had to update its URL in code, thus automatic or manual update of the userstyle may have caused the losing of custom settings you could have applied before, and the subsequent reappearance of misalignments. In such case you only have to redo the config. I'm sorry for the inconvenience. -----\r\n\r\nSince FF 12.0a1 version, if HCTP 2.6.0 is used with settings to disable \"Firefox 4+ Titlebar\" and \"Standard Caption (Titlebar)\", this normally causes Min-Max-Close button box misalignment (see main screenshot). Here you can find more info https://addons.mozilla.org/en-US/firefox/addon/hide-caption-titlebar-plus-sma/versions/#version-2.6.0\r\n\r\nHCTP 2.6.# reserves some space for Min-Max-Close button box with 'System buttons' style (which it normally forces) in the upper bar, the size of Aero style buttons box (or some other theme with wide buttons box). But if other way you use a narrow button box, you can use this code to try to adjust it not to waste space in the upper bar (as you can see in the main screenshot). Options are added to do this for the case each one of Menu Bar (in the main screenshot), Navigation Bar, Tab Bar or Bookmarks Bar is used as the upper bar. <u><b>You have to manually activate the code matching the upper bar you use (only for one bar)</u></b>, check the code, its clearly indicated, you only have to add a / character after the standalone * character at the end of the comment that matches the code for your upper bar (closing it) */ Follow code comments instructions.\r\n\r\nHCTP 2.6.# and 2.7.# versions apply solutions for the new FF UI since FF 12.0a1 to mitigate that emerging problems, which made Min-Max-Close button box not to reside in the upper window bar. That means the fullscreen upper bars autohiding feature will not apply for Min-Max-Close buttons. This userstyle provides, independent from the upper bars, Min-Max-Close buttons autohiding styles (that depending on the buttons style used with HCTP, will be an extra one or not, in addition to the one provided by 'Micro close-button' setting). Buttons are not completely hidden on purpose with the provided set, to mark where to hover mouse for showing them, but you can hide them (or almost, depending on the buttons style showed), while keeping them working, follow instructions on the code. To unhide buttons box you have to hover on its specific area, but that will only show these buttons and not the Firefox upper bars; unless you hover on top of the fullscreen window but out of the Min-Max-Close button box area, and without releasing the top bars you hover on the button box area. I've attached some captures to show it.\r\n\r\nI tested this userstyle against HCTP 2.6.0-FF 12.0 and HCTP 2.7.3-FF 23.0a1 with 32-bit FF in Windows. The values are adjusted to windows system buttons styles and my settings, which includes smaller tabs&tabbar and toolbar&buttons from the advanced HCTP options, but these settings probably will fit yours easily; try playing with the values in the code if you need finer tuning.\r\nLet me know if you have code to improve this solution, and I'll add it, or use this code to make your own freely... and ask me if you need any help.",
  "style_tags": [],
  "css": "@namespace url(http://www.mozilla.org/keymaster/gatekeeper/there.is.only.xul);\r\n\r\n/* NOTES: DEPENDING ON HCTP-FF VERSIONS COMBINATION, MIN-MAX-CLOSE BUTTONS IS SHOWED IN EITHER SYSTEM BUTTONS STYLE\r\n(NORMALLY WITH HCTP 2.7.# WITH 'System buttons' NOT DISABLED OR WITH HCTP 2.6.#) OR IN HCTP BUTTONS STYLE (NORMALLY\r\nWITH HCTP 2.7.# WITH 'System buttons' DISABLED). http://cdn.userstyles.org/style_screenshots/66071_additional_7022.png\r\nWITH FF 18.0a1 AND HCTP 2.6.0 SET, I'VE EXPERIENCED MIN-MAX-CLOSE BUTTONS IN MAXIMIZED WINDOWS BUTTONS CHANGING STYLE\r\nRANDOMLY AND INADVERTENTLY FROM TIME TO TIME. THIS USERSTYLE MAY BE EFFECTIVE IN SUCH UNSTABLE EVENT IF YOU LEFT\r\nENABLED CODE SECTIONS CONTROLLING BOTH STATES, BUT BETTER BE AN HCTP AND/OR FF UPDATE. */\r\n\r\n/* INSTRUCTIONS: THIS USERSTYLE IS DIVIDED IN SECTIONS FOR EASY IDENTIFICATION. SECTIONS DESCRIPTIONS ARE PROVIDED\r\nFOR HELP, AND FOR YOU TO DISABLE OR ENABLE THOSE SECTIONS OF THE CODE. TO DO THIS REMOVE (DISABLE) OR ADD (ENABLE)\r\nA FORWARD SLASH / RIGHT AFTER THE ASTERISK * AT THE END OF EACH CODE SECTION BEGINNING COMMENT. */\r\n\r\n\r\n/* YOU CAN (NOT NEEDED) DISABLE THIS SECTION FOR HCTP SHOWING MIN-MAX-CLOSE BUTTONS WITH 'System buttons' STYLE ONLY\r\nFOR THE CASE OF AERO SYSTEM BUTTONS, OR FOR HCTP BUTTONS STYLE. */\r\n#main-window[sizemode=\"normal\"] #titlebar-buttonbox {\r\n  margin-top: -15px !important;\r\n  margin-right: 3px !important;\r\n}\r\n#main-window[sizemode=\"maximized\"] #titlebar-buttonbox {\r\n  margin-top: -9px !important;\r\n  margin-right: 0px !important;\r\n}\r\n/**/\r\n\r\n/* YOU CAN (NOT NEEDED) DISABLE THIS SECTION FOR HCTP 2.7.# VERSION. A -29PX VALUE FOR THE LAST 'margin-top' ITEM OF\r\nTHIS SECTION, WILL HIDE FULLSCREEN MIN-MAX-CLOSE BUTTONS BOX, WHILE STILL TRIGGERING UNHIDE ON HOVER. */\r\n#main-window[sizemode=\"fullscreen\"] #titlebar-buttonbox {\r\n  margin-top: -13px !important;\r\n  margin-right: 0px !important;\r\n}\r\n#main-window[sizemode=\"fullscreen\"] #titlebar-buttonbox:not(:hover) {\r\n  margin-top: -26px !important;\r\n  margin-right: 2px !important;\r\n}\r\n/**/\r\n\r\n/* YOU CAN (NOT NEEDED) DISABLE THIS SECTION FOR HCTP SHOWING MIN-MAX-CLOSE 'System buttons' (SEE NOTE ABOVE). */\r\n#main-window[sizemode=\"normal\"] #hctp-controls-top-fixed {\r\n  margin-right: -7px !important;\r\n}\r\n/**/\r\n\r\n/* ENABLING THIS SECTION FOR HCTP 2.7.# (NOTE IN FULLSCREEN HCTP 2.7.# IS SHOWING HCTP MIN-MAX-CLOSE BUTTONS STYLE\r\nEVEN IF 'System buttons' STYLE SETTING IS USED), WILL AUTO-HIDE FULLSCREEN MIN-MAX-CLOSE BUTTONS TO THE RIGHT OF THE\r\nCORNER, LIKE 'Micro-Close button' SETTING FOR MAXIMIZED WINDOWS WOULD DO (FOR BOTH MAXIMIZED AND FULLSCREEN WINDOWS),\r\nBUT ONLY FOR FULLSCREEN. A 'margin-right' of -47px WILL ALMOST FULLY HIDE BUTTONS WHILE STILL UNHIDING ON HOVER. */\r\n#main-window[sizemode=\"fullscreen\"] #hctp-controls-top-fixed:not(:hover) {\r\n  margin-right: -45px !important;\r\n}\r\n#toolbar-menubar[inFullscreen], #nav-bar[inFullscreen], #TabsToolbar[inFullscreen], #PersonalToolbar[inFullscreen] {\r\n  padding-right: 0px !important;\r\n}\r\n/**/\r\n\r\n\r\n/* THE FOLLOWING SECTIONS ARE ONLY NEEDED IF MIN-MAX-CLOSE SYSTEM BUTTONS STYLE IS USED INSTEAD OF HCTP STYLE (SEE\r\nNOTES ABOVE), AND THERE'S SPARE SPACE IN THE UPPER BAR. ENABLE ONLY ONE SECTION AT A TIME MATCHING THE TOOLBAR YOU\r\nUSE AS UPPER BAR. IF NEEDED, ADJUST 'padding-right' VALUES; FOR WINDOWS AERO MIN-MAX-CLOSE BUTTONS BOX USE A 110px\r\nVALUE, THIS WILL ADJUST ALINGMENT IN MAXIMIZED WINDOWS AND WILL AVOID POTENTIAL PROBLEMS SWITCHING FROM FULLSCREEN */\r\n\r\n/* ENABLE IF MENU BAR IS USED AS THE UPPER BAR (CHECKED 'Menu bar') *\r\n#main-window[sizemode=\"normal\"] #toolbar-menubar {\r\n  padding-left: 0px !important;\r\n}\r\n#toolbar-menubar {\r\n  padding-right: 55px !important;\r\n}\r\n/**/\r\n\r\n/* ENABLE IF TAB BAR IS THE UPPER BAR (UNCHECKED 'Menu bar', CHECKED 'Tabs on Top' AND 'Always show the tab bar') *\r\n#main-window[sizemode=\"normal\"] #TabsToolbar {\r\n  padding-left: 0px !important;\r\n}\r\n#TabsToolbar {\r\n  padding-right: 55px !important;\r\n}\r\n/**/\r\n\r\n/* ENABLE IF NAVIGATION BAR IS THE UPPER BAR (UNCHECKED 'Menu bar' AND 'Tabs on Top', CHECKED 'Navigation Toolbar') *\r\n#main-window[sizemode=\"normal\"] #nav-bar {\r\n  padding-left: 0px !important;\r\n}\r\n#nav-bar {\r\n  padding-right: 55px !important;\r\n}\r\n/**/\r\n\r\n/* ENABLE IF BOOKMARKS BAR IS THE UPPER BAR (UNCHECKED 'Menu bar' AND 'Tabs on Top', CHECKED 'Bookmarks Toolbar') *\r\n#main-window[sizemode=\"normal\"] #PersonalToolbar {\r\n  padding-left: 0px !important;\r\n}\r\n#PersonalToolbar {\r\n  padding-right: 55px !important;\r\n}\r\n/**/\r\n",
  "discussions": [],
  "discussionsCount": 0,
  "commentsCount": 0,
  "userjs_url": null,
  "style_settings": []
}