{
  "id": 70079,
  "name": "Facebook efficient & usable - messaging only",
  "description": "My facebook addiction made my workday very inefficient and I think that it is a waste of time in 2012 anyway. Unfortunately we are dependend on it to communicate via the messaging system. It became sort of a standard in our life. To concentrate on one task which is the messaging, I worked out how to hide everything distracting. Yes really ONLY MESSAGING. No more random shouts, pictures etc from your \"friends\" which are not real friends.. The philosophy is \"if you cannot see it, you will not click on it and not waste time\". An imo already faces of friends are a distraction in you workplace. Quick tutorial what to do to make facebook \"messaging system only\". Read additional info as characters are limited in this field to 1000.. -.-\r\n\r\n\r\n\r\nGood luck!",
  "user": {
    "id": 64120,
    "name": "monn43",
    "email": "redacted",
    "paypal_email": null,
    "homepage": null,
    "about": null,
    "license": "publicdomain"
  },
  "updated": "2012-07-26T15:18:04.000Z",
  "weekly_install_count": 0,
  "total_install_count": 1275,
  "rating": null,
  "after_screenshot_name": "https://userstyles.org/style_screenshots/70079_after.png?r=1602489941",
  "obsoleting_style_id": null,
  "obsoleting_style_name": null,
  "obsolete": 0,
  "admin_delete_reason_id": null,
  "obsoletion_message": null,
  "screenshots": null,
  "license": "publicdomain",
  "created": "2012-07-26T05:35:12.000Z",
  "category": "site",
  "raw_subcategory": "facebook",
  "subcategory": "facebook",
  "additional_info": "1. Unsubscribe from ALL FRIENDS\r\n2. Go to the likes/pages and disable \"show in news feed\" by hovering over the \"liked\" button\r\n3. block all friends who annoy you with event invitations.. yes, if it is important they will invite you personally\r\n4. block and hide everything else until your news page is empty. YES it is possible to make it a white space if you do step 1-3. Only your own newer timeline posts are then displayed.\r\n5. Go offline in chat and click on \"hide sidebar\" button\r\n6. Install my style which then hides on your own (!) timeline (new format) page: \"little friends box\", photos box and the \"big friend box\" on the right. I also remove the \"Whats on your mind?\" and \"Recommended Pages\" box on the startpage, no worries you can still talk from your timeline page to the crowd if necessary one day... \r\n7. Install Ad Block Plus to remove the annoying advertisement\r\n8. If you have done everything right you should have a white facebook feed and now pictures of friends displayed anywhere I think..\r\n9. Now you can use the messaging system on the left top only and nothing will distract you unless you search for it.. less unconscious procrastination\r\n\r\nUpdate: now also hides: chatbox on the right corner, group numbers so you do not get annoyed by groups you just joined to look into from time to time (!!!),\r\nyour profile icon so you do not think about replacing it, \"people you may know box\" in messages area, \"events\" box - very annoying and few more little things..",
  "style_tags": [],
  "css": "@-moz-document domain(\"facebook.com\") {\r\n/* works with facebook version july 2012*/\r\n#pagelet_timeline_friends_nav_top,\r\n#pagelet_timeline_photos_nav_top,\r\n.timelineReportContainer,\r\n#pagelet_composer,\r\n#pagelet_organic_ego_pane,\r\n#appsNav,\r\n#listsNav,\r\n#pagelet_stream_pager,\r\n.uiSideNavCount,\r\n.fbDockChat,\r\n.fbxWelcomeBoxBlock{\r\ndisplay: none!important;\r\n}\r\n.fbRemindersStory:first-child{\r\ndisplay: block!important;\r\n}\r\n.fbRemindersStory, .fbFeedTicker{\r\ndisplay: none;\r\n}\r\n#MessagingNetegoWrapper{\r\ndisplay: none;\r\n}\r\n#pageNav .firstItem{\r\ndisplay: none;\r\n}\r\n}",
  "discussions": [],
  "discussionsCount": 0,
  "commentsCount": 0,
  "userjs_url": "/styles/userjs/70079/facebook-efficient-usable-messaging-only.user.js",
  "style_settings": []
}