{"id":7507,"name":"Personas: Fix side toolbars and find bar","category":"app","raw_subcategory":"browser","subcategory":"browser","style_tags":[],"description":"So you decided to try out Personas from Mozilla Labs and you think (rightly) that it's quite awesome (Google it if you don't know what the hell I'm talking about.\r\n\r\nBut then you're using an extension with a side-toolbar (like All-in-One Sidebar) and you notice it isn't skinned all the way down!  Personas skins only cover as much as their image height, after that you get the default theme color for the toolbars, which often doesn't match.\r\n\r\nPersonas might be patched to give themes \"default\" colors  that extend past the end of the theme image, but for now I whipped up a fix in Stylish to do it!\r\n\r\nThere are two fixes.. two CSS lines.  The enabled one will tile the header image across the whole window (except the statusbar, and except the find bar if the peraona already skins that).  This will look ok for most cases, but it is possible depending on theme it won't tile well, especially if the side toolbar is on the right.\r\n\r\nSo you can try the other fix,  but for that you have to figure out the color you want the fixed background to be.  I believe there is an extension called Colorzilla that will help with this.  Then fill it in and uncomment that line, and comment the other one.  This other fix might make the find bar look better too, if the persona doesn't already specifically theme it.\r\n\r\nNote that either fix might not look right where the statusbar joins the side toolbar/find bar, depending on skin.  You'll just have to make your own persona that doesn't have this problem. :(\r\n\r\nThis is my workaround for mozdev bug 18333: https://www.mozdev.org/bugs/show_bug.cgi?id=18333","user":{"id":1226,"name":"The MAZZTer","email":"redacted","paypal_email":null,"homepage":null,"about":null,"license":null},"admin_delete_reason_id":null,"updated":"2008-05-24T16:27:36.000Z","weekly_install_count":0,"total_install_count":1510,"rating":null,"screenshot_url":"https://userstyles.org/style_screenshots/7507_after.png?r=1580112071","url":"/styles/7507/personas-fix-side-toolbars-and-find-bar","discussionsCount":1,"commentsCount":1,"css":"@namespace url(http://www.mozilla.org/keymaster/gatekeeper/there.is.only.xul);\r\n\r\n#main-window {\r\n  /* background-color: #000000 !important; */\r\n  background-repeat: repeat-y !important;\r\n}"}