{"id":78256,"name":"I Had the Blues But I Shook Them Loose","category":"site","raw_subcategory":"tumblr","subcategory":"tumblr","style_tags":[],"description":"The flying kid from the album cover as your tumblr home icon","user":{"id":157273,"name":"KennyVee","email":"redacted","paypal_email":null,"homepage":"http://kennyvee.tumblr.com","about":"I don't really do these anymore -- it was a lot of work for very little thanks. I'm not going to delete the ones I did, but don't expect many new styles to pop up here (except when I make things for myself, but you're naturally welcome to use those things as well).\r\n\r\nI will, on request, update icon sets to work with tumblr again after tumblr changes on 10/30/2014 and 12/09/2014 which made them stop displaying correctly. I don't really want to sit and re-write around 120 sets of code that I don't know if anybody is even using, which is why I do it by request (as of this latest edit, I've only received one such request so I'm guessing that not many are being used at all).\r\n\r\nHere are the sets that have been updated since the last tumblr change, when they added the \"Discover\" button:\r\n\r\n• PeopleMover (Disneyland) icon bar\r\n• PeopleMover (WDW) icon bar - small\r\n• Owl Post message icon\r\n\r\nLikewise, any styles created after December 9, 2014 (like TRON tumblr home icons) should work. For now.\r\n\r\nIf you want another set updated to get rid of the blank space that now appears since tumblr added the \"Discover\" button (or if it broke in the earlier October tumblr change), send me a message <a href=\"http://kennyvee.tumblr.com/ask\">on my blog</a>. Please include the title of the style as it appears here to make it easy for me to find since tumblr's ask system doesn't allow you to send me a direct link to it, and I'll get it working and reply privately to tell you to re-download it with the new code.\r\n\r\nThen we'll see how long it takes for tumblr to break it again.","license":"publicdomain"},"admin_delete_reason_id":null,"updated":"2014-10-04T01:31:25.000Z","weekly_install_count":0,"total_install_count":63,"rating":null,"screenshot_url":"https://userstyles.org/style_screenshots/78256_after.jpeg?r=1588320287","url":"/styles/78256/i-had-the-blues-but-i-shook-them-loose","discussionsCount":0,"commentsCount":0,"css":"@-moz-document url-prefix('http://www.tumblr.com'), url-prefix('https://www.tumblr.com')   { #popover_blogs .tab_notice:after{display:none}.l-header .iconic>a{background-image:url('http://25.media.tumblr.com/tumblr_mdd5g5TU9C1rgncooo1_250.png') !important;} \r\n\r\n  .tab_bar .iconic a.tab_anchor {\r\n  background-size: 175px 36px;\r\n}\r\n\r\n}"}