{"id":84876,"name":"000webhost.com - block \"unblockable\" ads","category":"site","raw_subcategory":"000webhost","subcategory":"000webhost","style_tags":[],"description":"Revision 2 -- Updated 4/20/13 (combined private rev 1 4/17 and  2 4/19)!!\r\n- updated the CSS since they changed some stuff again on their end, \r\n- added page-independent settings \r\n- fixed login screen being blanked out\r\n- removed the ad-bearing header tabs (only the logo is shown now)\r\n- removed the \"earn money' ad on the site selection page\r\n\r\nblocks some of the annoying tables that adblock wont block even when using the element hiding helper\r\nthis works for the cpanel page mainly. \r\n\r\nRevision 0 - Initial Release 3/23/2013 \r\n- will make your cpanel experience ad-free :)","user":{"id":87204,"name":"osirisgothra","email":"redacted","paypal_email":"osirisgothra@hotmail.com","homepage":"http://www.github.com/osirisgothra","about":"Gabriel Sharp\r\n\r\nI consider myself a lifetime student of Computer Sciences and Information Sciences, as the time for learning is never over, especially when working in a field that deals with envelopes that are ever-changing, pushing endlessly, so to speak. My work and play cross paths often since I get a lot of joy out of what I do and study, some of which are:\r\n\r\n- Perl + CPAN Developer\r\n- Linux C++ Developer (Qt4, Qt5, KDE4, KFM5, and related)\r\n- Shell Script Developer (Perl, BASH, sh, upstart, vim plugin development)\r\n- Web Style Developer (CSS, SaSS, SGML, HTML5, etc) though I do know HTML4 too [who doesn't?]\r\n- Windows C++ Developer (Old Pro in Microsoft related technologies)\r\n- Old-School Technologies (qbasic, vbdos, borland c++, ms-dos 6.66, i386 assembler /w emphasis on _some_ 64-bit stuff)\r\n- Music Hobbyist (Electronic Music Writer, Piano, Keyboard player/Enthusiast)\r\n- Graphic Artist (Pencil/Pen/Watercolor physical media, Maya/Blender/3DSMax/Bryce/Gimp/Photoshop HD and post-production)\r\n\r\nI am not currently in any group at the time. I am not sure if I will be doing that ever again. The last few groups I participated in were too incoherent and seemed to have different ideals, ethics, goals. \r\n\r\nI am open to suggestion or requests, just don't make them impossible for a single person to do. Requesting a theme have a black version is probably okay. Requesting that I personally show up and restyle your entire website is probably not. Of course, if I were getting paid to do it, that would be a whole other matter, but I rarely see people paying for such things these days when you can hire someone in another country to do it for 2 cents -- that's right I'm a bitter man :D= <- those are vampire teeth!!","license":"publicdomain"},"admin_delete_reason_id":null,"updated":"2013-04-20T04:00:07.000Z","weekly_install_count":0,"total_install_count":190,"rating":null,"screenshot_url":"https://userstyles.org/style_screenshots/84876_after.jpeg?r=1588752331","url":"/styles/84876/000webhost-com-block-unblockable-ads","discussionsCount":0,"commentsCount":0,"css":"@namespace url(http://www.w3.org/1999/xhtml);\r\n\r\n\r\n@-moz-document url-prefix(\"http://members.000webhost.com/cpanel.php\") {\r\n\r\n/*\r\nUPDATE APRIL 20 2013\r\nSynchronized site changes to this style, everything should match up now\r\n\r\nUPDATE APRIL 19 2013\r\nForget it, I'm disabling the tab bar by default now because I found that\r\nthe links are availble on the pages elsewhere (dropdown combobox, for example)\r\nso if you REALLY want it back, comment out the header section. My next\r\ntarget is to do the restyling of the cpanel/siteselection/login\r\nscreen  alltogether   Please dont request for me to modify the site like\r\nget rid of the captcha and stuff like that, im not the webmaster, i hate\r\nwhen people ask me that.. so please. dont. I can only make CSS style changes\r\nand CSS only allows for some html changing, which i feel could be better but\r\nI guess that would be considered hacking the site... now wouldnt it. But\r\nreally, i guess if you dont want it restyled at all just make the whole thing\r\njava or something. I have and always will represent freedom of customization\r\nwhen it comes to color. Many of us hate the white background, thats gonna\r\nbe the next thing to change... ok?   Please do request color schemes.\r\n\r\nUPDATE APRIL 17 2013\r\nas much as i'd like to get rid of \"EARN MONEY\" tab on the top-right\r\ntab bar, it is in fact using the old MAP element, which is not CSS at all\r\nand unfortunately cant be manipulated... i could hide it I guess but then\r\nyou wouldnt have access to the other links, if you dont care uncomment the\r\nthing anways, its available below under \"header\"\r\n\r\nif cpanel changes the position of the tables, you must change\r\nthe numbers, if you dont use adblock you will need to block the\r\ncontent tables as well -- this css style will do this for you\r\nwithout the need for adblock at all, but ONLY for this page\r\nyou will need adblock for the rest of the site if you want it\r\nI find it annoying when trying to build a site having ads smack\r\nin the middle of my face, if anything it will make me change to\r\na different free provider who wont (and they ARE out there)\r\n\r\nthese elements listed below corrospond to these parts (as of 3/23/2013)\r\nbut may change position, id, and/or classnames over time (i may\r\nor may not update this in the future hard to say, best thing to do\r\nis update it yourself)\r\n\r\n#container>#maincontent>div>p  =  \"if you like our serv...ys\" paragraph\r\n#container>#maincontent>div>table  =  the link/donate/pay for services links following the above\r\n#sidebar1>p>a>img  = the \"Upgrade to Premium Service\" picture ad below your account info\r\nbody>div>div>table:nth-child(5)  =  the \"sponsors\" table\r\nbody>div>div>table:nth-child(7) = the \"get a premium domain name\" and \"get yourdomain.com for free!\" table\r\n\r\nnote that you can get a yourdomain.tk for free, you dont need to spend money on a domain that is 100% your own\r\nthe internet was founded as a free place, theres supposed to be no charge for basic internet services like domain names\r\nand stuff like that, the only cost is supposed to be in actual services that might have costs... even this most the time\r\ncan be found free... as you can see, the rich fancy websites pay so that us poor websites can exist without having to...\r\ni encourage you if you have lots of money to support and do your part however!\r\n\r\n(im poor to the bone)\r\n*/\r\n#container>#maincontent>div>p,\r\n#container>#maincontent>div>table,\r\n#sidebar1>p>a>img,\r\n/* i had to change this to 7 and 9, put this back to 5 and 7 if\r\nyou experience problems, this may be due to the 'attack' notifications\r\nthat it gives sometimes */\r\n\r\nbody>div>div>table[id=\"sharedtable\"]:nth-child(7),\r\nbody>div>div>table[id=\"sharedtable\"]:nth-child(9)\r\n{\r\ndisplay:none !important;\r\n}\r\n\r\n/*\r\nthis _should_ hide the DDOS attack notice\r\nif it hides the main menu, then they changed their site again\r\nand you will need to comment this out, the only difference between\r\nthe DDOS table and the main menu table is the \"border=0\" tag, other\r\nthan that they are identical except that DDOS is NOT a sharedtable\r\nclass id, but i felt that it could break things worse if i did it that\r\nway----comment these lines out if you dont want/need DDOS attack info\r\nto be blocked\r\n*/\r\ndiv#mainContent>table[border=\"0\"]\r\n{\r\ndisplay: none !important;\r\n}\r\n\r\n/* in my opnion, the domain combobox is hard to read when it is so small\r\ncomment this out for regular size, its precent so even small screens shouldnt\r\nsuffer, and its only the minimum size, larger screens wont be affected!*/\r\nselect#accountID\r\n{\r\nmin-width: 50%;\r\n-moz-appearance: button;\r\n}\r\n\r\n}\r\n\r\n\r\n@-moz-document url-prefix(\"http://members.000webhost.com/?login_hash\") \r\n{\r\n/* this is for the cpanel access page ONLY \r\n   (gets rid of the EARN MONEY ad */\r\ndiv#sidebar1>p+p\r\n{\r\ndisplay: none !important;\r\n}\r\n\r\n}\r\n\r\n/************       header        (all pages) ***********************/\r\n/*\r\n    Uncomment this if you want it, this will remove the image map and\r\n    all the tabs, and display the logo without the tabs, which is fine if\r\n    you don't use them, otherwise you may want them on. I dont like them\r\n    because they sneak that AD (earn money) inbetween the two tabs, and\r\n    actually theres only two real useful buttons and they are both \r\n    accessible via other links on the page (like the dropdown button\r\n    combobox) and the \"Get Help\" button is pretty easy, if you need the\r\n    get help button you probably wont be using this style to begin with\r\n*/\r\n@-moz-document domain(\"members.000webhost.com\")\r\n{\r\ndiv#header>img\r\n{\r\ndisplay: none !important;\r\n}\r\ndiv#header\r\n{\r\nmin-height: 64px !important;\r\nbackground-image: url(\"http://members.000webhost.com/images/header.gif\") !important;\r\n}\r\n}\r\n"}