{
  "id": 94444,
  "name": "anime128",
  "description": "Anime, animê (português brasileiro) ou animé (português europeu) em japonês: アニメ, transl. Animação, é qualquer animação1 produzida no Japão. A palavra anime tem significados diferentes para os japoneses e para os ocidentais. Para os japoneses, anime é tudo o que seja animação,",
  "user": {
    "id": 236388,
    "name": "zero hero",
    "email": "redacted",
    "paypal_email": null,
    "homepage": null,
    "about": null,
    "license": null
  },
  "updated": "2013-10-24T23:34:27.000Z",
  "weekly_install_count": 0,
  "total_install_count": 917,
  "rating": null,
  "after_screenshot_name": "https://userstyles.org/style_screenshots/94444_after.jpeg?r=1591776324",
  "obsoleting_style_id": null,
  "obsoleting_style_name": null,
  "obsolete": 0,
  "admin_delete_reason_id": null,
  "obsoletion_message": null,
  "screenshots": null,
  "license": "ccby",
  "created": "2013-10-24T23:21:32.000Z",
  "category": "global",
  "raw_subcategory": null,
  "subcategory": null,
  "additional_info": "Com a ocupação dos Estados Unidos no fim da Segunda Guerra Mundial, muitos artistas japoneses tiveram contato com a cultura ocidental e, influenciados pela cultura pop dos Estados Unidos, desenhistas em início de carreira começaram a conhecer os quadrinhos e desenhos animados na sua forma moderna. Havia negociantes que contrabandeavam rolos de filmes americanos, desenhos da Disney e outros.\r\nEm 1967, surgiram quatro filmes e catorze séries animadas no Japão, entre elas A Princesa e o Cavaleiro, Fantomas e Speed Racer, o primeiro com grande projeção internacional\r\nEntre os principais artistas que se envolveram com a tal arte, estavam Osamu Tezuka, Shotaro Ishinomori e Leiji Matsumoto. Estes três jovens, mais tarde, foram consagrados no mercado de mangá. Na década de 1950, influenciados pela mídia que vinha do Ocidente, diversos artistas e estúdios começaram a desenvolver projetos de animação experimental.\r\nNa época em que o mangá reinava como mídia nasceram os pioneiros animes de sucesso: Hakujaden (A Lenda da Serpente Branca) estreou em 22 de outubro de 1958, primeira produção lançada em circuito comercial da Toei Animation, divisão de animação da Toei Company e Manga Calendar, o primeiro animê especialmente feito para televisão, veiculado pela emissora TBS com produção do estúdio Otogi em 25 de junho de 1962, que teve duração de dois anos.\r\nLogo em seguida, em 1 de janeiro de 1963, foi lançado Astro Boy, baseado no mangá de Osamu Tezuka, já com a estética de personagens de olhos grandes e cabelos espetados vinda da versão impressa. Astro Boy acabou tornando-se o propulsor da maior indústria de animação do mundo, conquistando também o público dos Estados Unidos. Tezuka era um ídolo no Japão e sua popularidade lhe proporcionou recursos para investir em sua própria produtora, a Mushi Productions. Outras produtoras investiram nesse novo setor e nasceram clássicos do anime como Oitavo Homem (Eight Man), Super Dínamo (Paa Man), mas ainda com precariedade e contando com poucos recursos, diferente das animações americanas.\r\nAnimês infantis, infanto-juvenis femininos e sobre robôs gigantes acompanharam o crescimento do número de séries semanais durante a década de 19705 . Na época, a Tatsunoko Production, criadora de Speed Racer, lançou um título de sucesso chamado Gatchaman (no Ocidente, Battle of the Planets).\r\nAtualmente no Brasil muitos outros animes são famosos, assim como Pokémon, Cavaleiros do Zodíaco, Dragon Ball e Yu Yu Hakusho temos : Naruto, One Piece, Hunter X Hunter, Fullmetal Alchemist, Death Note, Bleach, Evangelion, Mirai Nikki e muitos outros.",
  "style_tags": [],
  "css": "body{\r\nbackground: url(\"body{ background: url(\\\"https://fbcdn-sphotos-d-a.akamaihd.net/hphotos-ak-ash3/1098173_203395809823710_1125197181_n.jpg\\\") #fff top center fixed !important; }\") #fff top center fixed !important;\r\n}\r\n",
  "discussions": [],
  "discussionsCount": 0,
  "commentsCount": 0,
  "userjs_url": "/styles/userjs/94444/anime128.user.js",
  "style_settings": []
}