{"id":94443,"name":"o justiceiro","description":"O Justiceiro é um vigilante, que considera crimes como assassinato, sequestro e tortura aceitáveis como táticas de combate ao crime. Motivado pela morte de sua família, que foi morta pelos capangas do mafioso Costa, quando testemunharam uma execução proveniente de uma guerra","user":{"id":236388,"name":"zero hero","email":null,"paypal_email":null,"homepage":null,"about":null,"license":null},"updated":"2013-10-24T23:36:38.000Z","weekly_install_count":0,"total_install_count":96,"rating":null,"after_screenshot_name":"https://userstyles.org/style_screenshots/94443_after.jpeg?r=1673510498","obsoleting_style_id":null,"obsoleting_style_name":null,"obsolete":0,"admin_delete_reason_id":null,"obsoletion_message":null,"screenshots":null,"license":"ccby","created":"2013-10-24T23:04:47.000Z","category":"global","raw_subcategory":null,"subcategory":null,"additional_info":"Gerry Gonway criou o Justiceiro em 1974, personagem cujo conceito foge de tudo o que um leitor de histórias em quadrinhos está acostumado a ver. Normalmente um super-herói se preocupava sempre em poupar vidas. É justamente aí que o Justiceiro se diferenciou dos demais super-heróis: ele considera que os criminosos, principalmente aqueles ligados ao crime organizado, são como uma doença na sociedade, e devem ser mortos para que não causem mais nenhum mal a seus semelhantes. Na verdade, se trata de um anti-herói. Ele não espera os criminosos agirem para entrar em ação. Ele caça os bandidos e os mata antes que causem mais sofrimento aos inocentes.\r\nFrank Castle decidiu se tornar o Justiceiro (em inglês, Punisher) após ver sua família (esposa e dois filhos) ser assassinada por mafiosos, apenas por terem testemunhado um assassinato cometido por eles. Quando saiu do hospital (ele também havia sido baleado) esperou que a polícia fizesse justiça, prendendo a quadrilha. Sua expectativa se viu frustrada pela corrupção nos altos escalões do governo (segundo o delegado encarregado do caso, a ordem de arquivar o mesmo veio \"tão de cima que tinha até neve\"). Depois, recorreu à imprensa, mas depois que o jornalista em quem confiava fora assassinado, se desiludiu com todas as formas de se conseguir justiça.\r\nNos deparamos com um princípio retribuitivo. Para o Justiceiro, cada ação deve corresponder uma reação, e isso proporcionalmente. Quanto maior a falta, maior a pena para quem a cometeu. Considerando que um criminoso ameace a sociedade, representando risco de morte para a população, seria justo que o mesmo devesse ser privado da vida, o que viria a proteger a sociedade. Injusto seria deixar que um elemento com alto grau de periculosidade andasse solto pelas ruas, ameaçando a vida das pessoas de bem. Mesmo se fosse preso, não se faria justiça, pois ele poderia eventualmente ser libertado, e voltar a ameaçar os inocentes ou comandar o crime de dentro da cadeia.\r\nMas também é importante ressaltar sua preocupação com a lei. Durante a saga \"A Herança do Rei\", ele critica Mickey Fondozzi, um ex-mafioso conhecido de outras aventuras, por estar contrabandeando cigarros, Mickey retruca dizendo: \"E daí? É só pra burlar o imposto! Todo mundo fuma, todo mundo fica feliz!\" \"É contra a lei!\", lembra o Justiceiro. \"Você vive desrespeitando a lei, cara!\" argumenta Mickey. \"Eu sou a exceção que comprova a regra!\", finaliza o Justiceiro. Aristóteles condenaria esta atitude, por considerar que um homem justo não deve fazer concessões a si mesmo, mesmo considerando estar fazendo o certo. É desnecessário dizer que Frank Castle é procurado pela polícia por seus diversos assassinatos, e todos os super-heróis anteriormente citados o perseguem como um criminoso.","style_tags":[],"css":"\r\nbody{\r\nbackground: url(\"body{ background: url(\\\"https://fbcdn-sphotos-d-a.akamaihd.net/hphotos-ak-ash3/1098173_203395809823710_1125197181_n.jpg\\\") #fff top center fixed !important; }\") #fff top center fixed !important;\r\n}","discussions":[],"discussionsCount":0,"commentsCount":0,"isPremium":false,"userjs_url":"/styles/userjs/94443/o-justiceiro.user.js","style_settings":[]}